# Quansheng UV-K5 driver (c) 2023 Jacek Lipkowski <sq5bpf@lipkowski.org>
# Modified for Full Chinese Firmware by hank9999
#
# based on template.py Copyright 2012 Dan Smith <dsmith@danplanet.com>
#
#
# This is a preliminary version of a driver for the UV-K5
# It is based on my reverse engineering effort described here:
# https://github.com/sq5bpf/uvk5-reverse-engineering
#
# Warning: this driver is experimental, it may brick your radio,
# eat your lunch and mess up your configuration.
#
#
# This program is free software: you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation, either version 2 of the License, or
# (at your option) any later version.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program.  If not, see <http://www.gnu.org/licenses/>.


import struct
import logging

from chirp import chirp_common, directory, bitwise, memmap, errors, util
from chirp.errors import InvalidValueError
from chirp.settings import RadioSetting, RadioSettingGroup, \
      RadioSettingValueBoolean, RadioSettingValueList, \
      RadioSettingValueInteger, RadioSettingValueString, \
      RadioSettings, RadioSettingValue

LOG = logging.getLogger(__name__)

# Show the obfuscated version of commands. Not needed normally, but
# might be useful for someone who is debugging a similar radio
DEBUG_SHOW_OBFUSCATED_COMMANDS = False

# Show the memory being written/received. Not needed normally, because
# this is the same information as in the packet hexdumps, but
# might be useful for someone debugging some obscure memory issue
DEBUG_SHOW_MEMORY_ACTIONS = False

MEM_FORMAT = """
#seekto 0x0000;
struct {
  ul32 freq;
  ul32 offset;
  u8 rxcode;
  u8 txcode;

  u8 unknown1:2,
  txcodeflag:2,
  unknown2:2,
  rxcodeflag:2;

  //u8 flags1;
  u8 flags1_unknown7:1,
  flags1_unknown6:1,
  flags1_unknown5:1,
  enable_am:1,
  flags1_unknown3:1,
  is_in_scanlist:1,
  shift:2;

  //u8 flags2;
  u8 flags2_unknown7:1,
  flags2_unknown6:1,
  flags2_unknown5:1,
  bclo:1,
  txpower:2,
  bandwidth:1,
  freq_reverse:1;

  //u8 dtmf_flags;
  u8 dtmf_flags_unknown7:1,
  dtmf_flags_unknown6:1,
  dtmf_flags_unknown5:1,
  dtmf_flags_unknown4:1,
  dtmf_flags_unknown3:1,
  dtmf_pttid:2,
  dtmf_decode:1;


  u8 step;
  u8 scrambler;
} channel[214];

#seekto 0xd60;
struct {
u8 is_scanlist1:1,
is_scanlist2:1,
unknown1:1,
unknown2:1,
is_free:1,
band:3;
} channel_attributes[200];

#seekto 0xe40;
ul16 fmfreq[20];

#seekto 0xe70;
u8 call_channel;
u8 squelch;
u8 max_talk_time;
u8 noaa_autoscan;
u8 key_lock;
u8 vox_switch;
u8 vox_level;
u8 mic_gain;
u8 unknown3;
u8 channel_display_mode;
u8 crossband;
u8 battery_save;
u8 dual_watch;
u8 backlight_auto_mode;
u8 tail_note_elimination;
u8 vfo_open;

#seekto 0xe90;
u8 beep_control;

#seekto 0xe95;
u8 scan_resume_mode;
u8 auto_keypad_lock;
u8 power_on_dispmode;
u8 password[4];

#seekto 0xea0;
u8 keypad_tone;
u8 language;

#seekto 0xea8;
u8 alarm_mode;
u8 reminding_of_end_talk;
u8 repeater_tail_elimination;

#seekto 0xeb0;
char logo_line1[16];
char logo_line2[16];

#seekto 0xed0;
struct {
u8 side_tone;
char separate_code;
char group_call_code;
u8 decode_response;
u8 auto_reset_time;
u8 preload_time;
u8 first_code_persist_time;
u8 hash_persist_time;
u8 code_persist_time;
u8 code_interval_time;
u8 permit_remote_kill;
} dtmf_settings;

#seekto 0xee0;
struct {
char dtmf_local_code[3];
char unused1[5];
char kill_code[5];
char unused2[3];
char revive_code[5];
char unused3[3];
char dtmf_up_code[16];
char dtmf_down_code[16];
} dtmf_settings_numbers;

#seekto 0xf18;
u8 scanlist_default;
u8 scanlist1_priority_scan;
u8 scanlist1_priority_ch1;
u8 scanlist1_priority_ch2;
u8 scanlist2_priority_scan;
u8 scanlist2_priority_ch1;
u8 scanlist2_priority_ch2;
u8 scanlist_unknown_0xff;


#seekto 0xf40;
u8 lock_flock;

#seekto 0xf42;
u8 lock_killed;

#seekto 0xf46;
u8 lock_enscramble;

#seekto 0xf50;
struct {
char name[16];
} channelname[200];

#seekto 0x1c00;
struct {
char name[8];
char number[3];
char unused_00[5];
} dtmfcontact[16];

#seekto 0x1d00;
struct {
    u8 id[2];
    char name[14];
} mdccontact1[16];

#seekto 0x1ed0;
struct {
struct {
    u8 start;
    u8 mid;
    u8 end;
} low;
struct {
    u8 start;
    u8 mid;
    u8 end;
} medium;
struct {
    u8 start;
    u8 mid;
    u8 end;
} high;
u8 unused_00[7];
} perbandpowersettings[7];

#seekto 0x1f40;
ul16 battery_level[6];

#seekto 0x1f90;
struct {
    u8 id[2];
    char name[14];
} mdccontact2[6];

#seekto 0x1ff8;
u8 mkey_longpress_action;
u8 key1_shortpress_action;
u8 key1_longpress_action;
u8 key2_shortpress_action;
u8 key2_longpress_action;

#seekto 0x1fff;
u8 mdc_num;
"""
# bits that we will save from the channel structure (mostly unknown)
SAVE_MASK_0A = 0b11001100
SAVE_MASK_0B = 0b11101100
SAVE_MASK_0C = 0b11100000
SAVE_MASK_0D = 0b11111000
SAVE_MASK_0E = 0b11110001
SAVE_MASK_0F = 0b11110000

# flags1
FLAGS1_OFFSET_NONE = 0b00
FLAGS1_OFFSET_MINUS = 0b10
FLAGS1_OFFSET_PLUS = 0b01

POWER_HIGH = 0b10
POWER_MEDIUM = 0b01
POWER_LOW = 0b00

# dtmf_flags
PTTID_LIST = ["不发送", "开始上线码", "结束下线码", "开始+结束"]

# power
UVK5_POWER_LEVELS = [chirp_common.PowerLevel("低",  watts=1.50),
                     chirp_common.PowerLevel("中",  watts=3.00),
                     chirp_common.PowerLevel("高", watts=5.00),
                     ]

# scrambler
SCRAMBLER_LIST = ["关闭", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"]

# channel display mode
CHANNELDISP_LIST = ["频率", "信道号", "名称", "名称+频率"]
# battery save
BATSAVE_LIST = ["关闭", "1:1", "1:2", "1:3", "1:4"]

# Backlight auto mode
BACKLIGHT_LIST = ["关闭", "5秒", "10秒", "20秒", "1分钟", "2分钟", "4分钟", "开启"]

# Crossband receiving/transmitting
CROSSBAND_LIST = ["关闭", "A段", "B段"]
DUALWATCH_LIST = CROSSBAND_LIST

# steps
STEPS = [2.5, 5.0, 6.25, 10.0, 12.5, 25.0, 8.33]

# ctcss/dcs codes
TMODES = ["", "Tone", "DTCS", "DTCS"]
TONE_NONE = 0
TONE_CTCSS = 1
TONE_DCS = 2
TONE_RDCS = 3


CTCSS_TONES = [
    67.0, 69.3, 71.9, 74.4, 77.0, 79.7, 82.5, 85.4,
    88.5, 91.5, 94.8, 97.4, 100.0, 103.5, 107.2, 110.9,
    114.8, 118.8, 123.0, 127.3, 131.8, 136.5, 141.3, 146.2,
    151.4, 156.7, 159.8, 162.2, 165.5, 167.9, 171.3, 173.8,
    177.3, 179.9, 183.5, 186.2, 189.9, 192.8, 196.6, 199.5,
    203.5, 206.5, 210.7, 218.1, 225.7, 229.1, 233.6, 241.8,
    250.3, 254.1
]

# lifted from ft4.py
DTCS_CODES = [
    23,  25,  26,  31,  32,  36,  43,  47,  51,  53,  54,
    65,  71,  72,  73,  74,  114, 115, 116, 122, 125, 131,
    132, 134, 143, 145, 152, 155, 156, 162, 165, 172, 174,
    205, 212, 223, 225, 226, 243, 244, 245, 246, 251, 252,
    255, 261, 263, 265, 266, 271, 274, 306, 311, 315, 325,
    331, 332, 343, 346, 351, 356, 364, 365, 371, 411, 412,
    413, 423, 431, 432, 445, 446, 452, 454, 455, 462, 464,
    465, 466, 503, 506, 516, 523, 526, 532, 546, 565, 606,
    612, 624, 627, 631, 632, 654, 662, 664, 703, 712, 723,
    731, 732, 734, 743, 754
]

FLOCK_LIST = ["默认+137-174 400-430", "FCC", "CE", "GB", "137-174 400-430", "137-174 400-438", "禁用全部", "解锁全部"]

SCANRESUME_LIST = ["TO: 收到信号5秒后恢复",
                   "CO: 信号消失后恢复",
                   "SE: 收到信号后停止扫描"]

WELCOME_LIST = ["关闭", "图片", "信息"]
KEYPADTONE_LIST = ["关闭", "中文", "English"]
LANGUAGE_LIST = ["中文", "English"]
ALARMMODE_LIST = ["本地", "本地+远端"]
REMENDOFTALK_LIST = ["关闭", "ROGER尾音", "MDC尾音", "MDC首音", "MDC首尾音", "MDC首音+ROGER"]
RTE_LIST = ["关闭", "100ms", "200ms", "300ms", "400ms",
            "500ms", "600ms", "700ms", "800ms", "900ms"]

MEM_SIZE = 0x2000  # size of all memory
PROG_SIZE = 0x1e00  # size of the memory that we will write
MEM_BLOCK = 0x80  # largest block of memory that we can reliably write

# fm radio supported frequencies
FMMIN = 64.0
FMMAX = 108.0

# bands supported by the UV-K5
BANDS = {
        0: [50.0, 76.0],
        1: [108.0, 135.9999],
        2: [136.0, 199.9990],
        3: [200.0, 299.9999],
        4: [350.0, 399.9999],
        5: [400.0, 469.9999],
        6: [470.0, 600.0]
        }

# for radios with modified firmware:
BANDS_NOLIMITS = {
        0: [18.0, 76.0],
        1: [108.0, 135.9999],
        2: [136.0, 199.9990],
        3: [200.0, 299.9999],
        4: [350.0, 399.9999],
        5: [400.0, 469.9999],
        6: [470.0, 1300.0]
        }

SPECIALS = {
        "F1(50M-76M)A": 200,
        "F1(50M-76M)B": 201,
        "F2(108M-136M)A": 202,
        "F2(108M-136M)B": 203,
        "F3(136M-174M)A": 204,
        "F3(136M-174M)B": 205,
        "F4(174M-350M)A": 206,
        "F4(174M-350M)B": 207,
        "F5(350M-400M)A": 208,
        "F5(350M-400M)B": 209,
        "F6(400M-470M)A": 210,
        "F6(400M-470M)B": 211,
        "F7(470M-600M)A": 212,
        "F7(470M-600M)B": 213
        }

VFO_CHANNEL_NAMES = ["F1(50M-76M)A", "F1(50M-76M)B",
                     "F2(108M-136M)A", "F2(108M-136M)B",
                     "F3(136M-174M)A", "F3(136M-174M)B",
                     "F4(174M-350M)A", "F4(174M-350M)B",
                     "F5(350M-400M)A", "F5(350M-400M)B",
                     "F6(400M-470M)A", "F6(400M-470M)B",
                     "F7(470M-600M)A", "F7(470M-600M)B"]

SCANLIST_LIST = ["无", "1", "2", "1+2"]

DTMF_CHARS = "0123456789ABCD*# "
DTMF_CHARS_ID = "0123456789ABCDabcd"
DTMF_CHARS_KILL = "0123456789ABCDabcd"
DTMF_CHARS_UPDOWN = "0123456789ABCDabcd#* "
DTMF_CODE_CHARS = "ABCD*# "
DTMF_DECODE_RESPONSE_LIST = ["关闭", "本地响铃", "回复响应", "响铃+回复"]

KEYACTIONS_LONG_LIST = ["无", "手电筒", "切换发射功率", "监听", "扫描", "声控发射", "FM收音机", "锁定按键", "切换AB信道",
                        "切换信道模式", "切换调制模式", "DTMF解码", "切换宽窄带", "A信道发射", "B信道发射"]

KEYACTIONS_SHORT_LIST = ["无", "手电筒", "切换发射功率", "监听", "扫描", "声控发射", "FM收音机", "锁定按键", "切换AB信道",
                         "切换信道模式", "切换调制模式", "DTMF解码", "切换宽窄带"]

MIC_GAIN_LIST = ["+1.1dB", "+4.0dB", "+8.0dB", "+12.0dB", "+15.1dB"]

FONT_MAPPING = ['啊', '阿', '埃', '挨', '哎', '唉', '哀', '皑', '癌', '蔼', '矮', '艾', '碍', '爱', '隘', '鞍', '氨', '安', '俺', '按', '暗', '岸', '胺', '案', '肮', '昂', '盎', '凹', '敖', '熬', '翱', '袄', '傲', '奥', '懊', '澳', '芭', '捌', '扒', '叭', '吧', '笆', '八', '疤', '巴', '拔', '跋', '靶', '把', '耙', '坝', '霸', '罢', '爸', '白', '柏', '百', '摆', '佰', '败', '拜', '稗', '斑', '班', '搬', '扳', '般', '颁', '板', '版', '扮', '拌', '伴', '瓣', '半', '办', '绊', '邦', '帮', '梆', '榜', '膀', '绑', '棒', '磅', '蚌', '镑', '傍', '谤', '苞', '胞', '包', '褒', '剥', '薄', '雹', '保', '堡', '饱', '宝', '抱', '报', '暴', '豹', '鲍', '爆', '杯', '碑', '悲', '卑', '北', '辈', '背', '贝', '钡', '倍', '狈', '备', '惫', '焙', '被', '奔', '苯', '本', '笨', '崩', '绷', '甭', '泵', '蹦', '迸', '逼', '鼻', '比', '鄙', '笔', '彼', '碧', '蓖', '蔽', '毕', '毙', '毖', '币', '庇', '痹', '闭', '敝', '弊', '必', '辟', '壁', '臂', '避', '陛', '鞭', '边', '编', '贬', '扁', '便', '变', '卞', '辨', '辩', '辫', '遍', '标', '彪', '膘', '表', '鳖', '憋', '别', '瘪', '彬', '斌', '濒', '滨', '宾', '摈', '兵', '冰', '柄', '丙', '秉', '饼', '炳', '病', '并', '玻', '菠', '播', '拨', '钵', '波', '博', '勃', '搏', '铂', '箔', '伯', '帛', '舶', '脖', '膊', '渤', '泊', '驳', '捕', '卜', '哺', '补', '埠', '不', '布', '步', '簿', '部', '怖', '擦', '猜', '裁', '材', '才', '财', '睬', '踩', '采', '彩', '菜', '蔡', '餐', '参', '蚕', '残', '惭', '惨', '灿', '苍', '舱', '仓', '沧', '藏', '操', '糙', '槽', '曹', '草', '厕', '策', '侧', '册', '测', '层', '蹭', '插', '叉', '茬', '茶', '查', '碴', '搽', '察', '岔', '差', '诧', '拆', '柴', '豺', '搀', '掺', '蝉', '馋', '谗', '缠', '铲', '产', '阐', '颤', '昌', '猖', '场', '尝', '常', '长', '偿', '肠', '厂', '敞', '畅', '唱', '倡', '超', '抄', '钞', '朝', '嘲', '潮', '巢', '吵', '炒', '车', '扯', '撤', '掣', '彻', '澈', '郴', '臣', '辰', '尘', '晨', '忱', '沉', '陈', '趁', '衬', '撑', '称', '城', '橙', '成', '呈', '乘', '程', '惩', '澄', '诚', '承', '逞', '骋', '秤', '吃', '痴', '持', '匙', '池', '迟', '弛', '驰', '耻', '齿', '侈', '尺', '赤', '翅', '斥', '炽', '充', '冲', '虫', '崇', '宠', '抽', '酬', '畴', '踌', '稠', '愁', '筹', '仇', '绸', '瞅', '丑', '臭', '初', '出', '橱', '厨', '躇', '锄', '雏', '滁', '除', '楚', '础', '储', '矗', '搐', '触', '处', '揣', '川', '穿', '椽', '传', '船', '喘', '串', '疮', '窗', '幢', '床', '闯', '创', '吹', '炊', '捶', '锤', '垂', '春', '椿', '醇', '唇', '淳', '纯', '蠢', '戳', '绰', '疵', '茨', '磁', '雌', '辞', '慈', '瓷', '词', '此', '刺', '赐', '次', '聪', '葱', '囱', '匆', '从', '丛', '凑', '粗', '醋', '簇', '促', '蹿', '篡', '窜', '摧', '崔', '催', '脆', '瘁', '粹', '淬', '翠', '村', '存', '寸', '磋', '撮', '搓', '措', '挫', '错', '搭', '达', '答', '瘩', '打', '大', '呆', '歹', '傣', '戴', '带', '殆', '代', '贷', '袋', '待', '逮', '怠', '耽', '担', '丹', '单', '郸', '掸', '胆', '旦', '氮', '但', '惮', '淡', '诞', '弹', '蛋', '当', '挡', '党', '荡', '档', '刀', '捣', '蹈', '倒', '岛', '祷', '导', '到', '稻', '悼', '道', '盗', '德', '得', '的', '蹬', '灯', '登', '等', '瞪', '凳', '邓', '堤', '低', '滴', '迪', '敌', '笛', '狄', '涤', '翟', '嫡', '抵', '底', '地', '蒂', '第', '帝', '弟', '递', '缔', '颠', '掂', '滇', '碘', '点', '典', '靛', '垫', '电', '佃', '甸', '店', '惦', '奠', '淀', '殿', '碉', '叼', '雕', '凋', '刁', '掉', '吊', '钓', '调', '跌', '爹', '碟', '蝶', '迭', '谍', '叠', '丁', '盯', '叮', '钉', '顶', '鼎', '锭', '定', '订', '丢', '东', '冬', '董', '懂', '动', '栋', '侗', '恫', '冻', '洞', '兜', '抖', '斗', '陡', '豆', '逗', '痘', '都', '督', '毒', '犊', '独', '读', '堵', '睹', '赌', '杜', '镀', '肚', '度', '渡', '妒', '端', '短', '锻', '段', '断', '缎', '堆', '兑', '队', '对', '墩', '吨', '蹲', '敦', '顿', '囤', '钝', '盾', '遁', '掇', '哆', '多', '夺', '垛', '躲', '朵', '跺', '舵', '剁', '惰', '堕', '蛾', '峨', '鹅', '俄', '额', '讹', '娥', '恶', '厄', '扼', '遏', '鄂', '饿', '恩', '而', '儿', '耳', '尔', '饵', '洱', '二', '贰', '发', '罚', '筏', '伐', '乏', '阀', '法', '珐', '藩', '帆', '番', '翻', '樊', '矾', '钒', '繁', '凡', '烦', '反', '返', '范', '贩', '犯', '饭', '泛', '坊', '芳', '方', '肪', '房', '防', '妨', '仿', '访', '纺', '放', '菲', '非', '啡', '飞', '肥', '匪', '诽', '吠', '肺', '废', '沸', '费', '芬', '酚', '吩', '氛', '分', '纷', '坟', '焚', '汾', '粉', '奋', '份', '忿', '愤', '粪', '丰', '封', '枫', '蜂', '峰', '锋', '风', '疯', '烽', '逢', '冯', '缝', '讽', '奉', '凤', '佛', '否', '夫', '敷', '肤', '孵', '扶', '拂', '辐', '幅', '氟', '符', '伏', '俘', '服', '浮', '涪', '福', '袱', '弗', '甫', '抚', '辅', '俯', '釜', '斧', '脯', '腑', '府', '腐', '赴', '副', '覆', '赋', '复', '傅', '付', '阜', '父', '腹', '负', '富', '讣', '附', '妇', '缚', '咐', '噶', '嘎', '该', '改', '概', '钙', '盖', '溉', '干', '甘', '杆', '柑', '竿', '肝', '赶', '感', '秆', '敢', '赣', '冈', '刚', '钢', '缸', '肛', '纲', '岗', '港', '杠', '篙', '皋', '高', '膏', '羔', '糕', '搞', '镐', '稿', '告', '哥', '歌', '搁', '戈', '鸽', '胳', '疙', '割', '革', '葛', '格', '蛤', '阁', '隔', '铬', '个', '各', '给', '根', '跟', '耕', '更', '庚', '羹', '埂', '耿', '梗', '工', '攻', '功', '恭', '龚', '供', '躬', '公', '宫', '弓', '巩', '汞', '拱', '贡', '共', '钩', '勾', '沟', '苟', '狗', '垢', '构', '购', '够', '辜', '菇', '咕', '箍', '估', '沽', '孤', '姑', '鼓', '古', '蛊', '骨', '谷', '股', '故', '顾', '固', '雇', '刮', '瓜', '剐', '寡', '挂', '褂', '乖', '拐', '怪', '棺', '关', '官', '冠', '观', '管', '馆', '罐', '惯', '灌', '贯', '光', '广', '逛', '瑰', '规', '圭', '硅', '归', '龟', '闺', '轨', '鬼', '诡', '癸', '桂', '柜', '跪', '贵', '刽', '辊', '滚', '棍', '锅', '郭', '国', '果', '裹', '过', '哈', '骸', '孩', '海', '氦', '亥', '害', '骇', '酣', '憨', '邯', '韩', '含', '涵', '寒', '函', '喊', '罕', '翰', '撼', '捍', '旱', '憾', '悍', '焊', '汗', '汉', '夯', '杭', '航', '壕', '嚎', '豪', '毫', '郝', '好', '耗', '号', '浩', '呵', '喝', '荷', '菏', '核', '禾', '和', '何', '合', '盒', '貉', '阂', '河', '涸', '赫', '褐', '鹤', '贺', '嘿', '黑', '痕', '很', '狠', '恨', '哼', '亨', '横', '衡', '恒', '轰', '哄', '烘', '虹', '鸿', '洪', '宏', '弘', '红', '喉', '侯', '猴', '吼', '厚', '候', '后', '呼', '乎', '忽', '瑚', '壶', '葫', '胡', '蝴', '狐', '糊', '湖', '弧', '虎', '唬', '护', '互', '沪', '户', '花', '哗', '华', '猾', '滑', '画', '划', '化', '话', '槐', '徊', '怀', '淮', '坏', '欢', '环', '桓', '还', '缓', '换', '患', '唤', '痪', '豢', '焕', '涣', '宦', '幻', '荒', '慌', '黄', '磺', '蝗', '簧', '皇', '凰', '惶', '煌', '晃', '幌', '恍', '谎', '灰', '挥', '辉', '徽', '恢', '蛔', '回', '毁', '悔', '慧', '卉', '惠', '晦', '贿', '秽', '会', '烩', '汇', '讳', '诲', '绘', '荤', '昏', '婚', '魂', '浑', '混', '豁', '活', '伙', '火', '获', '或', '惑', '霍', '货', '祸', '击', '圾', '基', '机', '畸', '稽', '积', '箕', '肌', '饥', '迹', '激', '讥', '鸡', '姬', '绩', '缉', '吉', '极', '棘', '辑', '籍', '集', '及', '急', '疾', '汲', '即', '嫉', '级', '挤', '几', '脊', '己', '蓟', '技', '冀', '季', '伎', '祭', '剂', '悸', '济', '寄', '寂', '计', '记', '既', '忌', '际', '妓', '继', '纪', '嘉', '枷', '夹', '佳', '家', '加', '荚', '颊', '贾', '甲', '钾', '假', '稼', '价', '架', '驾', '嫁', '歼', '监', '坚', '尖', '笺', '间', '煎', '兼', '肩', '艰', '奸', '缄', '茧', '检', '柬', '碱', '硷', '拣', '捡', '简', '俭', '剪', '减', '荐', '槛', '鉴', '践', '贱', '见', '键', '箭', '件', '健', '舰', '剑', '饯', '渐', '溅', '涧', '建', '僵', '姜', '将', '浆', '江', '疆', '蒋', '桨', '奖', '讲', '匠', '酱', '降', '蕉', '椒', '礁', '焦', '胶', '交', '郊', '浇', '骄', '娇', '嚼', '搅', '铰', '矫', '侥', '脚', '狡', '角', '饺', '缴', '绞', '剿', '教', '酵', '轿', '较', '叫', '窖', '揭', '接', '皆', '秸', '街', '阶', '截', '劫', '节', '桔', '杰', '捷', '睫', '竭', '洁', '结', '解', '姐', '戒', '藉', '芥', '界', '借', '介', '疥', '诫', '届', '巾', '筋', '斤', '金', '今', '津', '襟', '紧', '锦', '仅', '谨', '进', '靳', '晋', '禁', '近', '烬', '浸', '尽', '劲', '荆', '兢', '茎', '睛', '晶', '鲸', '京', '惊', '精', '粳', '经', '井', '警', '景', '颈', '静', '境', '敬', '镜', '径', '痉', '靖', '竟', '竞', '净', '炯', '窘', '揪', '究', '纠', '玖', '韭', '久', '灸', '九', '酒', '厩', '救', '旧', '臼', '舅', '咎', '就', '疚', '鞠', '拘', '狙', '疽', '居', '驹', '菊', '局', '咀', '矩', '举', '沮', '聚', '拒', '据', '巨', '具', '距', '踞', '锯', '俱', '句', '惧', '炬', '剧', '捐', '鹃', '娟', '倦', '眷', '卷', '绢', '撅', '攫', '抉', '掘', '倔', '爵', '觉', '决', '诀', '绝', '均', '菌', '钧', '军', '君', '峻', '俊', '竣', '浚', '郡', '骏', '喀', '咖', '卡', '咯', '开', '揩', '楷', '凯', '慨', '刊', '堪', '勘', '坎', '砍', '看', '康', '慷', '糠', '扛', '抗', '亢', '炕', '考', '拷', '烤', '靠', '坷', '苛', '柯', '棵', '磕', '颗', '科', '壳', '咳', '可', '渴', '克', '刻', '客', '课', '肯', '啃', '垦', '恳', '坑', '吭', '空', '恐', '孔', '控', '抠', '口', '扣', '寇', '枯', '哭', '窟', '苦', '酷', '库', '裤', '夸', '垮', '挎', '跨', '胯', '块', '筷', '侩', '快', '宽', '款', '匡', '筐', '狂', '框', '矿', '眶', '旷', '况', '亏', '盔', '岿', '窥', '葵', '奎', '魁', '傀', '馈', '愧', '溃', '坤', '昆', '捆', '困', '括', '扩', '廓', '阔', '垃', '拉', '喇', '蜡', '腊', '辣', '啦', '莱', '来', '赖', '蓝', '婪', '栏', '拦', '篮', '阑', '兰', '澜', '谰', '揽', '览', '懒', '缆', '烂', '滥', '琅', '榔', '狼', '廊', '郎', '朗', '浪', '捞', '劳', '牢', '老', '佬', '姥', '酪', '烙', '涝', '勒', '乐', '雷', '镭', '蕾', '磊', '累', '儡', '垒', '擂', '肋', '类', '泪', '棱', '楞', '冷', '厘', '梨', '犁', '黎', '篱', '狸', '离', '漓', '理', '李', '里', '鲤', '礼', '莉', '荔', '吏', '栗', '丽', '厉', '励', '砾', '历', '利', '傈', '例', '俐', '痢', '立', '粒', '沥', '隶', '力', '璃', '哩', '俩', '联', '莲', '连', '镰', '廉', '怜', '涟', '帘', '敛', '脸', '链', '恋', '炼', '练', '粮', '凉', '梁', '粱', '良', '两', '辆', '量', '晾', '亮', '谅', '撩', '聊', '僚', '疗', '燎', '寥', '辽', '潦', '了', '撂', '镣', '廖', '料', '列', '裂', '烈', '劣', '猎', '琳', '林', '磷', '霖', '临', '邻', '鳞', '淋', '凛', '赁', '吝', '拎', '玲', '菱', '零', '龄', '铃', '伶', '羚', '凌', '灵', '陵', '岭', '领', '另', '令', '溜', '琉', '榴', '硫', '馏', '留', '刘', '瘤', '流', '柳', '六', '龙', '聋', '咙', '笼', '窿', '隆', '垄', '拢', '陇', '楼', '娄', '搂', '篓', '漏', '陋', '芦', '卢', '颅', '庐', '炉', '掳', '卤', '虏', '鲁', '麓', '碌', '露', '路', '赂', '鹿', '潞', '禄', '录', '陆', '戮', '驴', '吕', '铝', '侣', '旅', '履', '屡', '缕', '虑', '氯', '律', '率', '滤', '绿', '峦', '挛', '孪', '滦', '卵', '乱', '掠', '略', '抡', '轮', '伦', '仑', '沦', '纶', '论', '萝', '螺', '罗', '逻', '锣', '箩', '骡', '裸', '落', '洛', '骆', '络', '妈', '麻', '玛', '码', '蚂', '马', '骂', '嘛', '吗', '埋', '买', '麦', '卖', '迈', '脉', '瞒', '馒', '蛮', '满', '蔓', '曼', '慢', '漫', '谩', '芒', '茫', '盲', '氓', '忙', '莽', '猫', '茅', '锚', '毛', '矛', '铆', '卯', '茂', '冒', '帽', '貌', '贸', '么', '玫', '枚', '梅', '酶', '霉', '煤', '没', '眉', '媒', '镁', '每', '美', '昧', '寐', '妹', '媚', '门', '闷', '们', '萌', '蒙', '檬', '盟', '锰', '猛', '梦', '孟', '眯', '醚', '靡', '糜', '迷', '谜', '弥', '米', '秘', '觅', '泌', '蜜', '密', '幂', '棉', '眠', '绵', '冕', '免', '勉', '娩', '缅', '面', '苗', '描', '瞄', '藐', '秒', '渺', '庙', '妙', '蔑', '灭', '民', '抿', '皿', '敏', '悯', '闽', '明', '螟', '鸣', '铭', '名', '命', '谬', '摸', '摹', '蘑', '模', '膜', '磨', '摩', '魔', '抹', '末', '莫', '墨', '默', '沫', '漠', '寞', '陌', '谋', '牟', '某', '拇', '牡', '亩', '姆', '母', '墓', '暮', '幕', '募', '慕', '木', '目', '睦', '牧', '穆', '拿', '哪', '呐', '钠', '那', '娜', '纳', '氖', '乃', '奶', '耐', '奈', '南', '男', '难', '囊', '挠', '脑', '恼', '闹', '淖', '呢', '馁', '内', '嫩', '能', '妮', '霓', '倪', '泥', '尼', '拟', '你', '匿', '腻', '逆', '溺', '蔫', '拈', '年', '碾', '撵', '捻', '念', '娘', '酿', '鸟', '尿', '捏', '聂', '孽', '啮', '镊', '镍', '涅', '您', '柠', '狞', '凝', '宁', '拧', '泞', '牛', '扭', '钮', '纽', '脓', '浓', '农', '弄', '奴', '努', '怒', '女', '暖', '虐', '疟', '挪', '懦', '糯', '诺', '哦', '欧', '鸥', '殴', '藕', '呕', '偶', '沤', '啪', '趴', '爬', '帕', '怕', '琶', '拍', '排', '牌', '徘', '湃', '派', '攀', '潘', '盘', '磐', '盼', '畔', '判', '叛', '乓', '庞', '旁', '耪', '胖', '抛', '咆', '刨', '炮', '袍', '跑', '泡', '呸', '胚', '培', '裴', '赔', '陪', '配', '佩', '沛', '喷', '盆', '砰', '抨', '烹', '澎', '彭', '蓬', '棚', '硼', '篷', '膨', '朋', '鹏', '捧', '碰', '坯', '砒', '霹', '批', '披', '劈', '琵', '毗', '啤', '脾', '疲', '皮', '匹', '痞', '僻', '屁', '譬', '篇', '偏', '片', '骗', '飘', '漂', '瓢', '票', '撇', '瞥', '拼', '频', '贫', '品', '聘', '乒', '坪', '苹', '萍', '平', '凭', '瓶', '评', '屏', '坡', '泼', '颇', '婆', '破', '魄', '迫', '粕', '剖', '扑', '铺', '仆', '莆', '葡', '菩', '蒲', '埔', '朴', '圃', '普', '浦', '谱', '曝', '瀑', '期', '欺', '栖', '戚', '妻', '七', '凄', '漆', '柒', '沏', '其', '棋', '奇', '歧', '畦', '崎', '脐', '齐', '旗', '祈', '祁', '骑', '起', '岂', '乞', '企', '启', '契', '砌', '器', '气', '迄', '弃', '汽', '泣', '讫', '掐', '恰', '洽', '牵', '扦', '钎', '铅', '千', '迁', '签', '仟', '谦', '乾', '黔', '钱', '钳', '前', '潜', '遣', '浅', '谴', '堑', '嵌', '欠', '歉', '枪', '呛', '腔', '羌', '墙', '蔷', '强', '抢', '橇', '锹', '敲', '悄', '桥', '瞧', '乔', '侨', '巧', '鞘', '撬', '翘', '峭', '俏', '窍', '切', '茄', '且', '怯', '窃', '钦', '侵', '亲', '秦', '琴', '勤', '芹', '擒', '禽', '寝', '沁', '青', '轻', '氢', '倾', '卿', '清', '擎', '晴', '氰', '情', '顷', '请', '庆', '琼', '穷', '秋', '丘', '邱', '球', '求', '囚', '酋', '泅', '趋', '区', '蛆', '曲', '躯', '屈', '驱', '渠', '取', '娶', '龋', '趣', '去', '圈', '颧', '权', '醛', '泉', '全', '痊', '拳', '犬', '券', '劝', '缺', '炔', '瘸', '却', '鹊', '榷', '确', '雀', '裙', '群', '然', '燃', '冉', '染', '瓤', '壤', '攘', '嚷', '让', '饶', '扰', '绕', '惹', '热', '壬', '仁', '人', '忍', '韧', '任', '认', '刃', '妊', '纫', '扔', '仍', '日', '戎', '茸', '蓉', '荣', '融', '熔', '溶', '容', '绒', '冗', '揉', '柔', '肉', '茹', '蠕', '儒', '孺', '如', '辱', '乳', '汝', '入', '褥', '软', '阮', '蕊', '瑞', '锐', '闰', '润', '若', '弱', '撒', '洒', '萨', '腮', '鳃', '塞', '赛', '三', '叁', '伞', '散', '桑', '嗓', '丧', '搔', '骚', '扫', '嫂', '瑟', '色', '涩', '森', '僧', '莎', '砂', '杀', '刹', '沙', '纱', '傻', '啥', '煞', '筛', '晒', '珊', '苫', '杉', '山', '删', '煽', '衫', '闪', '陕', '擅', '赡', '膳', '善', '汕', '扇', '缮', '墒', '伤', '商', '赏', '晌', '上', '尚', '裳', '梢', '捎', '稍', '烧', '芍', '勺', '韶', '少', '哨', '邵', '绍', '奢', '赊', '蛇', '舌', '舍', '赦', '摄', '射', '慑', '涉', '社', '设', '砷', '申', '呻', '伸', '身', '深', '娠', '绅', '神', '沈', '审', '婶', '甚', '肾', '慎', '渗', '声', '生', '甥', '牲', '升', '绳', '省', '盛', '剩', '胜', '圣', '师', '失', '狮', '施', '湿', '诗', '尸', '虱', '十', '石', '拾', '时', '什', '食', '蚀', '实', '识', '史', '矢', '使', '屎', '驶', '始', '式', '示', '士', '世', '柿', '事', '拭', '誓', '逝', '势', '是', '嗜', '噬', '适', '仕', '侍', '释', '饰', '氏', '市', '恃', '室', '视', '试', '收', '手', '首', '守', '寿', '授', '售', '受', '瘦', '兽', '蔬', '枢', '梳', '殊', '抒', '输', '叔', '舒', '淑', '疏', '书', '赎', '孰', '熟', '薯', '暑', '曙', '署', '蜀', '黍', '鼠', '属', '术', '述', '树', '束', '戍', '竖', '墅', '庶', '数', '漱', '恕', '刷', '耍', '摔', '衰', '甩', '帅', '栓', '拴', '霜', '双', '爽', '谁', '水', '睡', '税', '吮', '瞬', '顺', '舜', '说', '硕', '朔', '烁', '斯', '撕', '嘶', '思', '私', '司', '丝', '死', '肆', '寺', '嗣', '四', '伺', '似', '饲', '巳', '松', '耸', '怂', '颂', '送', '宋', '讼', '诵', '搜', '艘', '擞', '嗽', '苏', '酥', '俗', '素', '速', '粟', '僳', '塑', '溯', '宿', '诉', '肃', '酸', '蒜', '算', '虽', '隋', '随', '绥', '髓', '碎', '岁', '穗', '遂', '隧', '祟', '孙', '损', '笋', '蓑', '梭', '唆', '缩', '琐', '索', '锁', '所', '塌', '他', '它', '她', '塔', '獭', '挞', '蹋', '踏', '胎', '苔', '抬', '台', '泰', '酞', '太', '态', '汰', '坍', '摊', '贪', '瘫', '滩', '坛', '檀', '痰', '潭', '谭', '谈', '坦', '毯', '袒', '碳', '探', '叹', '炭', '汤', '塘', '搪', '堂', '棠', '膛', '唐', '糖', '倘', '躺', '淌', '趟', '烫', '掏', '涛', '滔', '绦', '萄', '桃', '逃', '淘', '陶', '讨', '套', '特', '藤', '腾', '疼', '誊', '梯', '剔', '踢', '锑', '提', '题', '蹄', '啼', '体', '替', '嚏', '惕', '涕', '剃', '屉', '天', '添', '填', '田', '甜', '恬', '舔', '腆', '挑', '条', '迢', '眺', '跳', '贴', '铁', '帖', '厅', '听', '烃', '汀', '廷', '停', '亭', '庭', '挺', '艇', '通', '桐', '酮', '瞳', '同', '铜', '彤', '童', '桶', '捅', '筒', '统', '痛', '偷', '投', '头', '透', '凸', '秃', '突', '图', '徒', '途', '涂', '屠', '土', '吐', '兔', '湍', '团', '推', '颓', '腿', '蜕', '褪', '退', '吞', '屯', '臀', '拖', '托', '脱', '鸵', '陀', '驮', '驼', '椭', '妥', '拓', '唾', '挖', '哇', '蛙', '洼', '娃', '瓦', '袜', '歪', '外', '豌', '弯', '湾', '玩', '顽', '丸', '烷', '完', '碗', '挽', '晚', '皖', '惋', '宛', '婉', '万', '腕', '汪', '王', '亡', '枉', '网', '往', '旺', '望', '忘', '妄', '威', '巍', '微', '危', '韦', '违', '桅', '围', '唯', '惟', '为', '潍', '维', '苇', '萎', '委', '伟', '伪', '尾', '纬', '未', '蔚', '味', '畏', '胃', '喂', '魏', '位', '渭', '谓', '尉', '慰', '卫', '瘟', '温', '蚊', '文', '闻', '纹', '吻', '稳', '紊', '问', '嗡', '翁', '瓮', '挝', '蜗', '涡', '窝', '我', '斡', '卧', '握', '沃', '巫', '呜', '钨', '乌', '污', '诬', '屋', '无', '芜', '梧', '吾', '吴', '毋', '武', '五', '捂', '午', '舞', '伍', '侮', '坞', '戊', '雾', '晤', '物', '勿', '务', '悟', '误', '昔', '熙', '析', '西', '硒', '矽', '晰', '嘻', '吸', '锡', '牺', '稀', '息', '希', '悉', '膝', '夕', '惜', '熄', '烯', '溪', '汐', '犀', '檄', '袭', '席', '习', '媳', '喜', '铣', '洗', '系', '隙', '戏', '细', '瞎', '虾', '匣', '霞', '辖', '暇', '峡', '侠', '狭', '下', '厦', '夏', '吓', '掀', '锨', '先', '仙', '鲜', '纤', '咸', '贤', '衔', '舷', '闲', '涎', '弦', '嫌', '显', '险', '现', '献', '县', '腺', '馅', '羡', '宪', '陷', '限', '线', '相', '厢', '镶', '香', '箱', '襄', '湘', '乡', '翔', '祥', '详', '想', '响', '享', '项', '巷', '橡', '像', '向', '象', '萧', '硝', '霄', '削', '哮', '嚣', '销', '消', '宵', '淆', '晓', '小', '孝', '校', '肖', '啸', '笑', '效', '楔', '些', '歇', '蝎', '鞋', '协', '挟', '携', '邪', '斜', '胁', '谐', '写', '械', '卸', '蟹', '懈', '泄', '泻', '谢', '屑', '薪', '芯', '锌', '欣', '辛', '新', '忻', '心', '信', '衅', '星', '腥', '猩', '惺', '兴', '刑', '型', '形', '邢', '行', '醒', '幸', '杏', '性', '姓', '兄', '凶', '胸', '匈', '汹', '雄', '熊', '休', '修', '羞', '朽', '嗅', '锈', '秀', '袖', '绣', '墟', '戌', '需', '虚', '嘘', '须', '徐', '许', '蓄', '酗', '叙', '旭', '序', '畜', '恤', '絮', '婿', '绪', '续', '轩', '喧', '宣', '悬', '旋', '玄', '选', '癣', '眩', '绚', '靴', '薛', '学', '穴', '雪', '血', '勋', '熏', '循', '旬', '询', '寻', '驯', '巡', '殉', '汛', '训', '讯', '逊', '迅', '压', '押', '鸦', '鸭', '呀', '丫', '芽', '牙', '蚜', '崖', '衙', '涯', '雅', '哑', '亚', '讶', '焉', '咽', '阉', '烟', '淹', '盐', '严', '研', '蜒', '岩', '延', '言', '颜', '阎', '炎', '沿', '奄', '掩', '眼', '衍', '演', '艳', '堰', '燕', '厌', '砚', '雁', '唁', '彦', '焰', '宴', '谚', '验', '殃', '央', '鸯', '秧', '杨', '扬', '佯', '疡', '羊', '洋', '阳', '氧', '仰', '痒', '养', '样', '漾', '邀', '腰', '妖', '瑶', '摇', '尧', '遥', '窑', '谣', '姚', '咬', '舀', '药', '要', '耀', '椰', '噎', '耶', '爷', '野', '冶', '也', '页', '掖', '业', '叶', '曳', '腋', '夜', '液', '一', '壹', '医', '揖', '铱', '依', '伊', '衣', '颐', '夷', '遗', '移', '仪', '胰', '疑', '沂', '宜', '姨', '彝', '椅', '蚁', '倚', '已', '乙', '矣', '以', '艺', '抑', '易', '邑', '屹', '亿', '役', '臆', '逸', '肄', '疫', '亦', '裔', '意', '毅', '忆', '义', '益', '溢', '诣', '议', '谊', '译', '异', '翼', '翌', '绎', '茵', '荫', '因', '殷', '音', '阴', '姻', '吟', '银', '淫', '寅', '饮', '尹', '引', '隐', '印', '英', '樱', '婴', '鹰', '应', '缨', '莹', '萤', '营', '荧', '蝇', '迎', '赢', '盈', '影', '颖', '硬', '映', '哟', '拥', '佣', '臃', '痈', '庸', '雍', '踊', '蛹', '咏', '泳', '涌', '永', '恿', '勇', '用', '幽', '优', '悠', '忧', '尤', '由', '邮', '铀', '犹', '油', '游', '酉', '有', '友', '右', '佑', '釉', '诱', '又', '幼', '迂', '淤', '于', '盂', '榆', '虞', '愚', '舆', '余', '俞', '逾', '鱼', '愉', '渝', '渔', '隅', '予', '娱', '雨', '与', '屿', '禹', '宇', '语', '羽', '玉', '域', '芋', '郁', '吁', '遇', '喻', '峪', '御', '愈', '欲', '狱', '育', '誉', '浴', '寓', '裕', '预', '豫', '驭', '鸳', '渊', '冤', '元', '垣', '袁', '原', '援', '辕', '园', '员', '圆', '猿', '源', '缘', '远', '苑', '愿', '怨', '院', '曰', '约', '越', '跃', '钥', '岳', '粤', '月', '悦', '阅', '耘', '云', '郧', '匀', '陨', '允', '运', '蕴', '酝', '晕', '韵', '孕', '匝', '砸', '杂', '栽', '哉', '灾', '宰', '载', '再', '在', '咱', '攒', '暂', '赞', '赃', '脏', '葬', '遭', '糟', '凿', '藻', '枣', '早', '澡', '蚤', '躁', '噪', '造', '皂', '灶', '燥', '责', '择', '则', '泽', '贼', '怎', '增', '憎', '曾', '赠', '扎', '喳', '渣', '札', '轧', '铡', '闸', '眨', '栅', '榨', '咋', '乍', '炸', '诈', '摘', '斋', '宅', '窄', '债', '寨', '瞻', '毡', '詹', '粘', '沾', '盏', '斩', '辗', '崭', '展', '蘸', '栈', '占', '战', '站', '湛', '绽', '樟', '章', '彰', '漳', '张', '掌', '涨', '杖', '丈', '帐', '账', '仗', '胀', '瘴', '障', '招', '昭', '找', '沼', '赵', '照', '罩', '兆', '肇', '召', '遮', '折', '哲', '蛰', '辙', '者', '锗', '蔗', '这', '浙', '珍', '斟', '真', '甄', '砧', '臻', '贞', '针', '侦', '枕', '疹', '诊', '震', '振', '镇', '阵', '蒸', '挣', '睁', '征', '狰', '争', '怔', '整', '拯', '正', '政', '帧', '症', '郑', '证', '芝', '枝', '支', '吱', '蜘', '知', '肢', '脂', '汁', '之', '织', '职', '直', '植', '殖', '执', '值', '侄', '址', '指', '止', '趾', '只', '旨', '纸', '志', '挚', '掷', '至', '致', '置', '帜', '峙', '制', '智', '秩', '稚', '质', '炙', '痔', '滞', '治', '窒', '中', '盅', '忠', '钟', '衷', '终', '种', '肿', '重', '仲', '众', '舟', '周', '州', '洲', '诌', '粥', '轴', '肘', '帚', '咒', '皱', '宙', '昼', '骤', '珠', '株', '蛛', '朱', '猪', '诸', '诛', '逐', '竹', '烛', '煮', '拄', '瞩', '嘱', '主', '著', '柱', '助', '蛀', '贮', '铸', '筑', '住', '注', '祝', '驻', '抓', '爪', '拽', '专', '砖', '转', '撰', '赚', '篆', '桩', '庄', '装', '妆', '撞', '壮', '状', '椎', '锥', '追', '赘', '坠', '缀', '谆', '准', '捉', '拙', '卓', '桌', '琢', '茁', '酌', '啄', '着', '灼', '浊', '兹', '咨', '资', '姿', '滋', '淄', '孜', '紫', '仔', '籽', '滓', '子', '自', '渍', '字', '鬃', '棕', '踪', '宗', '综', '总', '纵', '邹', '走', '奏', '揍', '租', '足', '卒', '族', '祖', '诅', '阻', '组', '钻', '纂', '嘴', '醉', '最', '罪', '尊', '遵', '昨', '左', '佐', '柞', '做', '作', '坐', '座', '亍', '丌', '兀', '丐', '廿', '卅', '丕', '亘', '丞', '鬲', '孬', '噩', '丨', '禺', '丿', '匕', '乇', '夭', '爻', '卮', '氐', '囟', '胤', '馗', '毓', '睾', '鼗', '丶', '亟', '鼐', '乜', '乩', '亓', '芈', '孛', '啬', '嘏', '仄', '厍', '厝', '厣', '厥', '厮', '靥', '赝', '匚', '叵', '匦', '匮', '匾', '赜', '卦', '卣', '刂', '刈', '刎', '刭', '刳', '刿', '剀', '剌', '剞', '剡', '剜', '蒯', '剽', '劂', '劁', '劐', '劓', '冂', '罔', '亻', '仃', '仉', '仂', '仨', '仡', '仫', '仞', '伛', '仳', '伢', '佤', '仵', '伥', '伧', '伉', '伫', '佞', '佧', '攸', '佚', '佝', '佟', '佗', '伲', '伽', '佶', '佴', '侑', '侉', '侃', '侏', '佾', '佻', '侪', '佼', '侬', '侔', '俦', '俨', '俪', '俅', '俚', '俣', '俜', '俑', '俟', '俸', '倩', '偌', '俳', '倬', '倏', '倮', '倭', '俾', '倜', '倌', '倥', '倨', '偾', '偃', '偕', '偈', '偎', '偬', '偻', '傥', '傧', '傩', '傺', '僖', '儆', '僭', '僬', '僦', '僮', '儇', '儋', '仝', '氽', '佘', '佥', '俎', '龠', '汆', '籴', '兮', '巽', '黉', '馘', '冁', '夔', '勹', '匍', '訇', '匐', '凫', '夙', '兕', '亠', '兖', '亳', '衮', '袤', '亵', '脔', '裒', '禀', '嬴', '蠃', '羸', '冫', '冱', '冽', '冼', '凇', '冖', '冢', '冥', '讠', '讦', '讧', '讪', '讴', '讵', '讷', '诂', '诃', '诋', '诏', '诎', '诒', '诓', '诔', '诖', '诘', '诙', '诜', '诟', '诠', '诤', '诨', '诩', '诮', '诰', '诳', '诶', '诹', '诼', '诿', '谀', '谂', '谄', '谇', '谌', '谏', '谑', '谒', '谔', '谕', '谖', '谙', '谛', '谘', '谝', '谟', '谠', '谡', '谥', '谧', '谪', '谫', '谮', '谯', '谲', '谳', '谵', '谶', '卩', '卺', '阝', '阢', '阡', '阱', '阪', '阽', '阼', '陂', '陉', '陔', '陟', '陧', '陬', '陲', '陴', '隈', '隍', '隗', '隰', '邗', '邛', '邝', '邙', '邬', '邡', '邴', '邳', '邶', '邺', '邸', '邰', '郏', '郅', '邾', '郐', '郄', '郇', '郓', '郦', '郢', '郜', '郗', '郛', '郫', '郯', '郾', '鄄', '鄢', '鄞', '鄣', '鄱', '鄯', '鄹', '酃', '酆', '刍', '奂', '劢', '劬', '劭', '劾', '哿', '勐', '勖', '勰', '叟', '燮', '矍', '廴', '凵', '凼', '鬯', '厶', '弁', '畚', '巯', '坌', '垩', '垡', '塾', '墼', '壅', '壑', '圩', '圬', '圪', '圳', '圹', '圮', '圯', '坜', '圻', '坂', '坩', '垅', '坫', '垆', '坼', '坻', '坨', '坭', '坶', '坳', '垭', '垤', '垌', '垲', '埏', '垧', '垴', '垓', '垠', '埕', '埘', '埚', '埙', '埒', '垸', '埴', '埯', '埸', '埤', '埝', '堋', '堍', '埽', '埭', '堀', '堞', '堙', '塄', '堠', '塥', '塬', '墁', '墉', '墚', '墀', '馨', '鼙', '懿', '艹', '艽', '艿', '芏', '芊', '芨', '芄', '芎', '芑', '芗', '芙', '芫', '芸', '芾', '芰', '苈', '苊', '苣', '芘', '芷', '芮', '苋', '苌', '苁', '芩', '芴', '芡', '芪', '芟', '苄', '苎', '芤', '苡', '茉', '苷', '苤', '茏', '茇', '苜', '苴', '苒', '苘', '茌', '苻', '苓', '茑', '茚', '茆', '茔', '茕', '苠', '苕', '茜', '荑', '荛', '荜', '茈', '莒', '茼', '茴', '茱', '莛', '荞', '茯', '荏', '荇', '荃', '荟', '荀', '茗', '荠', '茭', '茺', '茳', '荦', '荥', '荨', '茛', '荩', '荬', '荪', '荭', '荮', '莰', '荸', '莳', '莴', '莠', '莪', '莓', '莜', '莅', '荼', '莶', '莩', '荽', '莸', '荻', '莘', '莞', '莨', '莺', '莼', '菁', '萁', '菥', '菘', '堇', '萘', '萋', '菝', '菽', '菖', '萜', '萸', '萑', '萆', '菔', '菟', '萏', '萃', '菸', '菹', '菪', '菅', '菀', '萦', '菰', '菡', '葜', '葑', '葚', '葙', '葳', '蒇', '蒈', '葺', '蒉', '葸', '萼', '葆', '葩', '葶', '蒌', '蒎', '萱', '葭', '蓁', '蓍', '蓐', '蓦', '蒽', '蓓', '蓊', '蒿', '蒺', '蓠', '蒡', '蒹', '蒴', '蒗', '蓥', '蓣', '蔌', '甍', '蔸', '蓰', '蔹', '蔟', '蔺', '蕖', '蔻', '蓿', '蓼', '蕙', '蕈', '蕨', '蕤', '蕞', '蕺', '瞢', '蕃', '蕲', '蕻', '薤', '薨', '薇', '薏', '蕹', '薮', '薜', '薅', '薹', '薷', '薰', '藓', '藁', '藜', '藿', '蘧', '蘅', '蘩', '蘖', '蘼', '廾', '弈', '夼', '奁', '耷', '奕', '奚', '奘', '匏', '尢', '尥', '尬', '尴', '扌', '扪', '抟', '抻', '拊', '拚', '拗', '拮', '挢', '拶', '挹', '捋', '捃', '掭', '揶', '捱', '捺', '掎', '掴', '捭', '掬', '掊', '捩', '掮', '掼', '揲', '揸', '揠', '揿', '揄', '揞', '揎', '摒', '揆', '掾', '摅', '摁', '搋', '搛', '搠', '搌', '搦', '搡', '摞', '撄', '摭', '撖', '摺', '撷', '撸', '撙', '撺', '擀', '擐', '擗', '擤', '擢', '攉', '攥', '攮', '弋', '忒', '甙', '弑', '卟', '叱', '叽', '叩', '叨', '叻', '吒', '吖', '吆', '呋', '呒', '呓', '呔', '呖', '呃', '吡', '呗', '呙', '吣', '吲', '咂', '咔', '呷', '呱', '呤', '咚', '咛', '咄', '呶', '呦', '咝', '哐', '咭', '哂', '咴', '哒', '咧', '咦', '哓', '哔', '呲', '咣', '哕', '咻', '咿', '哌', '哙', '哚', '哜', '咩', '咪', '咤', '哝', '哏', '哞', '唛', '哧', '唠', '哽', '唔', '哳', '唢', '唣', '唏', '唑', '唧', '唪', '啧', '喏', '喵', '啉', '啭', '啁', '啕', '唿', '啐', '唼', '唷', '啖', '啵', '啶', '啷', '唳', '唰', '啜', '喋', '嗒', '喃', '喱', '喹', '喈', '喁', '喟', '啾', '嗖', '喑', '啻', '嗟', '喽', '喾', '喔', '喙', '嗪', '嗷', '嗉', '嘟', '嗑', '嗫', '嗬', '嗔', '嗦', '嗝', '嗄', '嗯', '嗥', '嗲', '嗳', '嗌', '嗍', '嗨', '嗵', '嗤', '辔', '嘞', '嘈', '嘌', '嘁', '嘤', '嘣', '嗾', '嘀', '嘧', '嘭', '噘', '嘹', '噗', '嘬', '噍', '噢', '噙', '噜', '噌', '噔', '嚆', '噤', '噱', '噫', '噻', '噼', '嚅', '嚓', '嚯', '囔', '囗', '囝', '囡', '囵', '囫', '囹', '囿', '圄', '圊', '圉', '圜', '帏', '帙', '帔', '帑', '帱', '帻', '帼', '帷', '幄', '幔', '幛', '幞', '幡', '岌', '屺', '岍', '岐', '岖', '岈', '岘', '岙', '岑', '岚', '岜', '岵', '岢', '岽', '岬', '岫', '岱', '岣', '峁', '岷', '峄', '峒', '峤', '峋', '峥', '崂', '崃', '崧', '崦', '崮', '崤', '崞', '崆', '崛', '嵘', '崾', '崴', '崽', '嵬', '嵛', '嵯', '嵝', '嵫', '嵋', '嵊', '嵩', '嵴', '嶂', '嶙', '嶝', '豳', '嶷', '巅', '彳', '彷', '徂', '徇', '徉', '後', '徕', '徙', '徜', '徨', '徭', '徵', '徼', '衢', '彡', '犭', '犰', '犴', '犷', '犸', '狃', '狁', '狎', '狍', '狒', '狨', '狯', '狩', '狲', '狴', '狷', '猁', '狳', '猃', '狺', '狻', '猗', '猓', '猡', '猊', '猞', '猝', '猕', '猢', '猹', '猥', '猬', '猸', '猱', '獐', '獍', '獗', '獠', '獬', '獯', '獾', '舛', '夥', '飧', '夤', '夂', '饣', '饧', '饨', '饩', '饪', '饫', '饬', '饴', '饷', '饽', '馀', '馄', '馇', '馊', '馍', '馐', '馑', '馓', '馔', '馕', '庀', '庑', '庋', '庖', '庥', '庠', '庹', '庵', '庾', '庳', '赓', '廒', '廑', '廛', '廨', '廪', '膺', '忄', '忉', '忖', '忏', '怃', '忮', '怄', '忡', '忤', '忾', '怅', '怆', '忪', '忭', '忸', '怙', '怵', '怦', '怛', '怏', '怍', '怩', '怫', '怊', '怿', '怡', '恸', '恹', '恻', '恺', '恂', '恪', '恽', '悖', '悚', '悭', '悝', '悃', '悒', '悌', '悛', '惬', '悻', '悱', '惝', '惘', '惆', '惚', '悴', '愠', '愦', '愕', '愣', '惴', '愀', '愎', '愫', '慊', '慵', '憬', '憔', '憧', '憷', '懔', '懵', '忝', '隳', '闩', '闫', '闱', '闳', '闵', '闶', '闼', '闾', '阃', '阄', '阆', '阈', '阊', '阋', '阌', '阍', '阏', '阒', '阕', '阖', '阗', '阙', '阚', '丬', '爿', '戕', '氵', '汔', '汜', '汊', '沣', '沅', '沐', '沔', '沌', '汨', '汩', '汴', '汶', '沆', '沩', '泐', '泔', '沭', '泷', '泸', '泱', '泗', '沲', '泠', '泖', '泺', '泫', '泮', '沱', '泓', '泯', '泾', '洹', '洧', '洌', '浃', '浈', '洇', '洄', '洙', '洎', '洫', '浍', '洮', '洵', '洚', '浏', '浒', '浔', '洳', '涑', '浯', '涞', '涠', '浞', '涓', '涔', '浜', '浠', '浼', '浣', '渚', '淇', '淅', '淞', '渎', '涿', '淠', '渑', '淦', '淝', '淙', '渖', '涫', '渌', '涮', '渫', '湮', '湎', '湫', '溲', '湟', '溆', '湓', '湔', '渲', '渥', '湄', '滟', '溱', '溘', '滠', '漭', '滢', '溥', '溧', '溽', '溻', '溷', '滗', '溴', '滏', '溏', '滂', '溟', '潢', '潆', '潇', '漤', '漕', '滹', '漯', '漶', '潋', '潴', '漪', '漉', '漩', '澉', '澍', '澌', '潸', '潲', '潼', '潺', '濑', '濉', '澧', '澹', '澶', '濂', '濡', '濮', '濞', '濠', '濯', '瀚', '瀣', '瀛', '瀹', '瀵', '灏', '灞', '宀', '宄', '宕', '宓', '宥', '宸', '甯', '骞', '搴', '寤', '寮', '褰', '寰', '蹇', '謇', '辶', '迓', '迕', '迥', '迮', '迤', '迩', '迦', '迳', '迨', '逅', '逄', '逋', '逦', '逑', '逍', '逖', '逡', '逵', '逶', '逭', '逯', '遄', '遑', '遒', '遐', '遨', '遘', '遢', '遛', '暹', '遴', '遽', '邂', '邈', '邃', '邋', '彐', '彗', '彖', '彘', '尻', '咫', '屐', '屙', '孱', '屣', '屦', '羼', '弪', '弩', '弭', '艴', '弼', '鬻', '屮', '妁', '妃', '妍', '妩', '妪', '妣', '妗', '姊', '妫', '妞', '妤', '姒', '妲', '妯', '姗', '妾', '娅', '娆', '姝', '娈', '姣', '姘', '姹', '娌', '娉', '娲', '娴', '娑', '娣', '娓', '婀', '婧', '婊', '婕', '娼', '婢', '婵', '胬', '媪', '媛', '婷', '婺', '媾', '嫫', '媲', '嫒', '嫔', '媸', '嫠', '嫣', '嫱', '嫖', '嫦', '嫘', '嫜', '嬉', '嬗', '嬖', '嬲', '嬷', '孀', '尕', '尜', '孚', '孥', '孳', '孑', '孓', '孢', '驵', '驷', '驸', '驺', '驿', '驽', '骀', '骁', '骅', '骈', '骊', '骐', '骒', '骓', '骖', '骘', '骛', '骜', '骝', '骟', '骠', '骢', '骣', '骥', '骧', '纟', '纡', '纣', '纥', '纨', '纩', '纭', '纰', '纾', '绀', '绁', '绂', '绉', '绋', '绌', '绐', '绔', '绗', '绛', '绠', '绡', '绨', '绫', '绮', '绯', '绱', '绲', '缍', '绶', '绺', '绻', '绾', '缁', '缂', '缃', '缇', '缈', '缋', '缌', '缏', '缑', '缒', '缗', '缙', '缜', '缛', '缟', '缡', '缢', '缣', '缤', '缥', '缦', '缧', '缪', '缫', '缬', '缭', '缯', '缰', '缱', '缲', '缳', '缵', '幺', '畿', '巛', '甾', '邕', '玎', '玑', '玮', '玢', '玟', '珏', '珂', '珑', '玷', '玳', '珀', '珉', '珈', '珥', '珙', '顼', '琊', '珩', '珧', '珞', '玺', '珲', '琏', '琪', '瑛', '琦', '琥', '琨', '琰', '琮', '琬', '琛', '琚', '瑁', '瑜', '瑗', '瑕', '瑙', '瑷', '瑭', '瑾', '璜', '璎', '璀', '璁', '璇', '璋', '璞', '璨', '璩', '璐', '璧', '瓒', '璺', '韪', '韫', '韬', '杌', '杓', '杞', '杈', '杩', '枥', '枇', '杪', '杳', '枘', '枧', '杵', '枨', '枞', '枭', '枋', '杷', '杼', '柰', '栉', '柘', '栊', '柩', '枰', '栌', '柙', '枵', '柚', '枳', '柝', '栀', '柃', '枸', '柢', '栎', '柁', '柽', '栲', '栳', '桠', '桡', '桎', '桢', '桄', '桤', '梃', '栝', '桕', '桦', '桁', '桧', '桀', '栾', '桊', '桉', '栩', '梵', '梏', '桴', '桷', '梓', '桫', '棂', '楮', '棼', '椟', '椠', '棹', '椤', '棰', '椋', '椁', '楗', '棣', '椐', '楱', '椹', '楠', '楂', '楝', '榄', '楫', '榀', '榘', '楸', '椴', '槌', '榇', '榈', '槎', '榉', '楦', '楣', '楹', '榛', '榧', '榻', '榫', '榭', '槔', '榱', '槁', '槊', '槟', '榕', '槠', '榍', '槿', '樯', '槭', '樗', '樘', '橥', '槲', '橄', '樾', '檠', '橐', '橛', '樵', '檎', '橹', '樽', '樨', '橘', '橼', '檑', '檐', '檩', '檗', '檫', '猷', '獒', '殁', '殂', '殇', '殄', '殒', '殓', '殍', '殚', '殛', '殡', '殪', '轫', '轭', '轱', '轲', '轳', '轵', '轶', '轸', '轷', '轹', '轺', '轼', '轾', '辁', '辂', '辄', '辇', '辋', '辍', '辎', '辏', '辘', '辚', '軎', '戋', '戗', '戛', '戟', '戢', '戡', '戥', '戤', '戬', '臧', '瓯', '瓴', '瓿', '甏', '甑', '甓', '攴', '旮', '旯', '旰', '昊', '昙', '杲', '昃', '昕', '昀', '炅', '曷', '昝', '昴', '昱', '昶', '昵', '耆', '晟', '晔', '晁', '晏', '晖', '晡', '晗', '晷', '暄', '暌', '暧', '暝', '暾', '曛', '曜', '曦', '曩', '贲', '贳', '贶', '贻', '贽', '赀', '赅', '赆', '赈', '赉', '赇', '赍', '赕', '赙', '觇', '觊', '觋', '觌', '觎', '觏', '觐', '觑', '牮', '犟', '牝', '牦', '牯', '牾', '牿', '犄', '犋', '犍', '犏', '犒', '挈', '挲', '掰', '搿', '擘', '耄', '毪', '毳', '毽', '毵', '毹', '氅', '氇', '氆', '氍', '氕', '氘', '氙', '氚', '氡', '氩', '氤', '氪', '氲', '攵', '敕', '敫', '牍', '牒', '牖', '爰', '虢', '刖', '肟', '肜', '肓', '肼', '朊', '肽', '肱', '肫', '肭', '肴', '肷', '胧', '胨', '胩', '胪', '胛', '胂', '胄', '胙', '胍', '胗', '朐', '胝', '胫', '胱', '胴', '胭', '脍', '脎', '胲', '胼', '朕', '脒', '豚', '脶', '脞', '脬', '脘', '脲', '腈', '腌', '腓', '腴', '腙', '腚', '腱', '腠', '腩', '腼', '腽', '腭', '腧', '塍', '媵', '膈', '膂', '膑', '滕', '膣', '膪', '臌', '朦', '臊', '膻', '臁', '膦', '欤', '欷', '欹', '歃', '歆', '歙', '飑', '飒', '飓', '飕', '飙', '飚', '殳', '彀', '毂', '觳', '斐', '齑', '斓', '於', '旆', '旄', '旃', '旌', '旎', '旒', '旖', '炀', '炜', '炖', '炝', '炻', '烀', '炷', '炫', '炱', '烨', '烊', '焐', '焓', '焖', '焯', '焱', '煳', '煜', '煨', '煅', '煲', '煊', '煸', '煺', '熘', '熳', '熵', '熨', '熠', '燠', '燔', '燧', '燹', '爝', '爨', '灬', '焘', '煦', '熹', '戾', '戽', '扃', '扈', '扉', '礻', '祀', '祆', '祉', '祛', '祜', '祓', '祚', '祢', '祗', '祠', '祯', '祧', '祺', '禅', '禊', '禚', '禧', '禳', '忑', '忐', '怼', '恝', '恚', '恧', '恁', '恙', '恣', '悫', '愆', '愍', '慝', '憩', '憝', '懋', '懑', '戆', '肀', '聿', '沓', '泶', '淼', '矶', '矸', '砀', '砉', '砗', '砘', '砑', '斫', '砭', '砜', '砝', '砹', '砺', '砻', '砟', '砼', '砥', '砬', '砣', '砩', '硎', '硭', '硖', '硗', '砦', '硐', '硇', '硌', '硪', '碛', '碓', '碚', '碇', '碜', '碡', '碣', '碲', '碹', '碥', '磔', '磙', '磉', '磬', '磲', '礅', '磴', '礓', '礤', '礞', '礴', '龛', '黹', '黻', '黼', '盱', '眄', '眍', '盹', '眇', '眈', '眚', '眢', '眙', '眭', '眦', '眵', '眸', '睐', '睑', '睇', '睃', '睚', '睨', '睢', '睥', '睿', '瞍', '睽', '瞀', '瞌', '瞑', '瞟', '瞠', '瞰', '瞵', '瞽', '町', '畀', '畎', '畋', '畈', '畛', '畲', '畹', '疃', '罘', '罡', '罟', '詈', '罨', '罴', '罱', '罹', '羁', '罾', '盍', '盥', '蠲', '钅', '钆', '钇', '钋', '钊', '钌', '钍', '钏', '钐', '钔', '钗', '钕', '钚', '钛', '钜', '钣', '钤', '钫', '钪', '钭', '钬', '钯', '钰', '钲', '钴', '钶', '钷', '钸', '钹', '钺', '钼', '钽', '钿', '铄', '铈', '铉', '铊', '铋', '铌', '铍', '铎', '铐', '铑', '铒', '铕', '铖', '铗', '铙', '铘', '铛', '铞', '铟', '铠', '铢', '铤', '铥', '铧', '铨', '铪', '铩', '铫', '铮', '铯', '铳', '铴', '铵', '铷', '铹', '铼', '铽', '铿', '锃', '锂', '锆', '锇', '锉', '锊', '锍', '锎', '锏', '锒', '锓', '锔', '锕', '锖', '锘', '锛', '锝', '锞', '锟', '锢', '锪', '锫', '锩', '锬', '锱', '锲', '锴', '锶', '锷', '锸', '锼', '锾', '锿', '镂', '锵', '镄', '镅', '镆', '镉', '镌', '镎', '镏', '镒', '镓', '镔', '镖', '镗', '镘', '镙', '镛', '镞', '镟', '镝', '镡', '镢', '镤', '镥', '镦', '镧', '镨', '镩', '镪', '镫', '镬', '镯', '镱', '镲', '镳', '锺', '矧', '矬', '雉', '秕', '秭', '秣', '秫', '稆', '嵇', '稃', '稂', '稞', '稔', '稹', '稷', '穑', '黏', '馥', '穰', '皈', '皎', '皓', '皙', '皤', '瓞', '瓠', '甬', '鸠', '鸢', '鸨', '鸩', '鸪', '鸫', '鸬', '鸲', '鸱', '鸶', '鸸', '鸷', '鸹', '鸺', '鸾', '鹁', '鹂', '鹄', '鹆', '鹇', '鹈', '鹉', '鹋', '鹌', '鹎', '鹑', '鹕', '鹗', '鹚', '鹛', '鹜', '鹞', '鹣', '鹦', '鹧', '鹨', '鹩', '鹪', '鹫', '鹬', '鹱', '鹭', '鹳', '疒', '疔', '疖', '疠', '疝', '疬', '疣', '疳', '疴', '疸', '痄', '疱', '疰', '痃', '痂', '痖', '痍', '痣', '痨', '痦', '痤', '痫', '痧', '瘃', '痱', '痼', '痿', '瘐', '瘀', '瘅', '瘌', '瘗', '瘊', '瘥', '瘘', '瘕', '瘙', '瘛', '瘼', '瘢', '瘠', '癀', '瘭', '瘰', '瘿', '瘵', '癃', '瘾', '瘳', '癍', '癞', '癔', '癜', '癖', '癫', '癯', '翊', '竦', '穸', '穹', '窀', '窆', '窈', '窕', '窦', '窠', '窬', '窨', '窭', '窳', '衤', '衩', '衲', '衽', '衿', '袂', '袢', '裆', '袷', '袼', '裉', '裢', '裎', '裣', '裥', '裱', '褚', '裼', '裨', '裾', '裰', '褡', '褙', '褓', '褛', '褊', '褴', '褫', '褶', '襁', '襦', '襻', '疋', '胥', '皲', '皴', '矜', '耒', '耔', '耖', '耜', '耠', '耢', '耥', '耦', '耧', '耩', '耨', '耱', '耋', '耵', '聃', '聆', '聍', '聒', '聩', '聱', '覃', '顸', '颀', '颃', '颉', '颌', '颍', '颏', '颔', '颚', '颛', '颞', '颟', '颡', '颢', '颥', '颦', '虍', '虔', '虬', '虮', '虿', '虺', '虼', '虻', '蚨', '蚍', '蚋', '蚬', '蚝', '蚧', '蚣', '蚪', '蚓', '蚩', '蚶', '蛄', '蚵', '蛎', '蚰', '蚺', '蚱', '蚯', '蛉', '蛏', '蚴', '蛩', '蛱', '蛲', '蛭', '蛳', '蛐', '蜓', '蛞', '蛴', '蛟', '蛘', '蛑', '蜃', '蜇', '蛸', '蜈', '蜊', '蜍', '蜉', '蜣', '蜻', '蜞', '蜥', '蜮', '蜚', '蜾', '蝈', '蜴', '蜱', '蜩', '蜷', '蜿', '螂', '蜢', '蝽', '蝾', '蝻', '蝠', '蝰', '蝌', '蝮', '螋', '蝓', '蝣', '蝼', '蝤', '蝙', '蝥', '螓', '螯', '螨', '蟒', '蟆', '螈', '螅', '螭', '螗', '螃', '螫', '蟥', '螬', '螵', '螳', '蟋', '蟓', '螽', '蟑', '蟀', '蟊', '蟛', '蟪', '蟠', '蟮', '蠖', '蠓', '蟾', '蠊', '蠛', '蠡', '蠹', '蠼', '缶', '罂', '罄', '罅', '舐', '竺', '竽', '笈', '笃', '笄', '笕', '笊', '笫', '笏', '筇', '笸', '笪', '笙', '笮', '笱', '笠', '笥', '笤', '笳', '笾', '笞', '筘', '筚', '筅', '筵', '筌', '筝', '筠', '筮', '筻', '筢', '筲', '筱', '箐', '箦', '箧', '箸', '箬', '箝', '箨', '箅', '箪', '箜', '箢', '箫', '箴', '篑', '篁', '篌', '篝', '篚', '篥', '篦', '篪', '簌', '篾', '篼', '簏', '簖', '簋', '簟', '簪', '簦', '簸', '籁', '籀', '臾', '舁', '舂', '舄', '臬', '衄', '舡', '舢', '舣', '舭', '舯', '舨', '舫', '舸', '舻', '舳', '舴', '舾', '艄', '艉', '艋', '艏', '艚', '艟', '艨', '衾', '袅', '袈', '裘', '裟', '襞', '羝', '羟', '羧', '羯', '羰', '羲', '籼', '敉', '粑', '粝', '粜', '粞', '粢', '粲', '粼', '粽', '糁', '糇', '糌', '糍', '糈', '糅', '糗', '糨', '艮', '暨', '羿', '翎', '翕', '翥', '翡', '翦', '翩', '翮', '翳', '糸', '絷', '綦', '綮', '繇', '纛', '麸', '麴', '赳', '趄', '趔', '趑', '趱', '赧', '赭', '豇', '豉', '酊', '酐', '酎', '酏', '酤', '酢', '酡', '酰', '酩', '酯', '酽', '酾', '酲', '酴', '酹', '醌', '醅', '醐', '醍', '醑', '醢', '醣', '醪', '醭', '醮', '醯', '醵', '醴', '醺', '豕', '鹾', '趸', '跫', '踅', '蹙', '蹩', '趵', '趿', '趼', '趺', '跄', '跖', '跗', '跚', '跞', '跎', '跏', '跛', '跆', '跬', '跷', '跸', '跣', '跹', '跻', '跤', '踉', '跽', '踔', '踝', '踟', '踬', '踮', '踣', '踯', '踺', '蹀', '踹', '踵', '踽', '踱', '蹉', '蹁', '蹂', '蹑', '蹒', '蹊', '蹰', '蹶', '蹼', '蹯', '蹴', '躅', '躏', '躔', '躐', '躜', '躞', '豸', '貂', '貊', '貅', '貘', '貔', '斛', '觖', '觞', '觚', '觜', '觥', '觫', '觯', '訾', '謦', '靓', '雩', '雳', '雯', '霆', '霁', '霈', '霏', '霎', '霪', '霭', '霰', '霾', '龀', '龃', '龅', '龆', '龇', '龈', '龉', '龊', '龌', '黾', '鼋', '鼍', '隹', '隼', '隽', '雎', '雒', '瞿', '雠', '銎', '銮', '鋈', '錾', '鍪', '鏊', '鎏', '鐾', '鑫', '鱿', '鲂', '鲅', '鲆', '鲇', '鲈', '稣', '鲋', '鲎', '鲐', '鲑', '鲒', '鲔', '鲕', '鲚', '鲛', '鲞', '鲟', '鲠', '鲡', '鲢', '鲣', '鲥', '鲦', '鲧', '鲨', '鲩', '鲫', '鲭', '鲮', '鲰', '鲱', '鲲', '鲳', '鲴', '鲵', '鲶', '鲷', '鲺', '鲻', '鲼', '鲽', '鳄', '鳅', '鳆', '鳇', '鳊', '鳋', '鳌', '鳍', '鳎', '鳏', '鳐', '鳓', '鳔', '鳕', '鳗', '鳘', '鳙', '鳜', '鳝', '鳟', '鳢', '靼', '鞅', '鞑', '鞒', '鞔', '鞯', '鞫', '鞣', '鞲', '鞴', '骱', '骰', '骷', '鹘', '骶', '骺', '骼', '髁', '髀', '髅', '髂', '髋', '髌', '髑', '魅', '魃', '魇', '魉', '魈', '魍', '魑', '飨', '餍', '餮', '饕', '饔', '髟', '髡', '髦', '髯', '髫', '髻', '髭', '髹', '鬈', '鬏', '鬓', '鬟', '鬣', '麽', '麾', '縻', '麂', '麇', '麈', '麋', '麒', '鏖', '麝', '麟', '黛', '黜', '黝', '黠', '黟', '黢', '黩', '黧', '黥', '黪', '黯', '鼢', '鼬', '鼯', '鼹', '鼷', '鼽', '鼾', '齄']
FONT_GBCODE = ['B0A1', 'B0A2', 'B0A3', 'B0A4', 'B0A5', 'B0A6', 'B0A7', 'B0A8', 'B0A9', 'B0AA', 'B0AB', 'B0AC', 'B0AD', 'B0AE', 'B0AF', 'B0B0', 'B0B1', 'B0B2', 'B0B3', 'B0B4', 'B0B5', 'B0B6', 'B0B7', 'B0B8', 'B0B9', 'B0BA', 'B0BB', 'B0BC', 'B0BD', 'B0BE', 'B0BF', 'B0C0', 'B0C1', 'B0C2', 'B0C3', 'B0C4', 'B0C5', 'B0C6', 'B0C7', 'B0C8', 'B0C9', 'B0CA', 'B0CB', 'B0CC', 'B0CD', 'B0CE', 'B0CF', 'B0D0', 'B0D1', 'B0D2', 'B0D3', 'B0D4', 'B0D5', 'B0D6', 'B0D7', 'B0D8', 'B0D9', 'B0DA', 'B0DB', 'B0DC', 'B0DD', 'B0DE', 'B0DF', 'B0E0', 'B0E1', 'B0E2', 'B0E3', 'B0E4', 'B0E5', 'B0E6', 'B0E7', 'B0E8', 'B0E9', 'B0EA', 'B0EB', 'B0EC', 'B0ED', 'B0EE', 'B0EF', 'B0F0', 'B0F1', 'B0F2', 'B0F3', 'B0F4', 'B0F5', 'B0F6', 'B0F7', 'B0F8', 'B0F9', 'B0FA', 'B0FB', 'B0FC', 'B0FD', 'B0FE', 'B1A1', 'B1A2', 'B1A3', 'B1A4', 'B1A5', 'B1A6', 'B1A7', 'B1A8', 'B1A9', 'B1AA', 'B1AB', 'B1AC', 'B1AD', 'B1AE', 'B1AF', 'B1B0', 'B1B1', 'B1B2', 'B1B3', 'B1B4', 'B1B5', 'B1B6', 'B1B7', 'B1B8', 'B1B9', 'B1BA', 'B1BB', 'B1BC', 'B1BD', 'B1BE', 'B1BF', 'B1C0', 'B1C1', 'B1C2', 'B1C3', 'B1C4', 'B1C5', 'B1C6', 'B1C7', 'B1C8', 'B1C9', 'B1CA', 'B1CB', 'B1CC', 'B1CD', 'B1CE', 'B1CF', 'B1D0', 'B1D1', 'B1D2', 'B1D3', 'B1D4', 'B1D5', 'B1D6', 'B1D7', 'B1D8', 'B1D9', 'B1DA', 'B1DB', 'B1DC', 'B1DD', 'B1DE', 'B1DF', 'B1E0', 'B1E1', 'B1E2', 'B1E3', 'B1E4', 'B1E5', 'B1E6', 'B1E7', 'B1E8', 'B1E9', 'B1EA', 'B1EB', 'B1EC', 'B1ED', 'B1EE', 'B1EF', 'B1F0', 'B1F1', 'B1F2', 'B1F3', 'B1F4', 'B1F5', 'B1F6', 'B1F7', 'B1F8', 'B1F9', 'B1FA', 'B1FB', 'B1FC', 'B1FD', 'B1FE', 'B2A1', 'B2A2', 'B2A3', 'B2A4', 'B2A5', 'B2A6', 'B2A7', 'B2A8', 'B2A9', 'B2AA', 'B2AB', 'B2AC', 'B2AD', 'B2AE', 'B2AF', 'B2B0', 'B2B1', 'B2B2', 'B2B3', 'B2B4', 'B2B5', 'B2B6', 'B2B7', 'B2B8', 'B2B9', 'B2BA', 'B2BB', 'B2BC', 'B2BD', 'B2BE', 'B2BF', 'B2C0', 'B2C1', 'B2C2', 'B2C3', 'B2C4', 'B2C5', 'B2C6', 'B2C7', 'B2C8', 'B2C9', 'B2CA', 'B2CB', 'B2CC', 'B2CD', 'B2CE', 'B2CF', 'B2D0', 'B2D1', 'B2D2', 'B2D3', 'B2D4', 'B2D5', 'B2D6', 'B2D7', 'B2D8', 'B2D9', 'B2DA', 'B2DB', 'B2DC', 'B2DD', 'B2DE', 'B2DF', 'B2E0', 'B2E1', 'B2E2', 'B2E3', 'B2E4', 'B2E5', 'B2E6', 'B2E7', 'B2E8', 'B2E9', 'B2EA', 'B2EB', 'B2EC', 'B2ED', 'B2EE', 'B2EF', 'B2F0', 'B2F1', 'B2F2', 'B2F3', 'B2F4', 'B2F5', 'B2F6', 'B2F7', 'B2F8', 'B2F9', 'B2FA', 'B2FB', 'B2FC', 'B2FD', 'B2FE', 'B3A1', 'B3A2', 'B3A3', 'B3A4', 'B3A5', 'B3A6', 'B3A7', 'B3A8', 'B3A9', 'B3AA', 'B3AB', 'B3AC', 'B3AD', 'B3AE', 'B3AF', 'B3B0', 'B3B1', 'B3B2', 'B3B3', 'B3B4', 'B3B5', 'B3B6', 'B3B7', 'B3B8', 'B3B9', 'B3BA', 'B3BB', 'B3BC', 'B3BD', 'B3BE', 'B3BF', 'B3C0', 'B3C1', 'B3C2', 'B3C3', 'B3C4', 'B3C5', 'B3C6', 'B3C7', 'B3C8', 'B3C9', 'B3CA', 'B3CB', 'B3CC', 'B3CD', 'B3CE', 'B3CF', 'B3D0', 'B3D1', 'B3D2', 'B3D3', 'B3D4', 'B3D5', 'B3D6', 'B3D7', 'B3D8', 'B3D9', 'B3DA', 'B3DB', 'B3DC', 'B3DD', 'B3DE', 'B3DF', 'B3E0', 'B3E1', 'B3E2', 'B3E3', 'B3E4', 'B3E5', 'B3E6', 'B3E7', 'B3E8', 'B3E9', 'B3EA', 'B3EB', 'B3EC', 'B3ED', 'B3EE', 'B3EF', 'B3F0', 'B3F1', 'B3F2', 'B3F3', 'B3F4', 'B3F5', 'B3F6', 'B3F7', 'B3F8', 'B3F9', 'B3FA', 'B3FB', 'B3FC', 'B3FD', 'B3FE', 'B4A1', 'B4A2', 'B4A3', 'B4A4', 'B4A5', 'B4A6', 'B4A7', 'B4A8', 'B4A9', 'B4AA', 'B4AB', 'B4AC', 'B4AD', 'B4AE', 'B4AF', 'B4B0', 'B4B1', 'B4B2', 'B4B3', 'B4B4', 'B4B5', 'B4B6', 'B4B7', 'B4B8', 'B4B9', 'B4BA', 'B4BB', 'B4BC', 'B4BD', 'B4BE', 'B4BF', 'B4C0', 'B4C1', 'B4C2', 'B4C3', 'B4C4', 'B4C5', 'B4C6', 'B4C7', 'B4C8', 'B4C9', 'B4CA', 'B4CB', 'B4CC', 'B4CD', 'B4CE', 'B4CF', 'B4D0', 'B4D1', 'B4D2', 'B4D3', 'B4D4', 'B4D5', 'B4D6', 'B4D7', 'B4D8', 'B4D9', 'B4DA', 'B4DB', 'B4DC', 'B4DD', 'B4DE', 'B4DF', 'B4E0', 'B4E1', 'B4E2', 'B4E3', 'B4E4', 'B4E5', 'B4E6', 'B4E7', 'B4E8', 'B4E9', 'B4EA', 'B4EB', 'B4EC', 'B4ED', 'B4EE', 'B4EF', 'B4F0', 'B4F1', 'B4F2', 'B4F3', 'B4F4', 'B4F5', 'B4F6', 'B4F7', 'B4F8', 'B4F9', 'B4FA', 'B4FB', 'B4FC', 'B4FD', 'B4FE', 'B5A1', 'B5A2', 'B5A3', 'B5A4', 'B5A5', 'B5A6', 'B5A7', 'B5A8', 'B5A9', 'B5AA', 'B5AB', 'B5AC', 'B5AD', 'B5AE', 'B5AF', 'B5B0', 'B5B1', 'B5B2', 'B5B3', 'B5B4', 'B5B5', 'B5B6', 'B5B7', 'B5B8', 'B5B9', 'B5BA', 'B5BB', 'B5BC', 'B5BD', 'B5BE', 'B5BF', 'B5C0', 'B5C1', 'B5C2', 'B5C3', 'B5C4', 'B5C5', 'B5C6', 'B5C7', 'B5C8', 'B5C9', 'B5CA', 'B5CB', 'B5CC', 'B5CD', 'B5CE', 'B5CF', 'B5D0', 'B5D1', 'B5D2', 'B5D3', 'B5D4', 'B5D5', 'B5D6', 'B5D7', 'B5D8', 'B5D9', 'B5DA', 'B5DB', 'B5DC', 'B5DD', 'B5DE', 'B5DF', 'B5E0', 'B5E1', 'B5E2', 'B5E3', 'B5E4', 'B5E5', 'B5E6', 'B5E7', 'B5E8', 'B5E9', 'B5EA', 'B5EB', 'B5EC', 'B5ED', 'B5EE', 'B5EF', 'B5F0', 'B5F1', 'B5F2', 'B5F3', 'B5F4', 'B5F5', 'B5F6', 'B5F7', 'B5F8', 'B5F9', 'B5FA', 'B5FB', 'B5FC', 'B5FD', 'B5FE', 'B6A1', 'B6A2', 'B6A3', 'B6A4', 'B6A5', 'B6A6', 'B6A7', 'B6A8', 'B6A9', 'B6AA', 'B6AB', 'B6AC', 'B6AD', 'B6AE', 'B6AF', 'B6B0', 'B6B1', 'B6B2', 'B6B3', 'B6B4', 'B6B5', 'B6B6', 'B6B7', 'B6B8', 'B6B9', 'B6BA', 'B6BB', 'B6BC', 'B6BD', 'B6BE', 'B6BF', 'B6C0', 'B6C1', 'B6C2', 'B6C3', 'B6C4', 'B6C5', 'B6C6', 'B6C7', 'B6C8', 'B6C9', 'B6CA', 'B6CB', 'B6CC', 'B6CD', 'B6CE', 'B6CF', 'B6D0', 'B6D1', 'B6D2', 'B6D3', 'B6D4', 'B6D5', 'B6D6', 'B6D7', 'B6D8', 'B6D9', 'B6DA', 'B6DB', 'B6DC', 'B6DD', 'B6DE', 'B6DF', 'B6E0', 'B6E1', 'B6E2', 'B6E3', 'B6E4', 'B6E5', 'B6E6', 'B6E7', 'B6E8', 'B6E9', 'B6EA', 'B6EB', 'B6EC', 'B6ED', 'B6EE', 'B6EF', 'B6F0', 'B6F1', 'B6F2', 'B6F3', 'B6F4', 'B6F5', 'B6F6', 'B6F7', 'B6F8', 'B6F9', 'B6FA', 'B6FB', 'B6FC', 'B6FD', 'B6FE', 'B7A1', 'B7A2', 'B7A3', 'B7A4', 'B7A5', 'B7A6', 'B7A7', 'B7A8', 'B7A9', 'B7AA', 'B7AB', 'B7AC', 'B7AD', 'B7AE', 'B7AF', 'B7B0', 'B7B1', 'B7B2', 'B7B3', 'B7B4', 'B7B5', 'B7B6', 'B7B7', 'B7B8', 'B7B9', 'B7BA', 'B7BB', 'B7BC', 'B7BD', 'B7BE', 'B7BF', 'B7C0', 'B7C1', 'B7C2', 'B7C3', 'B7C4', 'B7C5', 'B7C6', 'B7C7', 'B7C8', 'B7C9', 'B7CA', 'B7CB', 'B7CC', 'B7CD', 'B7CE', 'B7CF', 'B7D0', 'B7D1', 'B7D2', 'B7D3', 'B7D4', 'B7D5', 'B7D6', 'B7D7', 'B7D8', 'B7D9', 'B7DA', 'B7DB', 'B7DC', 'B7DD', 'B7DE', 'B7DF', 'B7E0', 'B7E1', 'B7E2', 'B7E3', 'B7E4', 'B7E5', 'B7E6', 'B7E7', 'B7E8', 'B7E9', 'B7EA', 'B7EB', 'B7EC', 'B7ED', 'B7EE', 'B7EF', 'B7F0', 'B7F1', 'B7F2', 'B7F3', 'B7F4', 'B7F5', 'B7F6', 'B7F7', 'B7F8', 'B7F9', 'B7FA', 'B7FB', 'B7FC', 'B7FD', 'B7FE', 'B8A1', 'B8A2', 'B8A3', 'B8A4', 'B8A5', 'B8A6', 'B8A7', 'B8A8', 'B8A9', 'B8AA', 'B8AB', 'B8AC', 'B8AD', 'B8AE', 'B8AF', 'B8B0', 'B8B1', 'B8B2', 'B8B3', 'B8B4', 'B8B5', 'B8B6', 'B8B7', 'B8B8', 'B8B9', 'B8BA', 'B8BB', 'B8BC', 'B8BD', 'B8BE', 'B8BF', 'B8C0', 'B8C1', 'B8C2', 'B8C3', 'B8C4', 'B8C5', 'B8C6', 'B8C7', 'B8C8', 'B8C9', 'B8CA', 'B8CB', 'B8CC', 'B8CD', 'B8CE', 'B8CF', 'B8D0', 'B8D1', 'B8D2', 'B8D3', 'B8D4', 'B8D5', 'B8D6', 'B8D7', 'B8D8', 'B8D9', 'B8DA', 'B8DB', 'B8DC', 'B8DD', 'B8DE', 'B8DF', 'B8E0', 'B8E1', 'B8E2', 'B8E3', 'B8E4', 'B8E5', 'B8E6', 'B8E7', 'B8E8', 'B8E9', 'B8EA', 'B8EB', 'B8EC', 'B8ED', 'B8EE', 'B8EF', 'B8F0', 'B8F1', 'B8F2', 'B8F3', 'B8F4', 'B8F5', 'B8F6', 'B8F7', 'B8F8', 'B8F9', 'B8FA', 'B8FB', 'B8FC', 'B8FD', 'B8FE', 'B9A1', 'B9A2', 'B9A3', 'B9A4', 'B9A5', 'B9A6', 'B9A7', 'B9A8', 'B9A9', 'B9AA', 'B9AB', 'B9AC', 'B9AD', 'B9AE', 'B9AF', 'B9B0', 'B9B1', 'B9B2', 'B9B3', 'B9B4', 'B9B5', 'B9B6', 'B9B7', 'B9B8', 'B9B9', 'B9BA', 'B9BB', 'B9BC', 'B9BD', 'B9BE', 'B9BF', 'B9C0', 'B9C1', 'B9C2', 'B9C3', 'B9C4', 'B9C5', 'B9C6', 'B9C7', 'B9C8', 'B9C9', 'B9CA', 'B9CB', 'B9CC', 'B9CD', 'B9CE', 'B9CF', 'B9D0', 'B9D1', 'B9D2', 'B9D3', 'B9D4', 'B9D5', 'B9D6', 'B9D7', 'B9D8', 'B9D9', 'B9DA', 'B9DB', 'B9DC', 'B9DD', 'B9DE', 'B9DF', 'B9E0', 'B9E1', 'B9E2', 'B9E3', 'B9E4', 'B9E5', 'B9E6', 'B9E7', 'B9E8', 'B9E9', 'B9EA', 'B9EB', 'B9EC', 'B9ED', 'B9EE', 'B9EF', 'B9F0', 'B9F1', 'B9F2', 'B9F3', 'B9F4', 'B9F5', 'B9F6', 'B9F7', 'B9F8', 'B9F9', 'B9FA', 'B9FB', 'B9FC', 'B9FD', 'B9FE', 'BAA1', 'BAA2', 'BAA3', 'BAA4', 'BAA5', 'BAA6', 'BAA7', 'BAA8', 'BAA9', 'BAAA', 'BAAB', 'BAAC', 'BAAD', 'BAAE', 'BAAF', 'BAB0', 'BAB1', 'BAB2', 'BAB3', 'BAB4', 'BAB5', 'BAB6', 'BAB7', 'BAB8', 'BAB9', 'BABA', 'BABB', 'BABC', 'BABD', 'BABE', 'BABF', 'BAC0', 'BAC1', 'BAC2', 'BAC3', 'BAC4', 'BAC5', 'BAC6', 'BAC7', 'BAC8', 'BAC9', 'BACA', 'BACB', 'BACC', 'BACD', 'BACE', 'BACF', 'BAD0', 'BAD1', 'BAD2', 'BAD3', 'BAD4', 'BAD5', 'BAD6', 'BAD7', 'BAD8', 'BAD9', 'BADA', 'BADB', 'BADC', 'BADD', 'BADE', 'BADF', 'BAE0', 'BAE1', 'BAE2', 'BAE3', 'BAE4', 'BAE5', 'BAE6', 'BAE7', 'BAE8', 'BAE9', 'BAEA', 'BAEB', 'BAEC', 'BAED', 'BAEE', 'BAEF', 'BAF0', 'BAF1', 'BAF2', 'BAF3', 'BAF4', 'BAF5', 'BAF6', 'BAF7', 'BAF8', 'BAF9', 'BAFA', 'BAFB', 'BAFC', 'BAFD', 'BAFE', 'BBA1', 'BBA2', 'BBA3', 'BBA4', 'BBA5', 'BBA6', 'BBA7', 'BBA8', 'BBA9', 'BBAA', 'BBAB', 'BBAC', 'BBAD', 'BBAE', 'BBAF', 'BBB0', 'BBB1', 'BBB2', 'BBB3', 'BBB4', 'BBB5', 'BBB6', 'BBB7', 'BBB8', 'BBB9', 'BBBA', 'BBBB', 'BBBC', 'BBBD', 'BBBE', 'BBBF', 'BBC0', 'BBC1', 'BBC2', 'BBC3', 'BBC4', 'BBC5', 'BBC6', 'BBC7', 'BBC8', 'BBC9', 'BBCA', 'BBCB', 'BBCC', 'BBCD', 'BBCE', 'BBCF', 'BBD0', 'BBD1', 'BBD2', 'BBD3', 'BBD4', 'BBD5', 'BBD6', 'BBD7', 'BBD8', 'BBD9', 'BBDA', 'BBDB', 'BBDC', 'BBDD', 'BBDE', 'BBDF', 'BBE0', 'BBE1', 'BBE2', 'BBE3', 'BBE4', 'BBE5', 'BBE6', 'BBE7', 'BBE8', 'BBE9', 'BBEA', 'BBEB', 'BBEC', 'BBED', 'BBEE', 'BBEF', 'BBF0', 'BBF1', 'BBF2', 'BBF3', 'BBF4', 'BBF5', 'BBF6', 'BBF7', 'BBF8', 'BBF9', 'BBFA', 'BBFB', 'BBFC', 'BBFD', 'BBFE', 'BCA1', 'BCA2', 'BCA3', 'BCA4', 'BCA5', 'BCA6', 'BCA7', 'BCA8', 'BCA9', 'BCAA', 'BCAB', 'BCAC', 'BCAD', 'BCAE', 'BCAF', 'BCB0', 'BCB1', 'BCB2', 'BCB3', 'BCB4', 'BCB5', 'BCB6', 'BCB7', 'BCB8', 'BCB9', 'BCBA', 'BCBB', 'BCBC', 'BCBD', 'BCBE', 'BCBF', 'BCC0', 'BCC1', 'BCC2', 'BCC3', 'BCC4', 'BCC5', 'BCC6', 'BCC7', 'BCC8', 'BCC9', 'BCCA', 'BCCB', 'BCCC', 'BCCD', 'BCCE', 'BCCF', 'BCD0', 'BCD1', 'BCD2', 'BCD3', 'BCD4', 'BCD5', 'BCD6', 'BCD7', 'BCD8', 'BCD9', 'BCDA', 'BCDB', 'BCDC', 'BCDD', 'BCDE', 'BCDF', 'BCE0', 'BCE1', 'BCE2', 'BCE3', 'BCE4', 'BCE5', 'BCE6', 'BCE7', 'BCE8', 'BCE9', 'BCEA', 'BCEB', 'BCEC', 'BCED', 'BCEE', 'BCEF', 'BCF0', 'BCF1', 'BCF2', 'BCF3', 'BCF4', 'BCF5', 'BCF6', 'BCF7', 'BCF8', 'BCF9', 'BCFA', 'BCFB', 'BCFC', 'BCFD', 'BCFE', 'BDA1', 'BDA2', 'BDA3', 'BDA4', 'BDA5', 'BDA6', 'BDA7', 'BDA8', 'BDA9', 'BDAA', 'BDAB', 'BDAC', 'BDAD', 'BDAE', 'BDAF', 'BDB0', 'BDB1', 'BDB2', 'BDB3', 'BDB4', 'BDB5', 'BDB6', 'BDB7', 'BDB8', 'BDB9', 'BDBA', 'BDBB', 'BDBC', 'BDBD', 'BDBE', 'BDBF', 'BDC0', 'BDC1', 'BDC2', 'BDC3', 'BDC4', 'BDC5', 'BDC6', 'BDC7', 'BDC8', 'BDC9', 'BDCA', 'BDCB', 'BDCC', 'BDCD', 'BDCE', 'BDCF', 'BDD0', 'BDD1', 'BDD2', 'BDD3', 'BDD4', 'BDD5', 'BDD6', 'BDD7', 'BDD8', 'BDD9', 'BDDA', 'BDDB', 'BDDC', 'BDDD', 'BDDE', 'BDDF', 'BDE0', 'BDE1', 'BDE2', 'BDE3', 'BDE4', 'BDE5', 'BDE6', 'BDE7', 'BDE8', 'BDE9', 'BDEA', 'BDEB', 'BDEC', 'BDED', 'BDEE', 'BDEF', 'BDF0', 'BDF1', 'BDF2', 'BDF3', 'BDF4', 'BDF5', 'BDF6', 'BDF7', 'BDF8', 'BDF9', 'BDFA', 'BDFB', 'BDFC', 'BDFD', 'BDFE', 'BEA1', 'BEA2', 'BEA3', 'BEA4', 'BEA5', 'BEA6', 'BEA7', 'BEA8', 'BEA9', 'BEAA', 'BEAB', 'BEAC', 'BEAD', 'BEAE', 'BEAF', 'BEB0', 'BEB1', 'BEB2', 'BEB3', 'BEB4', 'BEB5', 'BEB6', 'BEB7', 'BEB8', 'BEB9', 'BEBA', 'BEBB', 'BEBC', 'BEBD', 'BEBE', 'BEBF', 'BEC0', 'BEC1', 'BEC2', 'BEC3', 'BEC4', 'BEC5', 'BEC6', 'BEC7', 'BEC8', 'BEC9', 'BECA', 'BECB', 'BECC', 'BECD', 'BECE', 'BECF', 'BED0', 'BED1', 'BED2', 'BED3', 'BED4', 'BED5', 'BED6', 'BED7', 'BED8', 'BED9', 'BEDA', 'BEDB', 'BEDC', 'BEDD', 'BEDE', 'BEDF', 'BEE0', 'BEE1', 'BEE2', 'BEE3', 'BEE4', 'BEE5', 'BEE6', 'BEE7', 'BEE8', 'BEE9', 'BEEA', 'BEEB', 'BEEC', 'BEED', 'BEEE', 'BEEF', 'BEF0', 'BEF1', 'BEF2', 'BEF3', 'BEF4', 'BEF5', 'BEF6', 'BEF7', 'BEF8', 'BEF9', 'BEFA', 'BEFB', 'BEFC', 'BEFD', 'BEFE', 'BFA1', 'BFA2', 'BFA3', 'BFA4', 'BFA5', 'BFA6', 'BFA7', 'BFA8', 'BFA9', 'BFAA', 'BFAB', 'BFAC', 'BFAD', 'BFAE', 'BFAF', 'BFB0', 'BFB1', 'BFB2', 'BFB3', 'BFB4', 'BFB5', 'BFB6', 'BFB7', 'BFB8', 'BFB9', 'BFBA', 'BFBB', 'BFBC', 'BFBD', 'BFBE', 'BFBF', 'BFC0', 'BFC1', 'BFC2', 'BFC3', 'BFC4', 'BFC5', 'BFC6', 'BFC7', 'BFC8', 'BFC9', 'BFCA', 'BFCB', 'BFCC', 'BFCD', 'BFCE', 'BFCF', 'BFD0', 'BFD1', 'BFD2', 'BFD3', 'BFD4', 'BFD5', 'BFD6', 'BFD7', 'BFD8', 'BFD9', 'BFDA', 'BFDB', 'BFDC', 'BFDD', 'BFDE', 'BFDF', 'BFE0', 'BFE1', 'BFE2', 'BFE3', 'BFE4', 'BFE5', 'BFE6', 'BFE7', 'BFE8', 'BFE9', 'BFEA', 'BFEB', 'BFEC', 'BFED', 'BFEE', 'BFEF', 'BFF0', 'BFF1', 'BFF2', 'BFF3', 'BFF4', 'BFF5', 'BFF6', 'BFF7', 'BFF8', 'BFF9', 'BFFA', 'BFFB', 'BFFC', 'BFFD', 'BFFE', 'C0A1', 'C0A2', 'C0A3', 'C0A4', 'C0A5', 'C0A6', 'C0A7', 'C0A8', 'C0A9', 'C0AA', 'C0AB', 'C0AC', 'C0AD', 'C0AE', 'C0AF', 'C0B0', 'C0B1', 'C0B2', 'C0B3', 'C0B4', 'C0B5', 'C0B6', 'C0B7', 'C0B8', 'C0B9', 'C0BA', 'C0BB', 'C0BC', 'C0BD', 'C0BE', 'C0BF', 'C0C0', 'C0C1', 'C0C2', 'C0C3', 'C0C4', 'C0C5', 'C0C6', 'C0C7', 'C0C8', 'C0C9', 'C0CA', 'C0CB', 'C0CC', 'C0CD', 'C0CE', 'C0CF', 'C0D0', 'C0D1', 'C0D2', 'C0D3', 'C0D4', 'C0D5', 'C0D6', 'C0D7', 'C0D8', 'C0D9', 'C0DA', 'C0DB', 'C0DC', 'C0DD', 'C0DE', 'C0DF', 'C0E0', 'C0E1', 'C0E2', 'C0E3', 'C0E4', 'C0E5', 'C0E6', 'C0E7', 'C0E8', 'C0E9', 'C0EA', 'C0EB', 'C0EC', 'C0ED', 'C0EE', 'C0EF', 'C0F0', 'C0F1', 'C0F2', 'C0F3', 'C0F4', 'C0F5', 'C0F6', 'C0F7', 'C0F8', 'C0F9', 'C0FA', 'C0FB', 'C0FC', 'C0FD', 'C0FE', 'C1A1', 'C1A2', 'C1A3', 'C1A4', 'C1A5', 'C1A6', 'C1A7', 'C1A8', 'C1A9', 'C1AA', 'C1AB', 'C1AC', 'C1AD', 'C1AE', 'C1AF', 'C1B0', 'C1B1', 'C1B2', 'C1B3', 'C1B4', 'C1B5', 'C1B6', 'C1B7', 'C1B8', 'C1B9', 'C1BA', 'C1BB', 'C1BC', 'C1BD', 'C1BE', 'C1BF', 'C1C0', 'C1C1', 'C1C2', 'C1C3', 'C1C4', 'C1C5', 'C1C6', 'C1C7', 'C1C8', 'C1C9', 'C1CA', 'C1CB', 'C1CC', 'C1CD', 'C1CE', 'C1CF', 'C1D0', 'C1D1', 'C1D2', 'C1D3', 'C1D4', 'C1D5', 'C1D6', 'C1D7', 'C1D8', 'C1D9', 'C1DA', 'C1DB', 'C1DC', 'C1DD', 'C1DE', 'C1DF', 'C1E0', 'C1E1', 'C1E2', 'C1E3', 'C1E4', 'C1E5', 'C1E6', 'C1E7', 'C1E8', 'C1E9', 'C1EA', 'C1EB', 'C1EC', 'C1ED', 'C1EE', 'C1EF', 'C1F0', 'C1F1', 'C1F2', 'C1F3', 'C1F4', 'C1F5', 'C1F6', 'C1F7', 'C1F8', 'C1F9', 'C1FA', 'C1FB', 'C1FC', 'C1FD', 'C1FE', 'C2A1', 'C2A2', 'C2A3', 'C2A4', 'C2A5', 'C2A6', 'C2A7', 'C2A8', 'C2A9', 'C2AA', 'C2AB', 'C2AC', 'C2AD', 'C2AE', 'C2AF', 'C2B0', 'C2B1', 'C2B2', 'C2B3', 'C2B4', 'C2B5', 'C2B6', 'C2B7', 'C2B8', 'C2B9', 'C2BA', 'C2BB', 'C2BC', 'C2BD', 'C2BE', 'C2BF', 'C2C0', 'C2C1', 'C2C2', 'C2C3', 'C2C4', 'C2C5', 'C2C6', 'C2C7', 'C2C8', 'C2C9', 'C2CA', 'C2CB', 'C2CC', 'C2CD', 'C2CE', 'C2CF', 'C2D0', 'C2D1', 'C2D2', 'C2D3', 'C2D4', 'C2D5', 'C2D6', 'C2D7', 'C2D8', 'C2D9', 'C2DA', 'C2DB', 'C2DC', 'C2DD', 'C2DE', 'C2DF', 'C2E0', 'C2E1', 'C2E2', 'C2E3', 'C2E4', 'C2E5', 'C2E6', 'C2E7', 'C2E8', 'C2E9', 'C2EA', 'C2EB', 'C2EC', 'C2ED', 'C2EE', 'C2EF', 'C2F0', 'C2F1', 'C2F2', 'C2F3', 'C2F4', 'C2F5', 'C2F6', 'C2F7', 'C2F8', 'C2F9', 'C2FA', 'C2FB', 'C2FC', 'C2FD', 'C2FE', 'C3A1', 'C3A2', 'C3A3', 'C3A4', 'C3A5', 'C3A6', 'C3A7', 'C3A8', 'C3A9', 'C3AA', 'C3AB', 'C3AC', 'C3AD', 'C3AE', 'C3AF', 'C3B0', 'C3B1', 'C3B2', 'C3B3', 'C3B4', 'C3B5', 'C3B6', 'C3B7', 'C3B8', 'C3B9', 'C3BA', 'C3BB', 'C3BC', 'C3BD', 'C3BE', 'C3BF', 'C3C0', 'C3C1', 'C3C2', 'C3C3', 'C3C4', 'C3C5', 'C3C6', 'C3C7', 'C3C8', 'C3C9', 'C3CA', 'C3CB', 'C3CC', 'C3CD', 'C3CE', 'C3CF', 'C3D0', 'C3D1', 'C3D2', 'C3D3', 'C3D4', 'C3D5', 'C3D6', 'C3D7', 'C3D8', 'C3D9', 'C3DA', 'C3DB', 'C3DC', 'C3DD', 'C3DE', 'C3DF', 'C3E0', 'C3E1', 'C3E2', 'C3E3', 'C3E4', 'C3E5', 'C3E6', 'C3E7', 'C3E8', 'C3E9', 'C3EA', 'C3EB', 'C3EC', 'C3ED', 'C3EE', 'C3EF', 'C3F0', 'C3F1', 'C3F2', 'C3F3', 'C3F4', 'C3F5', 'C3F6', 'C3F7', 'C3F8', 'C3F9', 'C3FA', 'C3FB', 'C3FC', 'C3FD', 'C3FE', 'C4A1', 'C4A2', 'C4A3', 'C4A4', 'C4A5', 'C4A6', 'C4A7', 'C4A8', 'C4A9', 'C4AA', 'C4AB', 'C4AC', 'C4AD', 'C4AE', 'C4AF', 'C4B0', 'C4B1', 'C4B2', 'C4B3', 'C4B4', 'C4B5', 'C4B6', 'C4B7', 'C4B8', 'C4B9', 'C4BA', 'C4BB', 'C4BC', 'C4BD', 'C4BE', 'C4BF', 'C4C0', 'C4C1', 'C4C2', 'C4C3', 'C4C4', 'C4C5', 'C4C6', 'C4C7', 'C4C8', 'C4C9', 'C4CA', 'C4CB', 'C4CC', 'C4CD', 'C4CE', 'C4CF', 'C4D0', 'C4D1', 'C4D2', 'C4D3', 'C4D4', 'C4D5', 'C4D6', 'C4D7', 'C4D8', 'C4D9', 'C4DA', 'C4DB', 'C4DC', 'C4DD', 'C4DE', 'C4DF', 'C4E0', 'C4E1', 'C4E2', 'C4E3', 'C4E4', 'C4E5', 'C4E6', 'C4E7', 'C4E8', 'C4E9', 'C4EA', 'C4EB', 'C4EC', 'C4ED', 'C4EE', 'C4EF', 'C4F0', 'C4F1', 'C4F2', 'C4F3', 'C4F4', 'C4F5', 'C4F6', 'C4F7', 'C4F8', 'C4F9', 'C4FA', 'C4FB', 'C4FC', 'C4FD', 'C4FE', 'C5A1', 'C5A2', 'C5A3', 'C5A4', 'C5A5', 'C5A6', 'C5A7', 'C5A8', 'C5A9', 'C5AA', 'C5AB', 'C5AC', 'C5AD', 'C5AE', 'C5AF', 'C5B0', 'C5B1', 'C5B2', 'C5B3', 'C5B4', 'C5B5', 'C5B6', 'C5B7', 'C5B8', 'C5B9', 'C5BA', 'C5BB', 'C5BC', 'C5BD', 'C5BE', 'C5BF', 'C5C0', 'C5C1', 'C5C2', 'C5C3', 'C5C4', 'C5C5', 'C5C6', 'C5C7', 'C5C8', 'C5C9', 'C5CA', 'C5CB', 'C5CC', 'C5CD', 'C5CE', 'C5CF', 'C5D0', 'C5D1', 'C5D2', 'C5D3', 'C5D4', 'C5D5', 'C5D6', 'C5D7', 'C5D8', 'C5D9', 'C5DA', 'C5DB', 'C5DC', 'C5DD', 'C5DE', 'C5DF', 'C5E0', 'C5E1', 'C5E2', 'C5E3', 'C5E4', 'C5E5', 'C5E6', 'C5E7', 'C5E8', 'C5E9', 'C5EA', 'C5EB', 'C5EC', 'C5ED', 'C5EE', 'C5EF', 'C5F0', 'C5F1', 'C5F2', 'C5F3', 'C5F4', 'C5F5', 'C5F6', 'C5F7', 'C5F8', 'C5F9', 'C5FA', 'C5FB', 'C5FC', 'C5FD', 'C5FE', 'C6A1', 'C6A2', 'C6A3', 'C6A4', 'C6A5', 'C6A6', 'C6A7', 'C6A8', 'C6A9', 'C6AA', 'C6AB', 'C6AC', 'C6AD', 'C6AE', 'C6AF', 'C6B0', 'C6B1', 'C6B2', 'C6B3', 'C6B4', 'C6B5', 'C6B6', 'C6B7', 'C6B8', 'C6B9', 'C6BA', 'C6BB', 'C6BC', 'C6BD', 'C6BE', 'C6BF', 'C6C0', 'C6C1', 'C6C2', 'C6C3', 'C6C4', 'C6C5', 'C6C6', 'C6C7', 'C6C8', 'C6C9', 'C6CA', 'C6CB', 'C6CC', 'C6CD', 'C6CE', 'C6CF', 'C6D0', 'C6D1', 'C6D2', 'C6D3', 'C6D4', 'C6D5', 'C6D6', 'C6D7', 'C6D8', 'C6D9', 'C6DA', 'C6DB', 'C6DC', 'C6DD', 'C6DE', 'C6DF', 'C6E0', 'C6E1', 'C6E2', 'C6E3', 'C6E4', 'C6E5', 'C6E6', 'C6E7', 'C6E8', 'C6E9', 'C6EA', 'C6EB', 'C6EC', 'C6ED', 'C6EE', 'C6EF', 'C6F0', 'C6F1', 'C6F2', 'C6F3', 'C6F4', 'C6F5', 'C6F6', 'C6F7', 'C6F8', 'C6F9', 'C6FA', 'C6FB', 'C6FC', 'C6FD', 'C6FE', 'C7A1', 'C7A2', 'C7A3', 'C7A4', 'C7A5', 'C7A6', 'C7A7', 'C7A8', 'C7A9', 'C7AA', 'C7AB', 'C7AC', 'C7AD', 'C7AE', 'C7AF', 'C7B0', 'C7B1', 'C7B2', 'C7B3', 'C7B4', 'C7B5', 'C7B6', 'C7B7', 'C7B8', 'C7B9', 'C7BA', 'C7BB', 'C7BC', 'C7BD', 'C7BE', 'C7BF', 'C7C0', 'C7C1', 'C7C2', 'C7C3', 'C7C4', 'C7C5', 'C7C6', 'C7C7', 'C7C8', 'C7C9', 'C7CA', 'C7CB', 'C7CC', 'C7CD', 'C7CE', 'C7CF', 'C7D0', 'C7D1', 'C7D2', 'C7D3', 'C7D4', 'C7D5', 'C7D6', 'C7D7', 'C7D8', 'C7D9', 'C7DA', 'C7DB', 'C7DC', 'C7DD', 'C7DE', 'C7DF', 'C7E0', 'C7E1', 'C7E2', 'C7E3', 'C7E4', 'C7E5', 'C7E6', 'C7E7', 'C7E8', 'C7E9', 'C7EA', 'C7EB', 'C7EC', 'C7ED', 'C7EE', 'C7EF', 'C7F0', 'C7F1', 'C7F2', 'C7F3', 'C7F4', 'C7F5', 'C7F6', 'C7F7', 'C7F8', 'C7F9', 'C7FA', 'C7FB', 'C7FC', 'C7FD', 'C7FE', 'C8A1', 'C8A2', 'C8A3', 'C8A4', 'C8A5', 'C8A6', 'C8A7', 'C8A8', 'C8A9', 'C8AA', 'C8AB', 'C8AC', 'C8AD', 'C8AE', 'C8AF', 'C8B0', 'C8B1', 'C8B2', 'C8B3', 'C8B4', 'C8B5', 'C8B6', 'C8B7', 'C8B8', 'C8B9', 'C8BA', 'C8BB', 'C8BC', 'C8BD', 'C8BE', 'C8BF', 'C8C0', 'C8C1', 'C8C2', 'C8C3', 'C8C4', 'C8C5', 'C8C6', 'C8C7', 'C8C8', 'C8C9', 'C8CA', 'C8CB', 'C8CC', 'C8CD', 'C8CE', 'C8CF', 'C8D0', 'C8D1', 'C8D2', 'C8D3', 'C8D4', 'C8D5', 'C8D6', 'C8D7', 'C8D8', 'C8D9', 'C8DA', 'C8DB', 'C8DC', 'C8DD', 'C8DE', 'C8DF', 'C8E0', 'C8E1', 'C8E2', 'C8E3', 'C8E4', 'C8E5', 'C8E6', 'C8E7', 'C8E8', 'C8E9', 'C8EA', 'C8EB', 'C8EC', 'C8ED', 'C8EE', 'C8EF', 'C8F0', 'C8F1', 'C8F2', 'C8F3', 'C8F4', 'C8F5', 'C8F6', 'C8F7', 'C8F8', 'C8F9', 'C8FA', 'C8FB', 'C8FC', 'C8FD', 'C8FE', 'C9A1', 'C9A2', 'C9A3', 'C9A4', 'C9A5', 'C9A6', 'C9A7', 'C9A8', 'C9A9', 'C9AA', 'C9AB', 'C9AC', 'C9AD', 'C9AE', 'C9AF', 'C9B0', 'C9B1', 'C9B2', 'C9B3', 'C9B4', 'C9B5', 'C9B6', 'C9B7', 'C9B8', 'C9B9', 'C9BA', 'C9BB', 'C9BC', 'C9BD', 'C9BE', 'C9BF', 'C9C0', 'C9C1', 'C9C2', 'C9C3', 'C9C4', 'C9C5', 'C9C6', 'C9C7', 'C9C8', 'C9C9', 'C9CA', 'C9CB', 'C9CC', 'C9CD', 'C9CE', 'C9CF', 'C9D0', 'C9D1', 'C9D2', 'C9D3', 'C9D4', 'C9D5', 'C9D6', 'C9D7', 'C9D8', 'C9D9', 'C9DA', 'C9DB', 'C9DC', 'C9DD', 'C9DE', 'C9DF', 'C9E0', 'C9E1', 'C9E2', 'C9E3', 'C9E4', 'C9E5', 'C9E6', 'C9E7', 'C9E8', 'C9E9', 'C9EA', 'C9EB', 'C9EC', 'C9ED', 'C9EE', 'C9EF', 'C9F0', 'C9F1', 'C9F2', 'C9F3', 'C9F4', 'C9F5', 'C9F6', 'C9F7', 'C9F8', 'C9F9', 'C9FA', 'C9FB', 'C9FC', 'C9FD', 'C9FE', 'CAA1', 'CAA2', 'CAA3', 'CAA4', 'CAA5', 'CAA6', 'CAA7', 'CAA8', 'CAA9', 'CAAA', 'CAAB', 'CAAC', 'CAAD', 'CAAE', 'CAAF', 'CAB0', 'CAB1', 'CAB2', 'CAB3', 'CAB4', 'CAB5', 'CAB6', 'CAB7', 'CAB8', 'CAB9', 'CABA', 'CABB', 'CABC', 'CABD', 'CABE', 'CABF', 'CAC0', 'CAC1', 'CAC2', 'CAC3', 'CAC4', 'CAC5', 'CAC6', 'CAC7', 'CAC8', 'CAC9', 'CACA', 'CACB', 'CACC', 'CACD', 'CACE', 'CACF', 'CAD0', 'CAD1', 'CAD2', 'CAD3', 'CAD4', 'CAD5', 'CAD6', 'CAD7', 'CAD8', 'CAD9', 'CADA', 'CADB', 'CADC', 'CADD', 'CADE', 'CADF', 'CAE0', 'CAE1', 'CAE2', 'CAE3', 'CAE4', 'CAE5', 'CAE6', 'CAE7', 'CAE8', 'CAE9', 'CAEA', 'CAEB', 'CAEC', 'CAED', 'CAEE', 'CAEF', 'CAF0', 'CAF1', 'CAF2', 'CAF3', 'CAF4', 'CAF5', 'CAF6', 'CAF7', 'CAF8', 'CAF9', 'CAFA', 'CAFB', 'CAFC', 'CAFD', 'CAFE', 'CBA1', 'CBA2', 'CBA3', 'CBA4', 'CBA5', 'CBA6', 'CBA7', 'CBA8', 'CBA9', 'CBAA', 'CBAB', 'CBAC', 'CBAD', 'CBAE', 'CBAF', 'CBB0', 'CBB1', 'CBB2', 'CBB3', 'CBB4', 'CBB5', 'CBB6', 'CBB7', 'CBB8', 'CBB9', 'CBBA', 'CBBB', 'CBBC', 'CBBD', 'CBBE', 'CBBF', 'CBC0', 'CBC1', 'CBC2', 'CBC3', 'CBC4', 'CBC5', 'CBC6', 'CBC7', 'CBC8', 'CBC9', 'CBCA', 'CBCB', 'CBCC', 'CBCD', 'CBCE', 'CBCF', 'CBD0', 'CBD1', 'CBD2', 'CBD3', 'CBD4', 'CBD5', 'CBD6', 'CBD7', 'CBD8', 'CBD9', 'CBDA', 'CBDB', 'CBDC', 'CBDD', 'CBDE', 'CBDF', 'CBE0', 'CBE1', 'CBE2', 'CBE3', 'CBE4', 'CBE5', 'CBE6', 'CBE7', 'CBE8', 'CBE9', 'CBEA', 'CBEB', 'CBEC', 'CBED', 'CBEE', 'CBEF', 'CBF0', 'CBF1', 'CBF2', 'CBF3', 'CBF4', 'CBF5', 'CBF6', 'CBF7', 'CBF8', 'CBF9', 'CBFA', 'CBFB', 'CBFC', 'CBFD', 'CBFE', 'CCA1', 'CCA2', 'CCA3', 'CCA4', 'CCA5', 'CCA6', 'CCA7', 'CCA8', 'CCA9', 'CCAA', 'CCAB', 'CCAC', 'CCAD', 'CCAE', 'CCAF', 'CCB0', 'CCB1', 'CCB2', 'CCB3', 'CCB4', 'CCB5', 'CCB6', 'CCB7', 'CCB8', 'CCB9', 'CCBA', 'CCBB', 'CCBC', 'CCBD', 'CCBE', 'CCBF', 'CCC0', 'CCC1', 'CCC2', 'CCC3', 'CCC4', 'CCC5', 'CCC6', 'CCC7', 'CCC8', 'CCC9', 'CCCA', 'CCCB', 'CCCC', 'CCCD', 'CCCE', 'CCCF', 'CCD0', 'CCD1', 'CCD2', 'CCD3', 'CCD4', 'CCD5', 'CCD6', 'CCD7', 'CCD8', 'CCD9', 'CCDA', 'CCDB', 'CCDC', 'CCDD', 'CCDE', 'CCDF', 'CCE0', 'CCE1', 'CCE2', 'CCE3', 'CCE4', 'CCE5', 'CCE6', 'CCE7', 'CCE8', 'CCE9', 'CCEA', 'CCEB', 'CCEC', 'CCED', 'CCEE', 'CCEF', 'CCF0', 'CCF1', 'CCF2', 'CCF3', 'CCF4', 'CCF5', 'CCF6', 'CCF7', 'CCF8', 'CCF9', 'CCFA', 'CCFB', 'CCFC', 'CCFD', 'CCFE', 'CDA1', 'CDA2', 'CDA3', 'CDA4', 'CDA5', 'CDA6', 'CDA7', 'CDA8', 'CDA9', 'CDAA', 'CDAB', 'CDAC', 'CDAD', 'CDAE', 'CDAF', 'CDB0', 'CDB1', 'CDB2', 'CDB3', 'CDB4', 'CDB5', 'CDB6', 'CDB7', 'CDB8', 'CDB9', 'CDBA', 'CDBB', 'CDBC', 'CDBD', 'CDBE', 'CDBF', 'CDC0', 'CDC1', 'CDC2', 'CDC3', 'CDC4', 'CDC5', 'CDC6', 'CDC7', 'CDC8', 'CDC9', 'CDCA', 'CDCB', 'CDCC', 'CDCD', 'CDCE', 'CDCF', 'CDD0', 'CDD1', 'CDD2', 'CDD3', 'CDD4', 'CDD5', 'CDD6', 'CDD7', 'CDD8', 'CDD9', 'CDDA', 'CDDB', 'CDDC', 'CDDD', 'CDDE', 'CDDF', 'CDE0', 'CDE1', 'CDE2', 'CDE3', 'CDE4', 'CDE5', 'CDE6', 'CDE7', 'CDE8', 'CDE9', 'CDEA', 'CDEB', 'CDEC', 'CDED', 'CDEE', 'CDEF', 'CDF0', 'CDF1', 'CDF2', 'CDF3', 'CDF4', 'CDF5', 'CDF6', 'CDF7', 'CDF8', 'CDF9', 'CDFA', 'CDFB', 'CDFC', 'CDFD', 'CDFE', 'CEA1', 'CEA2', 'CEA3', 'CEA4', 'CEA5', 'CEA6', 'CEA7', 'CEA8', 'CEA9', 'CEAA', 'CEAB', 'CEAC', 'CEAD', 'CEAE', 'CEAF', 'CEB0', 'CEB1', 'CEB2', 'CEB3', 'CEB4', 'CEB5', 'CEB6', 'CEB7', 'CEB8', 'CEB9', 'CEBA', 'CEBB', 'CEBC', 'CEBD', 'CEBE', 'CEBF', 'CEC0', 'CEC1', 'CEC2', 'CEC3', 'CEC4', 'CEC5', 'CEC6', 'CEC7', 'CEC8', 'CEC9', 'CECA', 'CECB', 'CECC', 'CECD', 'CECE', 'CECF', 'CED0', 'CED1', 'CED2', 'CED3', 'CED4', 'CED5', 'CED6', 'CED7', 'CED8', 'CED9', 'CEDA', 'CEDB', 'CEDC', 'CEDD', 'CEDE', 'CEDF', 'CEE0', 'CEE1', 'CEE2', 'CEE3', 'CEE4', 'CEE5', 'CEE6', 'CEE7', 'CEE8', 'CEE9', 'CEEA', 'CEEB', 'CEEC', 'CEED', 'CEEE', 'CEEF', 'CEF0', 'CEF1', 'CEF2', 'CEF3', 'CEF4', 'CEF5', 'CEF6', 'CEF7', 'CEF8', 'CEF9', 'CEFA', 'CEFB', 'CEFC', 'CEFD', 'CEFE', 'CFA1', 'CFA2', 'CFA3', 'CFA4', 'CFA5', 'CFA6', 'CFA7', 'CFA8', 'CFA9', 'CFAA', 'CFAB', 'CFAC', 'CFAD', 'CFAE', 'CFAF', 'CFB0', 'CFB1', 'CFB2', 'CFB3', 'CFB4', 'CFB5', 'CFB6', 'CFB7', 'CFB8', 'CFB9', 'CFBA', 'CFBB', 'CFBC', 'CFBD', 'CFBE', 'CFBF', 'CFC0', 'CFC1', 'CFC2', 'CFC3', 'CFC4', 'CFC5', 'CFC6', 'CFC7', 'CFC8', 'CFC9', 'CFCA', 'CFCB', 'CFCC', 'CFCD', 'CFCE', 'CFCF', 'CFD0', 'CFD1', 'CFD2', 'CFD3', 'CFD4', 'CFD5', 'CFD6', 'CFD7', 'CFD8', 'CFD9', 'CFDA', 'CFDB', 'CFDC', 'CFDD', 'CFDE', 'CFDF', 'CFE0', 'CFE1', 'CFE2', 'CFE3', 'CFE4', 'CFE5', 'CFE6', 'CFE7', 'CFE8', 'CFE9', 'CFEA', 'CFEB', 'CFEC', 'CFED', 'CFEE', 'CFEF', 'CFF0', 'CFF1', 'CFF2', 'CFF3', 'CFF4', 'CFF5', 'CFF6', 'CFF7', 'CFF8', 'CFF9', 'CFFA', 'CFFB', 'CFFC', 'CFFD', 'CFFE', 'D0A1', 'D0A2', 'D0A3', 'D0A4', 'D0A5', 'D0A6', 'D0A7', 'D0A8', 'D0A9', 'D0AA', 'D0AB', 'D0AC', 'D0AD', 'D0AE', 'D0AF', 'D0B0', 'D0B1', 'D0B2', 'D0B3', 'D0B4', 'D0B5', 'D0B6', 'D0B7', 'D0B8', 'D0B9', 'D0BA', 'D0BB', 'D0BC', 'D0BD', 'D0BE', 'D0BF', 'D0C0', 'D0C1', 'D0C2', 'D0C3', 'D0C4', 'D0C5', 'D0C6', 'D0C7', 'D0C8', 'D0C9', 'D0CA', 'D0CB', 'D0CC', 'D0CD', 'D0CE', 'D0CF', 'D0D0', 'D0D1', 'D0D2', 'D0D3', 'D0D4', 'D0D5', 'D0D6', 'D0D7', 'D0D8', 'D0D9', 'D0DA', 'D0DB', 'D0DC', 'D0DD', 'D0DE', 'D0DF', 'D0E0', 'D0E1', 'D0E2', 'D0E3', 'D0E4', 'D0E5', 'D0E6', 'D0E7', 'D0E8', 'D0E9', 'D0EA', 'D0EB', 'D0EC', 'D0ED', 'D0EE', 'D0EF', 'D0F0', 'D0F1', 'D0F2', 'D0F3', 'D0F4', 'D0F5', 'D0F6', 'D0F7', 'D0F8', 'D0F9', 'D0FA', 'D0FB', 'D0FC', 'D0FD', 'D0FE', 'D1A1', 'D1A2', 'D1A3', 'D1A4', 'D1A5', 'D1A6', 'D1A7', 'D1A8', 'D1A9', 'D1AA', 'D1AB', 'D1AC', 'D1AD', 'D1AE', 'D1AF', 'D1B0', 'D1B1', 'D1B2', 'D1B3', 'D1B4', 'D1B5', 'D1B6', 'D1B7', 'D1B8', 'D1B9', 'D1BA', 'D1BB', 'D1BC', 'D1BD', 'D1BE', 'D1BF', 'D1C0', 'D1C1', 'D1C2', 'D1C3', 'D1C4', 'D1C5', 'D1C6', 'D1C7', 'D1C8', 'D1C9', 'D1CA', 'D1CB', 'D1CC', 'D1CD', 'D1CE', 'D1CF', 'D1D0', 'D1D1', 'D1D2', 'D1D3', 'D1D4', 'D1D5', 'D1D6', 'D1D7', 'D1D8', 'D1D9', 'D1DA', 'D1DB', 'D1DC', 'D1DD', 'D1DE', 'D1DF', 'D1E0', 'D1E1', 'D1E2', 'D1E3', 'D1E4', 'D1E5', 'D1E6', 'D1E7', 'D1E8', 'D1E9', 'D1EA', 'D1EB', 'D1EC', 'D1ED', 'D1EE', 'D1EF', 'D1F0', 'D1F1', 'D1F2', 'D1F3', 'D1F4', 'D1F5', 'D1F6', 'D1F7', 'D1F8', 'D1F9', 'D1FA', 'D1FB', 'D1FC', 'D1FD', 'D1FE', 'D2A1', 'D2A2', 'D2A3', 'D2A4', 'D2A5', 'D2A6', 'D2A7', 'D2A8', 'D2A9', 'D2AA', 'D2AB', 'D2AC', 'D2AD', 'D2AE', 'D2AF', 'D2B0', 'D2B1', 'D2B2', 'D2B3', 'D2B4', 'D2B5', 'D2B6', 'D2B7', 'D2B8', 'D2B9', 'D2BA', 'D2BB', 'D2BC', 'D2BD', 'D2BE', 'D2BF', 'D2C0', 'D2C1', 'D2C2', 'D2C3', 'D2C4', 'D2C5', 'D2C6', 'D2C7', 'D2C8', 'D2C9', 'D2CA', 'D2CB', 'D2CC', 'D2CD', 'D2CE', 'D2CF', 'D2D0', 'D2D1', 'D2D2', 'D2D3', 'D2D4', 'D2D5', 'D2D6', 'D2D7', 'D2D8', 'D2D9', 'D2DA', 'D2DB', 'D2DC', 'D2DD', 'D2DE', 'D2DF', 'D2E0', 'D2E1', 'D2E2', 'D2E3', 'D2E4', 'D2E5', 'D2E6', 'D2E7', 'D2E8', 'D2E9', 'D2EA', 'D2EB', 'D2EC', 'D2ED', 'D2EE', 'D2EF', 'D2F0', 'D2F1', 'D2F2', 'D2F3', 'D2F4', 'D2F5', 'D2F6', 'D2F7', 'D2F8', 'D2F9', 'D2FA', 'D2FB', 'D2FC', 'D2FD', 'D2FE', 'D3A1', 'D3A2', 'D3A3', 'D3A4', 'D3A5', 'D3A6', 'D3A7', 'D3A8', 'D3A9', 'D3AA', 'D3AB', 'D3AC', 'D3AD', 'D3AE', 'D3AF', 'D3B0', 'D3B1', 'D3B2', 'D3B3', 'D3B4', 'D3B5', 'D3B6', 'D3B7', 'D3B8', 'D3B9', 'D3BA', 'D3BB', 'D3BC', 'D3BD', 'D3BE', 'D3BF', 'D3C0', 'D3C1', 'D3C2', 'D3C3', 'D3C4', 'D3C5', 'D3C6', 'D3C7', 'D3C8', 'D3C9', 'D3CA', 'D3CB', 'D3CC', 'D3CD', 'D3CE', 'D3CF', 'D3D0', 'D3D1', 'D3D2', 'D3D3', 'D3D4', 'D3D5', 'D3D6', 'D3D7', 'D3D8', 'D3D9', 'D3DA', 'D3DB', 'D3DC', 'D3DD', 'D3DE', 'D3DF', 'D3E0', 'D3E1', 'D3E2', 'D3E3', 'D3E4', 'D3E5', 'D3E6', 'D3E7', 'D3E8', 'D3E9', 'D3EA', 'D3EB', 'D3EC', 'D3ED', 'D3EE', 'D3EF', 'D3F0', 'D3F1', 'D3F2', 'D3F3', 'D3F4', 'D3F5', 'D3F6', 'D3F7', 'D3F8', 'D3F9', 'D3FA', 'D3FB', 'D3FC', 'D3FD', 'D3FE', 'D4A1', 'D4A2', 'D4A3', 'D4A4', 'D4A5', 'D4A6', 'D4A7', 'D4A8', 'D4A9', 'D4AA', 'D4AB', 'D4AC', 'D4AD', 'D4AE', 'D4AF', 'D4B0', 'D4B1', 'D4B2', 'D4B3', 'D4B4', 'D4B5', 'D4B6', 'D4B7', 'D4B8', 'D4B9', 'D4BA', 'D4BB', 'D4BC', 'D4BD', 'D4BE', 'D4BF', 'D4C0', 'D4C1', 'D4C2', 'D4C3', 'D4C4', 'D4C5', 'D4C6', 'D4C7', 'D4C8', 'D4C9', 'D4CA', 'D4CB', 'D4CC', 'D4CD', 'D4CE', 'D4CF', 'D4D0', 'D4D1', 'D4D2', 'D4D3', 'D4D4', 'D4D5', 'D4D6', 'D4D7', 'D4D8', 'D4D9', 'D4DA', 'D4DB', 'D4DC', 'D4DD', 'D4DE', 'D4DF', 'D4E0', 'D4E1', 'D4E2', 'D4E3', 'D4E4', 'D4E5', 'D4E6', 'D4E7', 'D4E8', 'D4E9', 'D4EA', 'D4EB', 'D4EC', 'D4ED', 'D4EE', 'D4EF', 'D4F0', 'D4F1', 'D4F2', 'D4F3', 'D4F4', 'D4F5', 'D4F6', 'D4F7', 'D4F8', 'D4F9', 'D4FA', 'D4FB', 'D4FC', 'D4FD', 'D4FE', 'D5A1', 'D5A2', 'D5A3', 'D5A4', 'D5A5', 'D5A6', 'D5A7', 'D5A8', 'D5A9', 'D5AA', 'D5AB', 'D5AC', 'D5AD', 'D5AE', 'D5AF', 'D5B0', 'D5B1', 'D5B2', 'D5B3', 'D5B4', 'D5B5', 'D5B6', 'D5B7', 'D5B8', 'D5B9', 'D5BA', 'D5BB', 'D5BC', 'D5BD', 'D5BE', 'D5BF', 'D5C0', 'D5C1', 'D5C2', 'D5C3', 'D5C4', 'D5C5', 'D5C6', 'D5C7', 'D5C8', 'D5C9', 'D5CA', 'D5CB', 'D5CC', 'D5CD', 'D5CE', 'D5CF', 'D5D0', 'D5D1', 'D5D2', 'D5D3', 'D5D4', 'D5D5', 'D5D6', 'D5D7', 'D5D8', 'D5D9', 'D5DA', 'D5DB', 'D5DC', 'D5DD', 'D5DE', 'D5DF', 'D5E0', 'D5E1', 'D5E2', 'D5E3', 'D5E4', 'D5E5', 'D5E6', 'D5E7', 'D5E8', 'D5E9', 'D5EA', 'D5EB', 'D5EC', 'D5ED', 'D5EE', 'D5EF', 'D5F0', 'D5F1', 'D5F2', 'D5F3', 'D5F4', 'D5F5', 'D5F6', 'D5F7', 'D5F8', 'D5F9', 'D5FA', 'D5FB', 'D5FC', 'D5FD', 'D5FE', 'D6A1', 'D6A2', 'D6A3', 'D6A4', 'D6A5', 'D6A6', 'D6A7', 'D6A8', 'D6A9', 'D6AA', 'D6AB', 'D6AC', 'D6AD', 'D6AE', 'D6AF', 'D6B0', 'D6B1', 'D6B2', 'D6B3', 'D6B4', 'D6B5', 'D6B6', 'D6B7', 'D6B8', 'D6B9', 'D6BA', 'D6BB', 'D6BC', 'D6BD', 'D6BE', 'D6BF', 'D6C0', 'D6C1', 'D6C2', 'D6C3', 'D6C4', 'D6C5', 'D6C6', 'D6C7', 'D6C8', 'D6C9', 'D6CA', 'D6CB', 'D6CC', 'D6CD', 'D6CE', 'D6CF', 'D6D0', 'D6D1', 'D6D2', 'D6D3', 'D6D4', 'D6D5', 'D6D6', 'D6D7', 'D6D8', 'D6D9', 'D6DA', 'D6DB', 'D6DC', 'D6DD', 'D6DE', 'D6DF', 'D6E0', 'D6E1', 'D6E2', 'D6E3', 'D6E4', 'D6E5', 'D6E6', 'D6E7', 'D6E8', 'D6E9', 'D6EA', 'D6EB', 'D6EC', 'D6ED', 'D6EE', 'D6EF', 'D6F0', 'D6F1', 'D6F2', 'D6F3', 'D6F4', 'D6F5', 'D6F6', 'D6F7', 'D6F8', 'D6F9', 'D6FA', 'D6FB', 'D6FC', 'D6FD', 'D6FE', 'D7A1', 'D7A2', 'D7A3', 'D7A4', 'D7A5', 'D7A6', 'D7A7', 'D7A8', 'D7A9', 'D7AA', 'D7AB', 'D7AC', 'D7AD', 'D7AE', 'D7AF', 'D7B0', 'D7B1', 'D7B2', 'D7B3', 'D7B4', 'D7B5', 'D7B6', 'D7B7', 'D7B8', 'D7B9', 'D7BA', 'D7BB', 'D7BC', 'D7BD', 'D7BE', 'D7BF', 'D7C0', 'D7C1', 'D7C2', 'D7C3', 'D7C4', 'D7C5', 'D7C6', 'D7C7', 'D7C8', 'D7C9', 'D7CA', 'D7CB', 'D7CC', 'D7CD', 'D7CE', 'D7CF', 'D7D0', 'D7D1', 'D7D2', 'D7D3', 'D7D4', 'D7D5', 'D7D6', 'D7D7', 'D7D8', 'D7D9', 'D7DA', 'D7DB', 'D7DC', 'D7DD', 'D7DE', 'D7DF', 'D7E0', 'D7E1', 'D7E2', 'D7E3', 'D7E4', 'D7E5', 'D7E6', 'D7E7', 'D7E8', 'D7E9', 'D7EA', 'D7EB', 'D7EC', 'D7ED', 'D7EE', 'D7EF', 'D7F0', 'D7F1', 'D7F2', 'D7F3', 'D7F4', 'D7F5', 'D7F6', 'D7F7', 'D7F8', 'D7F9', 'D8A1', 'D8A2', 'D8A3', 'D8A4', 'D8A5', 'D8A6', 'D8A7', 'D8A8', 'D8A9', 'D8AA', 'D8AB', 'D8AC', 'D8AD', 'D8AE', 'D8AF', 'D8B0', 'D8B1', 'D8B2', 'D8B3', 'D8B4', 'D8B5', 'D8B6', 'D8B7', 'D8B8', 'D8B9', 'D8BA', 'D8BB', 'D8BC', 'D8BD', 'D8BE', 'D8BF', 'D8C0', 'D8C1', 'D8C2', 'D8C3', 'D8C4', 'D8C5', 'D8C6', 'D8C7', 'D8C8', 'D8C9', 'D8CA', 'D8CB', 'D8CC', 'D8CD', 'D8CE', 'D8CF', 'D8D0', 'D8D1', 'D8D2', 'D8D3', 'D8D4', 'D8D5', 'D8D6', 'D8D7', 'D8D8', 'D8D9', 'D8DA', 'D8DB', 'D8DC', 'D8DD', 'D8DE', 'D8DF', 'D8E0', 'D8E1', 'D8E2', 'D8E3', 'D8E4', 'D8E5', 'D8E6', 'D8E7', 'D8E8', 'D8E9', 'D8EA', 'D8EB', 'D8EC', 'D8ED', 'D8EE', 'D8EF', 'D8F0', 'D8F1', 'D8F2', 'D8F3', 'D8F4', 'D8F5', 'D8F6', 'D8F7', 'D8F8', 'D8F9', 'D8FA', 'D8FB', 'D8FC', 'D8FD', 'D8FE', 'D9A1', 'D9A2', 'D9A3', 'D9A4', 'D9A5', 'D9A6', 'D9A7', 'D9A8', 'D9A9', 'D9AA', 'D9AB', 'D9AC', 'D9AD', 'D9AE', 'D9AF', 'D9B0', 'D9B1', 'D9B2', 'D9B3', 'D9B4', 'D9B5', 'D9B6', 'D9B7', 'D9B8', 'D9B9', 'D9BA', 'D9BB', 'D9BC', 'D9BD', 'D9BE', 'D9BF', 'D9C0', 'D9C1', 'D9C2', 'D9C3', 'D9C4', 'D9C5', 'D9C6', 'D9C7', 'D9C8', 'D9C9', 'D9CA', 'D9CB', 'D9CC', 'D9CD', 'D9CE', 'D9CF', 'D9D0', 'D9D1', 'D9D2', 'D9D3', 'D9D4', 'D9D5', 'D9D6', 'D9D7', 'D9D8', 'D9D9', 'D9DA', 'D9DB', 'D9DC', 'D9DD', 'D9DE', 'D9DF', 'D9E0', 'D9E1', 'D9E2', 'D9E3', 'D9E4', 'D9E5', 'D9E6', 'D9E7', 'D9E8', 'D9E9', 'D9EA', 'D9EB', 'D9EC', 'D9ED', 'D9EE', 'D9EF', 'D9F0', 'D9F1', 'D9F2', 'D9F3', 'D9F4', 'D9F5', 'D9F6', 'D9F7', 'D9F8', 'D9F9', 'D9FA', 'D9FB', 'D9FC', 'D9FD', 'D9FE', 'DAA1', 'DAA2', 'DAA3', 'DAA4', 'DAA5', 'DAA6', 'DAA7', 'DAA8', 'DAA9', 'DAAA', 'DAAB', 'DAAC', 'DAAD', 'DAAE', 'DAAF', 'DAB0', 'DAB1', 'DAB2', 'DAB3', 'DAB4', 'DAB5', 'DAB6', 'DAB7', 'DAB8', 'DAB9', 'DABA', 'DABB', 'DABC', 'DABD', 'DABE', 'DABF', 'DAC0', 'DAC1', 'DAC2', 'DAC3', 'DAC4', 'DAC5', 'DAC6', 'DAC7', 'DAC8', 'DAC9', 'DACA', 'DACB', 'DACC', 'DACD', 'DACE', 'DACF', 'DAD0', 'DAD1', 'DAD2', 'DAD3', 'DAD4', 'DAD5', 'DAD6', 'DAD7', 'DAD8', 'DAD9', 'DADA', 'DADB', 'DADC', 'DADD', 'DADE', 'DADF', 'DAE0', 'DAE1', 'DAE2', 'DAE3', 'DAE4', 'DAE5', 'DAE6', 'DAE7', 'DAE8', 'DAE9', 'DAEA', 'DAEB', 'DAEC', 'DAED', 'DAEE', 'DAEF', 'DAF0', 'DAF1', 'DAF2', 'DAF3', 'DAF4', 'DAF5', 'DAF6', 'DAF7', 'DAF8', 'DAF9', 'DAFA', 'DAFB', 'DAFC', 'DAFD', 'DAFE', 'DBA1', 'DBA2', 'DBA3', 'DBA4', 'DBA5', 'DBA6', 'DBA7', 'DBA8', 'DBA9', 'DBAA', 'DBAB', 'DBAC', 'DBAD', 'DBAE', 'DBAF', 'DBB0', 'DBB1', 'DBB2', 'DBB3', 'DBB4', 'DBB5', 'DBB6', 'DBB7', 'DBB8', 'DBB9', 'DBBA', 'DBBB', 'DBBC', 'DBBD', 'DBBE', 'DBBF', 'DBC0', 'DBC1', 'DBC2', 'DBC3', 'DBC4', 'DBC5', 'DBC6', 'DBC7', 'DBC8', 'DBC9', 'DBCA', 'DBCB', 'DBCC', 'DBCD', 'DBCE', 'DBCF', 'DBD0', 'DBD1', 'DBD2', 'DBD3', 'DBD4', 'DBD5', 'DBD6', 'DBD7', 'DBD8', 'DBD9', 'DBDA', 'DBDB', 'DBDC', 'DBDD', 'DBDE', 'DBDF', 'DBE0', 'DBE1', 'DBE2', 'DBE3', 'DBE4', 'DBE5', 'DBE6', 'DBE7', 'DBE8', 'DBE9', 'DBEA', 'DBEB', 'DBEC', 'DBED', 'DBEE', 'DBEF', 'DBF0', 'DBF1', 'DBF2', 'DBF3', 'DBF4', 'DBF5', 'DBF6', 'DBF7', 'DBF8', 'DBF9', 'DBFA', 'DBFB', 'DBFC', 'DBFD', 'DBFE', 'DCA1', 'DCA2', 'DCA3', 'DCA4', 'DCA5', 'DCA6', 'DCA7', 'DCA8', 'DCA9', 'DCAA', 'DCAB', 'DCAC', 'DCAD', 'DCAE', 'DCAF', 'DCB0', 'DCB1', 'DCB2', 'DCB3', 'DCB4', 'DCB5', 'DCB6', 'DCB7', 'DCB8', 'DCB9', 'DCBA', 'DCBB', 'DCBC', 'DCBD', 'DCBE', 'DCBF', 'DCC0', 'DCC1', 'DCC2', 'DCC3', 'DCC4', 'DCC5', 'DCC6', 'DCC7', 'DCC8', 'DCC9', 'DCCA', 'DCCB', 'DCCC', 'DCCD', 'DCCE', 'DCCF', 'DCD0', 'DCD1', 'DCD2', 'DCD3', 'DCD4', 'DCD5', 'DCD6', 'DCD7', 'DCD8', 'DCD9', 'DCDA', 'DCDB', 'DCDC', 'DCDD', 'DCDE', 'DCDF', 'DCE0', 'DCE1', 'DCE2', 'DCE3', 'DCE4', 'DCE5', 'DCE6', 'DCE7', 'DCE8', 'DCE9', 'DCEA', 'DCEB', 'DCEC', 'DCED', 'DCEE', 'DCEF', 'DCF0', 'DCF1', 'DCF2', 'DCF3', 'DCF4', 'DCF5', 'DCF6', 'DCF7', 'DCF8', 'DCF9', 'DCFA', 'DCFB', 'DCFC', 'DCFD', 'DCFE', 'DDA1', 'DDA2', 'DDA3', 'DDA4', 'DDA5', 'DDA6', 'DDA7', 'DDA8', 'DDA9', 'DDAA', 'DDAB', 'DDAC', 'DDAD', 'DDAE', 'DDAF', 'DDB0', 'DDB1', 'DDB2', 'DDB3', 'DDB4', 'DDB5', 'DDB6', 'DDB7', 'DDB8', 'DDB9', 'DDBA', 'DDBB', 'DDBC', 'DDBD', 'DDBE', 'DDBF', 'DDC0', 'DDC1', 'DDC2', 'DDC3', 'DDC4', 'DDC5', 'DDC6', 'DDC7', 'DDC8', 'DDC9', 'DDCA', 'DDCB', 'DDCC', 'DDCD', 'DDCE', 'DDCF', 'DDD0', 'DDD1', 'DDD2', 'DDD3', 'DDD4', 'DDD5', 'DDD6', 'DDD7', 'DDD8', 'DDD9', 'DDDA', 'DDDB', 'DDDC', 'DDDD', 'DDDE', 'DDDF', 'DDE0', 'DDE1', 'DDE2', 'DDE3', 'DDE4', 'DDE5', 'DDE6', 'DDE7', 'DDE8', 'DDE9', 'DDEA', 'DDEB', 'DDEC', 'DDED', 'DDEE', 'DDEF', 'DDF0', 'DDF1', 'DDF2', 'DDF3', 'DDF4', 'DDF5', 'DDF6', 'DDF7', 'DDF8', 'DDF9', 'DDFA', 'DDFB', 'DDFC', 'DDFD', 'DDFE', 'DEA1', 'DEA2', 'DEA3', 'DEA4', 'DEA5', 'DEA6', 'DEA7', 'DEA8', 'DEA9', 'DEAA', 'DEAB', 'DEAC', 'DEAD', 'DEAE', 'DEAF', 'DEB0', 'DEB1', 'DEB2', 'DEB3', 'DEB4', 'DEB5', 'DEB6', 'DEB7', 'DEB8', 'DEB9', 'DEBA', 'DEBB', 'DEBC', 'DEBD', 'DEBE', 'DEBF', 'DEC0', 'DEC1', 'DEC2', 'DEC3', 'DEC4', 'DEC5', 'DEC6', 'DEC7', 'DEC8', 'DEC9', 'DECA', 'DECB', 'DECC', 'DECD', 'DECE', 'DECF', 'DED0', 'DED1', 'DED2', 'DED3', 'DED4', 'DED5', 'DED6', 'DED7', 'DED8', 'DED9', 'DEDA', 'DEDB', 'DEDC', 'DEDD', 'DEDE', 'DEDF', 'DEE0', 'DEE1', 'DEE2', 'DEE3', 'DEE4', 'DEE5', 'DEE6', 'DEE7', 'DEE8', 'DEE9', 'DEEA', 'DEEB', 'DEEC', 'DEED', 'DEEE', 'DEEF', 'DEF0', 'DEF1', 'DEF2', 'DEF3', 'DEF4', 'DEF5', 'DEF6', 'DEF7', 'DEF8', 'DEF9', 'DEFA', 'DEFB', 'DEFC', 'DEFD', 'DEFE', 'DFA1', 'DFA2', 'DFA3', 'DFA4', 'DFA5', 'DFA6', 'DFA7', 'DFA8', 'DFA9', 'DFAA', 'DFAB', 'DFAC', 'DFAD', 'DFAE', 'DFAF', 'DFB0', 'DFB1', 'DFB2', 'DFB3', 'DFB4', 'DFB5', 'DFB6', 'DFB7', 'DFB8', 'DFB9', 'DFBA', 'DFBB', 'DFBC', 'DFBD', 'DFBE', 'DFBF', 'DFC0', 'DFC1', 'DFC2', 'DFC3', 'DFC4', 'DFC5', 'DFC6', 'DFC7', 'DFC8', 'DFC9', 'DFCA', 'DFCB', 'DFCC', 'DFCD', 'DFCE', 'DFCF', 'DFD0', 'DFD1', 'DFD2', 'DFD3', 'DFD4', 'DFD5', 'DFD6', 'DFD7', 'DFD8', 'DFD9', 'DFDA', 'DFDB', 'DFDC', 'DFDD', 'DFDE', 'DFDF', 'DFE0', 'DFE1', 'DFE2', 'DFE3', 'DFE4', 'DFE5', 'DFE6', 'DFE7', 'DFE8', 'DFE9', 'DFEA', 'DFEB', 'DFEC', 'DFED', 'DFEE', 'DFEF', 'DFF0', 'DFF1', 'DFF2', 'DFF3', 'DFF4', 'DFF5', 'DFF6', 'DFF7', 'DFF8', 'DFF9', 'DFFA', 'DFFB', 'DFFC', 'DFFD', 'DFFE', 'E0A1', 'E0A2', 'E0A3', 'E0A4', 'E0A5', 'E0A6', 'E0A7', 'E0A8', 'E0A9', 'E0AA', 'E0AB', 'E0AC', 'E0AD', 'E0AE', 'E0AF', 'E0B0', 'E0B1', 'E0B2', 'E0B3', 'E0B4', 'E0B5', 'E0B6', 'E0B7', 'E0B8', 'E0B9', 'E0BA', 'E0BB', 'E0BC', 'E0BD', 'E0BE', 'E0BF', 'E0C0', 'E0C1', 'E0C2', 'E0C3', 'E0C4', 'E0C5', 'E0C6', 'E0C7', 'E0C8', 'E0C9', 'E0CA', 'E0CB', 'E0CC', 'E0CD', 'E0CE', 'E0CF', 'E0D0', 'E0D1', 'E0D2', 'E0D3', 'E0D4', 'E0D5', 'E0D6', 'E0D7', 'E0D8', 'E0D9', 'E0DA', 'E0DB', 'E0DC', 'E0DD', 'E0DE', 'E0DF', 'E0E0', 'E0E1', 'E0E2', 'E0E3', 'E0E4', 'E0E5', 'E0E6', 'E0E7', 'E0E8', 'E0E9', 'E0EA', 'E0EB', 'E0EC', 'E0ED', 'E0EE', 'E0EF', 'E0F0', 'E0F1', 'E0F2', 'E0F3', 'E0F4', 'E0F5', 'E0F6', 'E0F7', 'E0F8', 'E0F9', 'E0FA', 'E0FB', 'E0FC', 'E0FD', 'E0FE', 'E1A1', 'E1A2', 'E1A3', 'E1A4', 'E1A5', 'E1A6', 'E1A7', 'E1A8', 'E1A9', 'E1AA', 'E1AB', 'E1AC', 'E1AD', 'E1AE', 'E1AF', 'E1B0', 'E1B1', 'E1B2', 'E1B3', 'E1B4', 'E1B5', 'E1B6', 'E1B7', 'E1B8', 'E1B9', 'E1BA', 'E1BB', 'E1BC', 'E1BD', 'E1BE', 'E1BF', 'E1C0', 'E1C1', 'E1C2', 'E1C3', 'E1C4', 'E1C5', 'E1C6', 'E1C7', 'E1C8', 'E1C9', 'E1CA', 'E1CB', 'E1CC', 'E1CD', 'E1CE', 'E1CF', 'E1D0', 'E1D1', 'E1D2', 'E1D3', 'E1D4', 'E1D5', 'E1D6', 'E1D7', 'E1D8', 'E1D9', 'E1DA', 'E1DB', 'E1DC', 'E1DD', 'E1DE', 'E1DF', 'E1E0', 'E1E1', 'E1E2', 'E1E3', 'E1E4', 'E1E5', 'E1E6', 'E1E7', 'E1E8', 'E1E9', 'E1EA', 'E1EB', 'E1EC', 'E1ED', 'E1EE', 'E1EF', 'E1F0', 'E1F1', 'E1F2', 'E1F3', 'E1F4', 'E1F5', 'E1F6', 'E1F7', 'E1F8', 'E1F9', 'E1FA', 'E1FB', 'E1FC', 'E1FD', 'E1FE', 'E2A1', 'E2A2', 'E2A3', 'E2A4', 'E2A5', 'E2A6', 'E2A7', 'E2A8', 'E2A9', 'E2AA', 'E2AB', 'E2AC', 'E2AD', 'E2AE', 'E2AF', 'E2B0', 'E2B1', 'E2B2', 'E2B3', 'E2B4', 'E2B5', 'E2B6', 'E2B7', 'E2B8', 'E2B9', 'E2BA', 'E2BB', 'E2BC', 'E2BD', 'E2BE', 'E2BF', 'E2C0', 'E2C1', 'E2C2', 'E2C3', 'E2C4', 'E2C5', 'E2C6', 'E2C7', 'E2C8', 'E2C9', 'E2CA', 'E2CB', 'E2CC', 'E2CD', 'E2CE', 'E2CF', 'E2D0', 'E2D1', 'E2D2', 'E2D3', 'E2D4', 'E2D5', 'E2D6', 'E2D7', 'E2D8', 'E2D9', 'E2DA', 'E2DB', 'E2DC', 'E2DD', 'E2DE', 'E2DF', 'E2E0', 'E2E1', 'E2E2', 'E2E3', 'E2E4', 'E2E5', 'E2E6', 'E2E7', 'E2E8', 'E2E9', 'E2EA', 'E2EB', 'E2EC', 'E2ED', 'E2EE', 'E2EF', 'E2F0', 'E2F1', 'E2F2', 'E2F3', 'E2F4', 'E2F5', 'E2F6', 'E2F7', 'E2F8', 'E2F9', 'E2FA', 'E2FB', 'E2FC', 'E2FD', 'E2FE', 'E3A1', 'E3A2', 'E3A3', 'E3A4', 'E3A5', 'E3A6', 'E3A7', 'E3A8', 'E3A9', 'E3AA', 'E3AB', 'E3AC', 'E3AD', 'E3AE', 'E3AF', 'E3B0', 'E3B1', 'E3B2', 'E3B3', 'E3B4', 'E3B5', 'E3B6', 'E3B7', 'E3B8', 'E3B9', 'E3BA', 'E3BB', 'E3BC', 'E3BD', 'E3BE', 'E3BF', 'E3C0', 'E3C1', 'E3C2', 'E3C3', 'E3C4', 'E3C5', 'E3C6', 'E3C7', 'E3C8', 'E3C9', 'E3CA', 'E3CB', 'E3CC', 'E3CD', 'E3CE', 'E3CF', 'E3D0', 'E3D1', 'E3D2', 'E3D3', 'E3D4', 'E3D5', 'E3D6', 'E3D7', 'E3D8', 'E3D9', 'E3DA', 'E3DB', 'E3DC', 'E3DD', 'E3DE', 'E3DF', 'E3E0', 'E3E1', 'E3E2', 'E3E3', 'E3E4', 'E3E5', 'E3E6', 'E3E7', 'E3E8', 'E3E9', 'E3EA', 'E3EB', 'E3EC', 'E3ED', 'E3EE', 'E3EF', 'E3F0', 'E3F1', 'E3F2', 'E3F3', 'E3F4', 'E3F5', 'E3F6', 'E3F7', 'E3F8', 'E3F9', 'E3FA', 'E3FB', 'E3FC', 'E3FD', 'E3FE', 'E4A1', 'E4A2', 'E4A3', 'E4A4', 'E4A5', 'E4A6', 'E4A7', 'E4A8', 'E4A9', 'E4AA', 'E4AB', 'E4AC', 'E4AD', 'E4AE', 'E4AF', 'E4B0', 'E4B1', 'E4B2', 'E4B3', 'E4B4', 'E4B5', 'E4B6', 'E4B7', 'E4B8', 'E4B9', 'E4BA', 'E4BB', 'E4BC', 'E4BD', 'E4BE', 'E4BF', 'E4C0', 'E4C1', 'E4C2', 'E4C3', 'E4C4', 'E4C5', 'E4C6', 'E4C7', 'E4C8', 'E4C9', 'E4CA', 'E4CB', 'E4CC', 'E4CD', 'E4CE', 'E4CF', 'E4D0', 'E4D1', 'E4D2', 'E4D3', 'E4D4', 'E4D5', 'E4D6', 'E4D7', 'E4D8', 'E4D9', 'E4DA', 'E4DB', 'E4DC', 'E4DD', 'E4DE', 'E4DF', 'E4E0', 'E4E1', 'E4E2', 'E4E3', 'E4E4', 'E4E5', 'E4E6', 'E4E7', 'E4E8', 'E4E9', 'E4EA', 'E4EB', 'E4EC', 'E4ED', 'E4EE', 'E4EF', 'E4F0', 'E4F1', 'E4F2', 'E4F3', 'E4F4', 'E4F5', 'E4F6', 'E4F7', 'E4F8', 'E4F9', 'E4FA', 'E4FB', 'E4FC', 'E4FD', 'E4FE', 'E5A1', 'E5A2', 'E5A3', 'E5A4', 'E5A5', 'E5A6', 'E5A7', 'E5A8', 'E5A9', 'E5AA', 'E5AB', 'E5AC', 'E5AD', 'E5AE', 'E5AF', 'E5B0', 'E5B1', 'E5B2', 'E5B3', 'E5B4', 'E5B5', 'E5B6', 'E5B7', 'E5B8', 'E5B9', 'E5BA', 'E5BB', 'E5BC', 'E5BD', 'E5BE', 'E5BF', 'E5C0', 'E5C1', 'E5C2', 'E5C3', 'E5C4', 'E5C5', 'E5C6', 'E5C7', 'E5C8', 'E5C9', 'E5CA', 'E5CB', 'E5CC', 'E5CD', 'E5CE', 'E5CF', 'E5D0', 'E5D1', 'E5D2', 'E5D3', 'E5D4', 'E5D5', 'E5D6', 'E5D7', 'E5D8', 'E5D9', 'E5DA', 'E5DB', 'E5DC', 'E5DD', 'E5DE', 'E5DF', 'E5E0', 'E5E1', 'E5E2', 'E5E3', 'E5E4', 'E5E5', 'E5E6', 'E5E7', 'E5E8', 'E5E9', 'E5EA', 'E5EB', 'E5EC', 'E5ED', 'E5EE', 'E5EF', 'E5F0', 'E5F1', 'E5F2', 'E5F3', 'E5F4', 'E5F5', 'E5F6', 'E5F7', 'E5F8', 'E5F9', 'E5FA', 'E5FB', 'E5FC', 'E5FD', 'E5FE', 'E6A1', 'E6A2', 'E6A3', 'E6A4', 'E6A5', 'E6A6', 'E6A7', 'E6A8', 'E6A9', 'E6AA', 'E6AB', 'E6AC', 'E6AD', 'E6AE', 'E6AF', 'E6B0', 'E6B1', 'E6B2', 'E6B3', 'E6B4', 'E6B5', 'E6B6', 'E6B7', 'E6B8', 'E6B9', 'E6BA', 'E6BB', 'E6BC', 'E6BD', 'E6BE', 'E6BF', 'E6C0', 'E6C1', 'E6C2', 'E6C3', 'E6C4', 'E6C5', 'E6C6', 'E6C7', 'E6C8', 'E6C9', 'E6CA', 'E6CB', 'E6CC', 'E6CD', 'E6CE', 'E6CF', 'E6D0', 'E6D1', 'E6D2', 'E6D3', 'E6D4', 'E6D5', 'E6D6', 'E6D7', 'E6D8', 'E6D9', 'E6DA', 'E6DB', 'E6DC', 'E6DD', 'E6DE', 'E6DF', 'E6E0', 'E6E1', 'E6E2', 'E6E3', 'E6E4', 'E6E5', 'E6E6', 'E6E7', 'E6E8', 'E6E9', 'E6EA', 'E6EB', 'E6EC', 'E6ED', 'E6EE', 'E6EF', 'E6F0', 'E6F1', 'E6F2', 'E6F3', 'E6F4', 'E6F5', 'E6F6', 'E6F7', 'E6F8', 'E6F9', 'E6FA', 'E6FB', 'E6FC', 'E6FD', 'E6FE', 'E7A1', 'E7A2', 'E7A3', 'E7A4', 'E7A5', 'E7A6', 'E7A7', 'E7A8', 'E7A9', 'E7AA', 'E7AB', 'E7AC', 'E7AD', 'E7AE', 'E7AF', 'E7B0', 'E7B1', 'E7B2', 'E7B3', 'E7B4', 'E7B5', 'E7B6', 'E7B7', 'E7B8', 'E7B9', 'E7BA', 'E7BB', 'E7BC', 'E7BD', 'E7BE', 'E7BF', 'E7C0', 'E7C1', 'E7C2', 'E7C3', 'E7C4', 'E7C5', 'E7C6', 'E7C7', 'E7C8', 'E7C9', 'E7CA', 'E7CB', 'E7CC', 'E7CD', 'E7CE', 'E7CF', 'E7D0', 'E7D1', 'E7D2', 'E7D3', 'E7D4', 'E7D5', 'E7D6', 'E7D7', 'E7D8', 'E7D9', 'E7DA', 'E7DB', 'E7DC', 'E7DD', 'E7DE', 'E7DF', 'E7E0', 'E7E1', 'E7E2', 'E7E3', 'E7E4', 'E7E5', 'E7E6', 'E7E7', 'E7E8', 'E7E9', 'E7EA', 'E7EB', 'E7EC', 'E7ED', 'E7EE', 'E7EF', 'E7F0', 'E7F1', 'E7F2', 'E7F3', 'E7F4', 'E7F5', 'E7F6', 'E7F7', 'E7F8', 'E7F9', 'E7FA', 'E7FB', 'E7FC', 'E7FD', 'E7FE', 'E8A1', 'E8A2', 'E8A3', 'E8A4', 'E8A5', 'E8A6', 'E8A7', 'E8A8', 'E8A9', 'E8AA', 'E8AB', 'E8AC', 'E8AD', 'E8AE', 'E8AF', 'E8B0', 'E8B1', 'E8B2', 'E8B3', 'E8B4', 'E8B5', 'E8B6', 'E8B7', 'E8B8', 'E8B9', 'E8BA', 'E8BB', 'E8BC', 'E8BD', 'E8BE', 'E8BF', 'E8C0', 'E8C1', 'E8C2', 'E8C3', 'E8C4', 'E8C5', 'E8C6', 'E8C7', 'E8C8', 'E8C9', 'E8CA', 'E8CB', 'E8CC', 'E8CD', 'E8CE', 'E8CF', 'E8D0', 'E8D1', 'E8D2', 'E8D3', 'E8D4', 'E8D5', 'E8D6', 'E8D7', 'E8D8', 'E8D9', 'E8DA', 'E8DB', 'E8DC', 'E8DD', 'E8DE', 'E8DF', 'E8E0', 'E8E1', 'E8E2', 'E8E3', 'E8E4', 'E8E5', 'E8E6', 'E8E7', 'E8E8', 'E8E9', 'E8EA', 'E8EB', 'E8EC', 'E8ED', 'E8EE', 'E8EF', 'E8F0', 'E8F1', 'E8F2', 'E8F3', 'E8F4', 'E8F5', 'E8F6', 'E8F7', 'E8F8', 'E8F9', 'E8FA', 'E8FB', 'E8FC', 'E8FD', 'E8FE', 'E9A1', 'E9A2', 'E9A3', 'E9A4', 'E9A5', 'E9A6', 'E9A7', 'E9A8', 'E9A9', 'E9AA', 'E9AB', 'E9AC', 'E9AD', 'E9AE', 'E9AF', 'E9B0', 'E9B1', 'E9B2', 'E9B3', 'E9B4', 'E9B5', 'E9B6', 'E9B7', 'E9B8', 'E9B9', 'E9BA', 'E9BB', 'E9BC', 'E9BD', 'E9BE', 'E9BF', 'E9C0', 'E9C1', 'E9C2', 'E9C3', 'E9C4', 'E9C5', 'E9C6', 'E9C7', 'E9C8', 'E9C9', 'E9CA', 'E9CB', 'E9CC', 'E9CD', 'E9CE', 'E9CF', 'E9D0', 'E9D1', 'E9D2', 'E9D3', 'E9D4', 'E9D5', 'E9D6', 'E9D7', 'E9D8', 'E9D9', 'E9DA', 'E9DB', 'E9DC', 'E9DD', 'E9DE', 'E9DF', 'E9E0', 'E9E1', 'E9E2', 'E9E3', 'E9E4', 'E9E5', 'E9E6', 'E9E7', 'E9E8', 'E9E9', 'E9EA', 'E9EB', 'E9EC', 'E9ED', 'E9EE', 'E9EF', 'E9F0', 'E9F1', 'E9F2', 'E9F3', 'E9F4', 'E9F5', 'E9F6', 'E9F7', 'E9F8', 'E9F9', 'E9FA', 'E9FB', 'E9FC', 'E9FD', 'E9FE', 'EAA1', 'EAA2', 'EAA3', 'EAA4', 'EAA5', 'EAA6', 'EAA7', 'EAA8', 'EAA9', 'EAAA', 'EAAB', 'EAAC', 'EAAD', 'EAAE', 'EAAF', 'EAB0', 'EAB1', 'EAB2', 'EAB3', 'EAB4', 'EAB5', 'EAB6', 'EAB7', 'EAB8', 'EAB9', 'EABA', 'EABB', 'EABC', 'EABD', 'EABE', 'EABF', 'EAC0', 'EAC1', 'EAC2', 'EAC3', 'EAC4', 'EAC5', 'EAC6', 'EAC7', 'EAC8', 'EAC9', 'EACA', 'EACB', 'EACC', 'EACD', 'EACE', 'EACF', 'EAD0', 'EAD1', 'EAD2', 'EAD3', 'EAD4', 'EAD5', 'EAD6', 'EAD7', 'EAD8', 'EAD9', 'EADA', 'EADB', 'EADC', 'EADD', 'EADE', 'EADF', 'EAE0', 'EAE1', 'EAE2', 'EAE3', 'EAE4', 'EAE5', 'EAE6', 'EAE7', 'EAE8', 'EAE9', 'EAEA', 'EAEB', 'EAEC', 'EAED', 'EAEE', 'EAEF', 'EAF0', 'EAF1', 'EAF2', 'EAF3', 'EAF4', 'EAF5', 'EAF6', 'EAF7', 'EAF8', 'EAF9', 'EAFA', 'EAFB', 'EAFC', 'EAFD', 'EAFE', 'EBA1', 'EBA2', 'EBA3', 'EBA4', 'EBA5', 'EBA6', 'EBA7', 'EBA8', 'EBA9', 'EBAA', 'EBAB', 'EBAC', 'EBAD', 'EBAE', 'EBAF', 'EBB0', 'EBB1', 'EBB2', 'EBB3', 'EBB4', 'EBB5', 'EBB6', 'EBB7', 'EBB8', 'EBB9', 'EBBA', 'EBBB', 'EBBC', 'EBBD', 'EBBE', 'EBBF', 'EBC0', 'EBC1', 'EBC2', 'EBC3', 'EBC4', 'EBC5', 'EBC6', 'EBC7', 'EBC8', 'EBC9', 'EBCA', 'EBCB', 'EBCC', 'EBCD', 'EBCE', 'EBCF', 'EBD0', 'EBD1', 'EBD2', 'EBD3', 'EBD4', 'EBD5', 'EBD6', 'EBD7', 'EBD8', 'EBD9', 'EBDA', 'EBDB', 'EBDC', 'EBDD', 'EBDE', 'EBDF', 'EBE0', 'EBE1', 'EBE2', 'EBE3', 'EBE4', 'EBE5', 'EBE6', 'EBE7', 'EBE8', 'EBE9', 'EBEA', 'EBEB', 'EBEC', 'EBED', 'EBEE', 'EBEF', 'EBF0', 'EBF1', 'EBF2', 'EBF3', 'EBF4', 'EBF5', 'EBF6', 'EBF7', 'EBF8', 'EBF9', 'EBFA', 'EBFB', 'EBFC', 'EBFD', 'EBFE', 'ECA1', 'ECA2', 'ECA3', 'ECA4', 'ECA5', 'ECA6', 'ECA7', 'ECA8', 'ECA9', 'ECAA', 'ECAB', 'ECAC', 'ECAD', 'ECAE', 'ECAF', 'ECB0', 'ECB1', 'ECB2', 'ECB3', 'ECB4', 'ECB5', 'ECB6', 'ECB7', 'ECB8', 'ECB9', 'ECBA', 'ECBB', 'ECBC', 'ECBD', 'ECBE', 'ECBF', 'ECC0', 'ECC1', 'ECC2', 'ECC3', 'ECC4', 'ECC5', 'ECC6', 'ECC7', 'ECC8', 'ECC9', 'ECCA', 'ECCB', 'ECCC', 'ECCD', 'ECCE', 'ECCF', 'ECD0', 'ECD1', 'ECD2', 'ECD3', 'ECD4', 'ECD5', 'ECD6', 'ECD7', 'ECD8', 'ECD9', 'ECDA', 'ECDB', 'ECDC', 'ECDD', 'ECDE', 'ECDF', 'ECE0', 'ECE1', 'ECE2', 'ECE3', 'ECE4', 'ECE5', 'ECE6', 'ECE7', 'ECE8', 'ECE9', 'ECEA', 'ECEB', 'ECEC', 'ECED', 'ECEE', 'ECEF', 'ECF0', 'ECF1', 'ECF2', 'ECF3', 'ECF4', 'ECF5', 'ECF6', 'ECF7', 'ECF8', 'ECF9', 'ECFA', 'ECFB', 'ECFC', 'ECFD', 'ECFE', 'EDA1', 'EDA2', 'EDA3', 'EDA4', 'EDA5', 'EDA6', 'EDA7', 'EDA8', 'EDA9', 'EDAA', 'EDAB', 'EDAC', 'EDAD', 'EDAE', 'EDAF', 'EDB0', 'EDB1', 'EDB2', 'EDB3', 'EDB4', 'EDB5', 'EDB6', 'EDB7', 'EDB8', 'EDB9', 'EDBA', 'EDBB', 'EDBC', 'EDBD', 'EDBE', 'EDBF', 'EDC0', 'EDC1', 'EDC2', 'EDC3', 'EDC4', 'EDC5', 'EDC6', 'EDC7', 'EDC8', 'EDC9', 'EDCA', 'EDCB', 'EDCC', 'EDCD', 'EDCE', 'EDCF', 'EDD0', 'EDD1', 'EDD2', 'EDD3', 'EDD4', 'EDD5', 'EDD6', 'EDD7', 'EDD8', 'EDD9', 'EDDA', 'EDDB', 'EDDC', 'EDDD', 'EDDE', 'EDDF', 'EDE0', 'EDE1', 'EDE2', 'EDE3', 'EDE4', 'EDE5', 'EDE6', 'EDE7', 'EDE8', 'EDE9', 'EDEA', 'EDEB', 'EDEC', 'EDED', 'EDEE', 'EDEF', 'EDF0', 'EDF1', 'EDF2', 'EDF3', 'EDF4', 'EDF5', 'EDF6', 'EDF7', 'EDF8', 'EDF9', 'EDFA', 'EDFB', 'EDFC', 'EDFD', 'EDFE', 'EEA1', 'EEA2', 'EEA3', 'EEA4', 'EEA5', 'EEA6', 'EEA7', 'EEA8', 'EEA9', 'EEAA', 'EEAB', 'EEAC', 'EEAD', 'EEAE', 'EEAF', 'EEB0', 'EEB1', 'EEB2', 'EEB3', 'EEB4', 'EEB5', 'EEB6', 'EEB7', 'EEB8', 'EEB9', 'EEBA', 'EEBB', 'EEBC', 'EEBD', 'EEBE', 'EEBF', 'EEC0', 'EEC1', 'EEC2', 'EEC3', 'EEC4', 'EEC5', 'EEC6', 'EEC7', 'EEC8', 'EEC9', 'EECA', 'EECB', 'EECC', 'EECD', 'EECE', 'EECF', 'EED0', 'EED1', 'EED2', 'EED3', 'EED4', 'EED5', 'EED6', 'EED7', 'EED8', 'EED9', 'EEDA', 'EEDB', 'EEDC', 'EEDD', 'EEDE', 'EEDF', 'EEE0', 'EEE1', 'EEE2', 'EEE3', 'EEE4', 'EEE5', 'EEE6', 'EEE7', 'EEE8', 'EEE9', 'EEEA', 'EEEB', 'EEEC', 'EEED', 'EEEE', 'EEEF', 'EEF0', 'EEF1', 'EEF2', 'EEF3', 'EEF4', 'EEF5', 'EEF6', 'EEF7', 'EEF8', 'EEF9', 'EEFA', 'EEFB', 'EEFC', 'EEFD', 'EEFE', 'EFA1', 'EFA2', 'EFA3', 'EFA4', 'EFA5', 'EFA6', 'EFA7', 'EFA8', 'EFA9', 'EFAA', 'EFAB', 'EFAC', 'EFAD', 'EFAE', 'EFAF', 'EFB0', 'EFB1', 'EFB2', 'EFB3', 'EFB4', 'EFB5', 'EFB6', 'EFB7', 'EFB8', 'EFB9', 'EFBA', 'EFBB', 'EFBC', 'EFBD', 'EFBE', 'EFBF', 'EFC0', 'EFC1', 'EFC2', 'EFC3', 'EFC4', 'EFC5', 'EFC6', 'EFC7', 'EFC8', 'EFC9', 'EFCA', 'EFCB', 'EFCC', 'EFCD', 'EFCE', 'EFCF', 'EFD0', 'EFD1', 'EFD2', 'EFD3', 'EFD4', 'EFD5', 'EFD6', 'EFD7', 'EFD8', 'EFD9', 'EFDA', 'EFDB', 'EFDC', 'EFDD', 'EFDE', 'EFDF', 'EFE0', 'EFE1', 'EFE2', 'EFE3', 'EFE4', 'EFE5', 'EFE6', 'EFE7', 'EFE8', 'EFE9', 'EFEA', 'EFEB', 'EFEC', 'EFED', 'EFEE', 'EFEF', 'EFF0', 'EFF1', 'EFF2', 'EFF3', 'EFF4', 'EFF5', 'EFF6', 'EFF7', 'EFF8', 'EFF9', 'EFFA', 'EFFB', 'EFFC', 'EFFD', 'EFFE', 'F0A1', 'F0A2', 'F0A3', 'F0A4', 'F0A5', 'F0A6', 'F0A7', 'F0A8', 'F0A9', 'F0AA', 'F0AB', 'F0AC', 'F0AD', 'F0AE', 'F0AF', 'F0B0', 'F0B1', 'F0B2', 'F0B3', 'F0B4', 'F0B5', 'F0B6', 'F0B7', 'F0B8', 'F0B9', 'F0BA', 'F0BB', 'F0BC', 'F0BD', 'F0BE', 'F0BF', 'F0C0', 'F0C1', 'F0C2', 'F0C3', 'F0C4', 'F0C5', 'F0C6', 'F0C7', 'F0C8', 'F0C9', 'F0CA', 'F0CB', 'F0CC', 'F0CD', 'F0CE', 'F0CF', 'F0D0', 'F0D1', 'F0D2', 'F0D3', 'F0D4', 'F0D5', 'F0D6', 'F0D7', 'F0D8', 'F0D9', 'F0DA', 'F0DB', 'F0DC', 'F0DD', 'F0DE', 'F0DF', 'F0E0', 'F0E1', 'F0E2', 'F0E3', 'F0E4', 'F0E5', 'F0E6', 'F0E7', 'F0E8', 'F0E9', 'F0EA', 'F0EB', 'F0EC', 'F0ED', 'F0EE', 'F0EF', 'F0F0', 'F0F1', 'F0F2', 'F0F3', 'F0F4', 'F0F5', 'F0F6', 'F0F7', 'F0F8', 'F0F9', 'F0FA', 'F0FB', 'F0FC', 'F0FD', 'F0FE', 'F1A1', 'F1A2', 'F1A3', 'F1A4', 'F1A5', 'F1A6', 'F1A7', 'F1A8', 'F1A9', 'F1AA', 'F1AB', 'F1AC', 'F1AD', 'F1AE', 'F1AF', 'F1B0', 'F1B1', 'F1B2', 'F1B3', 'F1B4', 'F1B5', 'F1B6', 'F1B7', 'F1B8', 'F1B9', 'F1BA', 'F1BB', 'F1BC', 'F1BD', 'F1BE', 'F1BF', 'F1C0', 'F1C1', 'F1C2', 'F1C3', 'F1C4', 'F1C5', 'F1C6', 'F1C7', 'F1C8', 'F1C9', 'F1CA', 'F1CB', 'F1CC', 'F1CD', 'F1CE', 'F1CF', 'F1D0', 'F1D1', 'F1D2', 'F1D3', 'F1D4', 'F1D5', 'F1D6', 'F1D7', 'F1D8', 'F1D9', 'F1DA', 'F1DB', 'F1DC', 'F1DD', 'F1DE', 'F1DF', 'F1E0', 'F1E1', 'F1E2', 'F1E3', 'F1E4', 'F1E5', 'F1E6', 'F1E7', 'F1E8', 'F1E9', 'F1EA', 'F1EB', 'F1EC', 'F1ED', 'F1EE', 'F1EF', 'F1F0', 'F1F1', 'F1F2', 'F1F3', 'F1F4', 'F1F5', 'F1F6', 'F1F7', 'F1F8', 'F1F9', 'F1FA', 'F1FB', 'F1FC', 'F1FD', 'F1FE', 'F2A1', 'F2A2', 'F2A3', 'F2A4', 'F2A5', 'F2A6', 'F2A7', 'F2A8', 'F2A9', 'F2AA', 'F2AB', 'F2AC', 'F2AD', 'F2AE', 'F2AF', 'F2B0', 'F2B1', 'F2B2', 'F2B3', 'F2B4', 'F2B5', 'F2B6', 'F2B7', 'F2B8', 'F2B9', 'F2BA', 'F2BB', 'F2BC', 'F2BD', 'F2BE', 'F2BF', 'F2C0', 'F2C1', 'F2C2', 'F2C3', 'F2C4', 'F2C5', 'F2C6', 'F2C7', 'F2C8', 'F2C9', 'F2CA', 'F2CB', 'F2CC', 'F2CD', 'F2CE', 'F2CF', 'F2D0', 'F2D1', 'F2D2', 'F2D3', 'F2D4', 'F2D5', 'F2D6', 'F2D7', 'F2D8', 'F2D9', 'F2DA', 'F2DB', 'F2DC', 'F2DD', 'F2DE', 'F2DF', 'F2E0', 'F2E1', 'F2E2', 'F2E3', 'F2E4', 'F2E5', 'F2E6', 'F2E7', 'F2E8', 'F2E9', 'F2EA', 'F2EB', 'F2EC', 'F2ED', 'F2EE', 'F2EF', 'F2F0', 'F2F1', 'F2F2', 'F2F3', 'F2F4', 'F2F5', 'F2F6', 'F2F7', 'F2F8', 'F2F9', 'F2FA', 'F2FB', 'F2FC', 'F2FD', 'F2FE', 'F3A1', 'F3A2', 'F3A3', 'F3A4', 'F3A5', 'F3A6', 'F3A7', 'F3A8', 'F3A9', 'F3AA', 'F3AB', 'F3AC', 'F3AD', 'F3AE', 'F3AF', 'F3B0', 'F3B1', 'F3B2', 'F3B3', 'F3B4', 'F3B5', 'F3B6', 'F3B7', 'F3B8', 'F3B9', 'F3BA', 'F3BB', 'F3BC', 'F3BD', 'F3BE', 'F3BF', 'F3C0', 'F3C1', 'F3C2', 'F3C3', 'F3C4', 'F3C5', 'F3C6', 'F3C7', 'F3C8', 'F3C9', 'F3CA', 'F3CB', 'F3CC', 'F3CD', 'F3CE', 'F3CF', 'F3D0', 'F3D1', 'F3D2', 'F3D3', 'F3D4', 'F3D5', 'F3D6', 'F3D7', 'F3D8', 'F3D9', 'F3DA', 'F3DB', 'F3DC', 'F3DD', 'F3DE', 'F3DF', 'F3E0', 'F3E1', 'F3E2', 'F3E3', 'F3E4', 'F3E5', 'F3E6', 'F3E7', 'F3E8', 'F3E9', 'F3EA', 'F3EB', 'F3EC', 'F3ED', 'F3EE', 'F3EF', 'F3F0', 'F3F1', 'F3F2', 'F3F3', 'F3F4', 'F3F5', 'F3F6', 'F3F7', 'F3F8', 'F3F9', 'F3FA', 'F3FB', 'F3FC', 'F3FD', 'F3FE', 'F4A1', 'F4A2', 'F4A3', 'F4A4', 'F4A5', 'F4A6', 'F4A7', 'F4A8', 'F4A9', 'F4AA', 'F4AB', 'F4AC', 'F4AD', 'F4AE', 'F4AF', 'F4B0', 'F4B1', 'F4B2', 'F4B3', 'F4B4', 'F4B5', 'F4B6', 'F4B7', 'F4B8', 'F4B9', 'F4BA', 'F4BB', 'F4BC', 'F4BD', 'F4BE', 'F4BF', 'F4C0', 'F4C1', 'F4C2', 'F4C3', 'F4C4', 'F4C5', 'F4C6', 'F4C7', 'F4C8', 'F4C9', 'F4CA', 'F4CB', 'F4CC', 'F4CD', 'F4CE', 'F4CF', 'F4D0', 'F4D1', 'F4D2', 'F4D3', 'F4D4', 'F4D5', 'F4D6', 'F4D7', 'F4D8', 'F4D9', 'F4DA', 'F4DB', 'F4DC', 'F4DD', 'F4DE', 'F4DF', 'F4E0', 'F4E1', 'F4E2', 'F4E3', 'F4E4', 'F4E5', 'F4E6', 'F4E7', 'F4E8', 'F4E9', 'F4EA', 'F4EB', 'F4EC', 'F4ED', 'F4EE', 'F4EF', 'F4F0', 'F4F1', 'F4F2', 'F4F3', 'F4F4', 'F4F5', 'F4F6', 'F4F7', 'F4F8', 'F4F9', 'F4FA', 'F4FB', 'F4FC', 'F4FD', 'F4FE', 'F5A1', 'F5A2', 'F5A3', 'F5A4', 'F5A5', 'F5A6', 'F5A7', 'F5A8', 'F5A9', 'F5AA', 'F5AB', 'F5AC', 'F5AD', 'F5AE', 'F5AF', 'F5B0', 'F5B1', 'F5B2', 'F5B3', 'F5B4', 'F5B5', 'F5B6', 'F5B7', 'F5B8', 'F5B9', 'F5BA', 'F5BB', 'F5BC', 'F5BD', 'F5BE', 'F5BF', 'F5C0', 'F5C1', 'F5C2', 'F5C3', 'F5C4', 'F5C5', 'F5C6', 'F5C7', 'F5C8', 'F5C9', 'F5CA', 'F5CB', 'F5CC', 'F5CD', 'F5CE', 'F5CF', 'F5D0', 'F5D1', 'F5D2', 'F5D3', 'F5D4', 'F5D5', 'F5D6', 'F5D7', 'F5D8', 'F5D9', 'F5DA', 'F5DB', 'F5DC', 'F5DD', 'F5DE', 'F5DF', 'F5E0', 'F5E1', 'F5E2', 'F5E3', 'F5E4', 'F5E5', 'F5E6', 'F5E7', 'F5E8', 'F5E9', 'F5EA', 'F5EB', 'F5EC', 'F5ED', 'F5EE', 'F5EF', 'F5F0', 'F5F1', 'F5F2', 'F5F3', 'F5F4', 'F5F5', 'F5F6', 'F5F7', 'F5F8', 'F5F9', 'F5FA', 'F5FB', 'F5FC', 'F5FD', 'F5FE', 'F6A1', 'F6A2', 'F6A3', 'F6A4', 'F6A5', 'F6A6', 'F6A7', 'F6A8', 'F6A9', 'F6AA', 'F6AB', 'F6AC', 'F6AD', 'F6AE', 'F6AF', 'F6B0', 'F6B1', 'F6B2', 'F6B3', 'F6B4', 'F6B5', 'F6B6', 'F6B7', 'F6B8', 'F6B9', 'F6BA', 'F6BB', 'F6BC', 'F6BD', 'F6BE', 'F6BF', 'F6C0', 'F6C1', 'F6C2', 'F6C3', 'F6C4', 'F6C5', 'F6C6', 'F6C7', 'F6C8', 'F6C9', 'F6CA', 'F6CB', 'F6CC', 'F6CD', 'F6CE', 'F6CF', 'F6D0', 'F6D1', 'F6D2', 'F6D3', 'F6D4', 'F6D5', 'F6D6', 'F6D7', 'F6D8', 'F6D9', 'F6DA', 'F6DB', 'F6DC', 'F6DD', 'F6DE', 'F6DF', 'F6E0', 'F6E1', 'F6E2', 'F6E3', 'F6E4', 'F6E5', 'F6E6', 'F6E7', 'F6E8', 'F6E9', 'F6EA', 'F6EB', 'F6EC', 'F6ED', 'F6EE', 'F6EF', 'F6F0', 'F6F1', 'F6F2', 'F6F3', 'F6F4', 'F6F5', 'F6F6', 'F6F7', 'F6F8', 'F6F9', 'F6FA', 'F6FB', 'F6FC', 'F6FD', 'F6FE', 'F7A1', 'F7A2', 'F7A3', 'F7A4', 'F7A5', 'F7A6', 'F7A7', 'F7A8', 'F7A9', 'F7AA', 'F7AB', 'F7AC', 'F7AD', 'F7AE', 'F7AF', 'F7B0', 'F7B1', 'F7B2', 'F7B3', 'F7B4', 'F7B5', 'F7B6', 'F7B7', 'F7B8', 'F7B9', 'F7BA', 'F7BB', 'F7BC', 'F7BD', 'F7BE', 'F7BF', 'F7C0', 'F7C1', 'F7C2', 'F7C3', 'F7C4', 'F7C5', 'F7C6', 'F7C7', 'F7C8', 'F7C9', 'F7CA', 'F7CB', 'F7CC', 'F7CD', 'F7CE', 'F7CF', 'F7D0', 'F7D1', 'F7D2', 'F7D3', 'F7D4', 'F7D5', 'F7D6', 'F7D7', 'F7D8', 'F7D9', 'F7DA', 'F7DB', 'F7DC', 'F7DD', 'F7DE', 'F7DF', 'F7E0', 'F7E1', 'F7E2', 'F7E3', 'F7E4', 'F7E5', 'F7E6', 'F7E7', 'F7E8', 'F7E9', 'F7EA', 'F7EB', 'F7EC', 'F7ED', 'F7EE', 'F7EF', 'F7F0', 'F7F1', 'F7F2', 'F7F3', 'F7F4', 'F7F5', 'F7F6', 'F7F7', 'F7F8', 'F7F9', 'F7FA', 'F7FB', 'F7FC', 'F7FD', 'F7FE']

VALID_CHARACTERS = chirp_common.CHARSET_ASCII + "".join(FONT_MAPPING)

def convert_bytes_to_chinese(data: bytes) -> str:
    """Convert bytes to a string of chinese characters"""
    last_byte = 0x00
    text = ''
    for byte in data:
        if last_byte == 0x00 and byte == 0xFF or byte == 0x00:
            break
        if byte >= 0x80 and last_byte == 0x00:
            last_byte = byte
            continue
        if last_byte != 0x00:
            if (hex(last_byte).replace('0x', '') + hex(byte).replace('0x', '')).upper() in FONT_GBCODE: 
                text += FONT_MAPPING[FONT_GBCODE.index((hex(last_byte).replace('0x', '') + hex(byte).replace('0x', '')).upper())]
            last_byte = 0x00
            continue
        text += chr(byte)
    print(data)
    return text


def convert_chinese_to_ascii_chars(data: str) -> str:
    text = ''
    for char in data:
        if char in chirp_common.CHARSET_ASCII:
            text += char
        elif char in FONT_MAPPING:
            reverse_str = FONT_MAPPING.index(char)
            text += chr(int(FONT_GBCODE[reverse_str][:2], 16))
            text += chr(int(FONT_GBCODE[reverse_str][2:], 16))
    return text

class RadioSettingChineseValueString(RadioSettingValueString):

    """A string setting"""

    def __init__(self, minlength, maxlength, current,
                 autopad=True, charset=chirp_common.CHARSET_ASCII):
        RadioSettingValueString.__init__(self, minlength, maxlength, current, autopad, charset)

    def set_value(self, value):
        if len(value) < self._minlength or len(convert_chinese_to_ascii_chars(value)) > self._maxlength:
            raise InvalidValueError("Value must be between %i and %i chars" %
                                    (self._minlength, self._maxlength))
        if self._autopad:
            value = value.ljust(self._maxlength)
        for char in value:
            if char not in self._charset:
                raise InvalidValueError("Value contains invalid " +
                                        "character `%s'" % char)
        RadioSettingValue.set_value(self, value)


def get_mdc_contact_object(mem_obj, index):
    if index <= 16:
        return mem_obj.mdccontact1[index - 1]
    else:
        return mem_obj.mdccontact2[index - 17]


# the communication is obfuscated using this fine mechanism
def xorarr(data: bytes):
    tbl = [22, 108, 20, 230, 46, 145, 13, 64, 33, 53, 213, 64, 19, 3, 233, 128]
    x = b""
    r = 0
    for byte in data:
        x += bytes([byte ^ tbl[r]])
        r = (r+1) % len(tbl)
    return x


# if this crc was used for communication to AND from the radio, then it
# would be a measure to increase reliability.
# but it's only used towards the radio, so it's for further obfuscation
def calculate_crc16_xmodem(data: bytes):
    poly = 0x1021
    crc = 0x0
    for byte in data:
        crc = crc ^ (byte << 8)
        for i in range(8):
            crc = crc << 1
            if (crc & 0x10000):
                crc = (crc ^ poly) & 0xFFFF
    return crc & 0xFFFF


def _send_command(serport, data: bytes):
    """Send a command to UV-K5 radio"""
    LOG.debug("Sending command (unobfuscated) len=0x%4.4x:\n%s" %
              (len(data), util.hexprint(data)))

    crc = calculate_crc16_xmodem(data)
    data2 = data + struct.pack("<H", crc)

    command = struct.pack(">HBB", 0xabcd, len(data), 0) + \
        xorarr(data2) + \
        struct.pack(">H", 0xdcba)
    if DEBUG_SHOW_OBFUSCATED_COMMANDS:
        LOG.debug("Sending command (obfuscated):\n%s" % util.hexprint(command))
    try:
        result = serport.write(command)
    except Exception:
        raise errors.RadioError("Error writing data to radio")
    return result


def _receive_reply(serport):
    header = serport.read(4)
    if len(header) != 4:
        LOG.warning("Header short read: [%s] len=%i" %
                    (util.hexprint(header), len(header)))
        raise errors.RadioError("Header short read")
    if header[0] != 0xAB or header[1] != 0xCD or header[3] != 0x00:
        LOG.warning("Bad response header: %s len=%i" %
                    (util.hexprint(header), len(header)))
        raise errors.RadioError("Bad response header")

    cmd = serport.read(int(header[2]))
    if len(cmd) != int(header[2]):
        LOG.warning("Body short read: [%s] len=%i" %
                    (util.hexprint(cmd), len(cmd)))
        raise errors.RadioError("Command body short read")

    footer = serport.read(4)

    if len(footer) != 4:
        LOG.warning("Footer short read: [%s] len=%i" %
                    (util.hexprint(footer), len(footer)))
        raise errors.RadioError("Footer short read")

    if footer[2] != 0xDC or footer[3] != 0xBA:
        LOG.debug(
                "Reply before bad response footer (obfuscated)"
                "len=0x%4.4x:\n%s" % (len(cmd), util.hexprint(cmd)))
        LOG.warning("Bad response footer: %s len=%i" %
                    (util.hexprint(footer), len(footer)))
        raise errors.RadioError("Bad response footer")

    if DEBUG_SHOW_OBFUSCATED_COMMANDS:
        LOG.debug("Received reply (obfuscated) len=0x%4.4x:\n%s" %
                  (len(cmd), util.hexprint(cmd)))

    cmd2 = xorarr(cmd)

    LOG.debug("Received reply (unobfuscated) len=0x%4.4x:\n%s" %
              (len(cmd2), util.hexprint(cmd2)))

    return cmd2


def _getstring(data: bytes, begin, maxlen):
    tmplen = min(maxlen+1, len(data))
    s = [data[i] for i in range(begin, tmplen)]
    for key, val in enumerate(s):
        if val < ord(' ') or val > ord('~'):
            break
    return ''.join(chr(x) for x in s[0:key])


def _sayhello(serport):
    hellopacket = b"\x14\x05\x04\x00\x6a\x39\x57\x64"

    tries = 5
    while True:
        LOG.debug("Sending hello packet")
        _send_command(serport, hellopacket)
        o = _receive_reply(serport)
        if (o):
            break
        tries -= 1
        if tries == 0:
            LOG.warning("Failed to initialise radio")
            raise errors.RadioError("Failed to initialize radio")
    firmware = _getstring(o, 4, 16)
    LOG.info("Found firmware: %s" % firmware)
    return firmware


def _readmem(serport, offset, length):
    LOG.debug("Sending readmem offset=0x%4.4x len=0x%4.4x" % (offset, length))

    readmem = b"\x1b\x05\x08\x00" + \
        struct.pack("<HBB", offset, length, 0) + \
        b"\x6a\x39\x57\x64"
    _send_command(serport, readmem)
    o = _receive_reply(serport)
    if DEBUG_SHOW_MEMORY_ACTIONS:
        LOG.debug("readmem Received data len=0x%4.4x:\n%s" %
                  (len(o), util.hexprint(o)))
    return o[8:]


def _read_extra_mem(serport, offset: int, length: int, extra: int):
    extra_bytes = struct.pack("<H", extra)
    LOG.debug(
        "Sending read_extra_mem offset=0x%4.4x len=0x%4.4x extra=0x%4.4x" % (offset, length, extra))

    readmem = b"\x2b\x05\x08\x00" + \
              struct.pack("<HBB", offset, length, 0) + \
              b"\x6a\x39\x57\x64" + \
              extra_bytes
    _send_command(serport, readmem)
    o = _receive_reply(serport)
    if DEBUG_SHOW_MEMORY_ACTIONS:
        LOG.debug("read_extra_mem Received data len=0x%4.4x:\n%s" %
                  (len(o), util.hexprint(o)))
    return o[8:]


def _write_extra_mem(serport, offset: int, extra: int, data):
    extra_bytes = struct.pack("<H", extra)
    length = len(data) + len(extra_bytes)
    LOG.debug("Sending write_extra_mem offset=0x%4.4x len=0x%4.4x extra=0x%4.4x" %
              (offset, length, extra))

    if DEBUG_SHOW_MEMORY_ACTIONS:
        LOG.debug("write_extra_mem sent data offset=0x%4.4x len=0x%4.4x add=0x%4.4x:\n%s" %
                  (offset, length, extra, util.hexprint(data)))

    writemem = b"\x38\x05\x1c\x00" + \
        struct.pack("<HBB", offset, length, 0) + \
        b"\x6a\x39\x57\x64" + \
        extra_bytes + data

    _send_command(serport, writemem)
    o = _receive_reply(serport)

    LOG.debug("write_extra_mem Received data: %s len=%i" % (util.hexprint(o), len(o)))

    if (o[0] == 0x1e
            and
            o[4] == (offset & 0xff)
            and
            o[5] == (offset >> 8) & 0xff):
        return True
    else:
        LOG.warning("Bad data from write_extra_mem")
        raise errors.RadioError("Bad response to write_extra_mem")


def _writemem(serport, data, offset):
    LOG.debug("Sending writemem offset=0x%4.4x len=0x%4.4x" %
              (offset, len(data)))

    if DEBUG_SHOW_MEMORY_ACTIONS:
        LOG.debug("writemem sent data offset=0x%4.4x len=0x%4.4x:\n%s" %
                  (offset, len(data), util.hexprint(data)))

    dlen = len(data)
    writemem = b"\x1d\x05" + \
        struct.pack("<BBHBB", dlen+8, 0, offset, dlen, 1) + \
        b"\x6a\x39\x57\x64"+data

    _send_command(serport, writemem)
    o = _receive_reply(serport)

    LOG.debug("writemem Received data: %s len=%i" % (util.hexprint(o), len(o)))

    if (o[0] == 0x1e
            and
            o[4] == (offset & 0xff)
            and
            o[5] == (offset >> 8) & 0xff):
        return True
    else:
        LOG.warning("Bad data from writemem")
        raise errors.RadioError("Bad response to writemem")


def _resetradio(serport):
    resetpacket = b"\xdd\x05\x00\x00"
    _send_command(serport, resetpacket)


def do_download(radio):
    serport = radio.pipe
    serport.timeout = 0.5
    status = chirp_common.Status()
    status.cur = 0
    status.max = MEM_SIZE
    status.msg = "正在从电台下载数据"
    radio.status_fn(status)

    eeprom = b""
    f = _sayhello(serport)
    if f:
        radio.FIRMWARE_VERSION = f
    else:
        raise errors.RadioError('无法检测固件版本')

    addr = 0
    while addr < MEM_SIZE:
        o = _readmem(serport, addr, MEM_BLOCK)
        status.cur = addr
        radio.status_fn(status)

        if o and len(o) == MEM_BLOCK:
            eeprom += o
            addr += MEM_BLOCK
        else:
            raise errors.RadioError("信道未完全下载")
    status.cur = addr
    radio.status_fn(status)
    return memmap.MemoryMapBytes(eeprom)


def do_extra_download(radio):
    if not radio.FIRMWARE_VERSION.endswith('K'):
        return [b'', b'']
    serport = radio.pipe
    serport.timeout = 0.5
    status = chirp_common.Status()
    status.cur = 0
    status.max = 3
    status.msg = "正在从电台下载扩容部分数据"
    radio.status_fn(status)

    f = _sayhello(serport)
    if f:
        radio.FIRMWARE_VERSION = f
    else:
        raise errors.RadioError('无法检测固件版本')

    welcome_len = _read_extra_mem(serport, 0x01, 0x02, 0xE31E)
    status.cur = 1
    radio.status_fn(status)
    welcome_len1, welcome_len2 = welcome_len
    if welcome_len1 > 18:
        welcome_len1 = 18
    if welcome_len2 > 18:
        welcome_len2 = 18
    welcome_text_1 = _read_extra_mem(serport, 0x01, welcome_len1, 0xE320)
    status.cur = 2
    radio.status_fn(status)
    welcome_text_2 = _read_extra_mem(serport, 0x01, welcome_len2, 0xE333)
    status.cur = 3
    radio.status_fn(status)
    return [welcome_text_1, welcome_text_2]


def do_upload(radio):
    serport = radio.pipe
    serport.timeout = 0.5
    status = chirp_common.Status()
    status.cur = 0
    status.max = PROG_SIZE + 0x70
    status.msg = "正在向电台上传数据"
    radio.status_fn(status)

    f = _sayhello(serport)
    if f:
        radio.FIRMWARE_VERSION = f
    else:
        return False

    addr = 0
    while addr < PROG_SIZE:
        o = radio.get_mmap()[addr:addr+MEM_BLOCK]
        _writemem(serport, o, addr)
        status.cur = addr
        radio.status_fn(status)
        if o:
            addr += MEM_BLOCK
        else:
            raise errors.RadioError("信道未完全上传")
    status.cur = addr
    radio.status_fn(status)

    o = radio.get_mmap()[0x1F90:0x2000]
    _writemem(serport, o, 0x1F90)
    status.cur = PROG_SIZE + 0x70
    radio.status_fn(status)

    status.msg = "上传数据完成"

    return True


def do_extra_upload(radio):
    serport = radio.pipe
    serport.timeout = 0.5
    status = chirp_common.Status()
    status.cur = 0
    status.max = 3
    status.msg = "正在向电台上传扩容部分数据"
    radio.status_fn(status)

    f = _sayhello(serport)
    if f:
        radio.FIRMWARE_VERSION = f
    else:
        return False

    if radio.FIRMWARE_VERSION.endswith('K'):
        welcome_logo = radio.get_welcome_logo()
        _write_extra_mem(serport, 0x01, 0xE31E, bytes([len(x) for x in welcome_logo]))
        status.cur += 1
        radio.status_fn(status)
        _write_extra_mem(serport, 0x01, 0xE320, b'\x00' * 18)
        _write_extra_mem(serport, 0x01, 0xE320, welcome_logo[0])
        status.cur += 1
        radio.status_fn(status)
        _write_extra_mem(serport, 0x01, 0xE333, b'\x00' * 18)
        _write_extra_mem(serport, 0x01, 0xE333, welcome_logo[1])
        status.cur += 1
        radio.status_fn(status)
    else:
        status.cur += 3
        radio.status_fn(status)
    status.msg = "扩容部分数据上传完成"

    return True


def _find_band(nolimits, hz):
    mhz = hz/1000000.0
    if nolimits:
        B = BANDS_NOLIMITS
    else:
        B = BANDS

    # currently the hacked firmware sets band=1 below 50 MHz
    if nolimits and mhz < 50.0:
        return 1

    for a in B:
        if mhz >= B[a][0] and mhz <= B[a][1]:
            return a
    return False


@directory.register
class UVK5Radio(chirp_common.CloneModeRadio):
    """Quansheng UV-K5"""
    VENDOR = "Quansheng"
    MODEL = "UV-K5 (cn)"
    BAUD_RATE = 38400
    NEEDS_COMPAT_SERIAL = False
    FIRMWARE_VERSION = ""
    _expanded_limits = False

    def __init__(self, pipe):
          super().__init__(pipe)
          self._welcome_logo = [b'', b'']

    def get_prompts(x=None):
        rp = chirp_common.RadioPrompts()
        rp.experimental = (
            '这是用于 Quansheng UV-K5 的实验性驱动。它可能会损坏您的电台，甚至更糟。请自行承担风险。\n'
            '\n' 
            '在尝试进行任何更改之前，请使用 CHIRP 从电台中下载信道镜像并保存下来。这稍后可以用于恢复原始设置。\n'
            '\n'
            '一些细节尚未实现')
        rp.pre_download = (
            "1. 打开电台。\n"
            "2. 将写频线连接到麦克风/扬声器接口。\n"
            "3. 确保连接牢固。\n"
            "4. 点击确定 从设备下载镜像。\n"
            "\n"
            "如果在写频线已经连接的情况下打开电台，可能无法正常使用\n"
        )
        rp.pre_upload = (
            "1. 打开电台。\n"
            "2. 将写频线连接到麦克风/扬声器接口。\n"
            "3. 确保连接牢固。\n"
            "4. 点击确定 将镜像上传到设备。\n"
            "\n"
            "如果在写频线已经连接的情况下打开电台，可能无法正常使用\n"
        )
        return rp

    # Return information about this radio's features, including
    # how many memories it has, what bands it supports, etc
    def get_features(self):
        rf = chirp_common.RadioFeatures()
        rf.has_bank = False
        rf.valid_dtcs_codes = DTCS_CODES
        rf.has_rx_dtcs = True
        rf.has_ctone = True
        rf.has_settings = True
        rf.has_comment = False
        rf.valid_name_length = 10
        rf.valid_power_levels = UVK5_POWER_LEVELS
        rf.valid_special_chans = list(SPECIALS.keys())
        rf.valid_duplexes = ["", "-", "+", "off"]

        # hack so we can input any frequency,
        # the 0.1 and 0.01 steps don't work unfortunately
        rf.valid_tuning_steps = [0.01, 0.1, 1.0] + STEPS

        rf.valid_tmodes = ["", "Tone", "TSQL", "DTCS", "Cross"]
        rf.valid_cross_modes = ["Tone->Tone", "Tone->DTCS", "DTCS->Tone",
                                "->Tone", "->DTCS", "DTCS->", "DTCS->DTCS"]

        rf.valid_characters = VALID_CHARACTERS
        rf.valid_modes = ["FM", "NFM", "AM", "NAM"]

        rf.valid_skips = [""]

        # This radio supports memories 1-200, 201-214 are the VFO memories
        rf.memory_bounds = (1, 200)

        rf.valid_bands = []
        for a in BANDS_NOLIMITS:
            rf.valid_bands.append(
                    (int(BANDS_NOLIMITS[a][0]*1000000),
                     int(BANDS_NOLIMITS[a][1]*1000000)))
        return rf

    # Do a download of the radio from the serial port
    def sync_in(self):
        self._mmap = do_download(self)
        self._welcome_logo = do_extra_download(self)
        self.process_mmap()

    # Do an upload of the radio to the serial port
    def sync_out(self):
        do_upload(self)
        do_extra_upload(self)
        _resetradio(self.pipe)

    # Convert the raw byte array into a memory object structure
    def process_mmap(self):
        self._memobj = bitwise.parse(MEM_FORMAT, self._mmap)

    # Return a raw representation of the memory object, which
    # is very helpful for development
    def get_raw_memory(self, number):
        return repr(self._memobj.channel[number-1])

    def get_welcome_logo(self):
        return self._welcome_logo

    def validate_memory(self, mem):
        msgs = super().validate_memory(mem)

        if mem.duplex == 'off':
            return msgs

        # find tx frequency
        if mem.duplex == '-':
            txfreq = mem.freq - mem.offset
        elif mem.duplex == '+':
            txfreq = mem.freq + mem.offset
        else:
            txfreq = mem.freq

        # find band
        band = _find_band(self._expanded_limits, txfreq)
        if band is False:
            msg = "Transmit frequency %.4f MHz is not supported by this radio"\
                   % (txfreq/1000000.0)
            msgs.append(chirp_common.ValidationError(msg))

        band = _find_band(self._expanded_limits, mem.freq)
        if band is False:
            msg = "The frequency %.4f MHz is not supported by this radio" \
                   % (mem.freq/1000000.0)
            msgs.append(chirp_common.ValidationError(msg))

        return msgs

    def _set_tone(self, mem, _mem):
        ((txmode, txtone, txpol),
         (rxmode, rxtone, rxpol)) = chirp_common.split_tone_encode(mem)

        if txmode == "Tone":
            txtoval = CTCSS_TONES.index(txtone)
            txmoval = 0b01
        elif txmode == "DTCS":
            txmoval = txpol == "R" and 0b11 or 0b10
            txtoval = DTCS_CODES.index(txtone)
        else:
            txmoval = 0
            txtoval = 0

        if rxmode == "Tone":
            rxtoval = CTCSS_TONES.index(rxtone)
            rxmoval = 0b01
        elif rxmode == "DTCS":
            rxmoval = rxpol == "R" and 0b11 or 0b10
            rxtoval = DTCS_CODES.index(rxtone)
        else:
            rxmoval = 0
            rxtoval = 0

        _mem.rxcodeflag = rxmoval
        _mem.txcodeflag = txmoval
        _mem.unknown1 = 0
        _mem.unknown2 = 0
        _mem.rxcode = rxtoval
        _mem.txcode = txtoval

    def _get_tone(self, mem, _mem):
        rxtype = _mem.rxcodeflag
        txtype = _mem.txcodeflag
        rx_tmode = TMODES[rxtype]
        tx_tmode = TMODES[txtype]

        rx_tone = tx_tone = None

        if tx_tmode == "Tone":
            if _mem.txcode < len(CTCSS_TONES):
                tx_tone = CTCSS_TONES[_mem.txcode]
            else:
                tx_tone = 0
                tx_tmode = ""
        elif tx_tmode == "DTCS":
            if _mem.txcode < len(DTCS_CODES):
                tx_tone = DTCS_CODES[_mem.txcode]
            else:
                tx_tone = 0
                tx_tmode = ""

        if rx_tmode == "Tone":
            if _mem.rxcode < len(CTCSS_TONES):
                rx_tone = CTCSS_TONES[_mem.rxcode]
            else:
                rx_tone = 0
                rx_tmode = ""
        elif rx_tmode == "DTCS":
            if _mem.rxcode < len(DTCS_CODES):
                rx_tone = DTCS_CODES[_mem.rxcode]
            else:
                rx_tone = 0
                rx_tmode = ""

        tx_pol = txtype == 0x03 and "R" or "N"
        rx_pol = rxtype == 0x03 and "R" or "N"

        chirp_common.split_tone_decode(mem, (tx_tmode, tx_tone, tx_pol),
                                       (rx_tmode, rx_tone, rx_pol))

    # Extract a high-level memory object from the low-level memory map
    # This is called to populate a memory in the UI
    def get_memory(self, number2):

        mem = chirp_common.Memory()

        if isinstance(number2, str):
            number = SPECIALS[number2]
            mem.extd_number = number2
        else:
            number = number2 - 1

        mem.number = number + 1

        _mem = self._memobj.channel[number]

        tmpcomment = ""

        is_empty = False
        # We'll consider any blank (i.e. 0 MHz frequency) to be empty
        if (_mem.freq == 0xffffffff) or (_mem.freq == 0):
            is_empty = True

        tmpscn = SCANLIST_LIST[0]

        # We'll also look at the channel attributes if a memory has them
        if number < 200:
            _mem3 = self._memobj.channel_attributes[number]
            # free memory bit
            if _mem3.is_free > 0:
                is_empty = True
            # scanlists
            if _mem3.is_scanlist1 > 0 and _mem3.is_scanlist2 > 0:
                tmpscn = SCANLIST_LIST[3]  # "1+2"
            elif _mem3.is_scanlist1 > 0:
                tmpscn = SCANLIST_LIST[1]  # "1"
            elif _mem3.is_scanlist2 > 0:
                tmpscn = SCANLIST_LIST[2]  # "2"

        if is_empty:
            mem.empty = True
            # set some sane defaults:
            mem.power = UVK5_POWER_LEVELS[2]
            mem.extra = RadioSettingGroup("Extra", "extra")
            rs = RadioSetting(
                "bclo", "遇忙禁发",
                RadioSettingValueBoolean(False))
            mem.extra.append(rs)
            rs = RadioSetting(
                "frev", "倒频",
                RadioSettingValueBoolean(False))
            mem.extra.append(rs)
            rs = RadioSetting(
                "pttid", "PTTID",
                RadioSettingValueList(PTTID_LIST, PTTID_LIST[0]))
            mem.extra.append(rs)
            rs = RadioSetting(
                "dtmfdecode", "DTMF解码",
                RadioSettingValueBoolean(False))
            mem.extra.append(rs)
            rs = RadioSetting(
                "scrambler", "扰频",
                RadioSettingValueList(SCRAMBLER_LIST, SCRAMBLER_LIST[0]))
            mem.extra.append(rs)

            rs = RadioSetting(
                "scanlists", "扫描列表",
                RadioSettingValueList(SCANLIST_LIST, SCANLIST_LIST[0]))
            mem.extra.append(rs)

            # actually the step and duplex are overwritten by chirp based on
            # bandplan. they are here to document sane defaults for IARU r1
            # mem.tuning_step = 25.0
            # mem.duplex = ""

            return mem

        if number > 199:
            mem.immutable = ["name", "scanlists"]
        else:
            _mem2 = self._memobj.channelname[number]
            raw_bytes = _mem2.get_raw()
            mem.name = convert_bytes_to_chinese(raw_bytes).rstrip()

        # Convert your low-level frequency to Hertz
        mem.freq = int(_mem.freq)*10
        mem.offset = int(_mem.offset)*10

        if (mem.offset == 0):
            mem.duplex = ''
        else:
            if _mem.shift == FLAGS1_OFFSET_MINUS:
                if _mem.freq == _mem.offset:
                    # fake tx disable by setting tx to 0 MHz
                    mem.duplex = 'off'
                    mem.offset = 0
                else:
                    mem.duplex = '-'
            elif _mem.shift == FLAGS1_OFFSET_PLUS:
                mem.duplex = '+'
            else:
                mem.duplex = ''

        # tone data
        self._get_tone(mem, _mem)

        # mode
        if _mem.enable_am > 0:
            if _mem.bandwidth > 0:
                mem.mode = "NAM"
            else:
                mem.mode = "AM"
        else:
            if _mem.bandwidth > 0:
                mem.mode = "NFM"
            else:
                mem.mode = "FM"

        # tuning step
        tstep = _mem.step & 0x7
        if tstep < len(STEPS):
            mem.tuning_step = STEPS[tstep]
        else:
            mem.tuning_step = 2.5

        # power
        if _mem.txpower == POWER_HIGH:
            mem.power = UVK5_POWER_LEVELS[2]
        elif _mem.txpower == POWER_MEDIUM:
            mem.power = UVK5_POWER_LEVELS[1]
        else:
            mem.power = UVK5_POWER_LEVELS[0]

        # We'll consider any blank (i.e. 0 MHz frequency) to be empty
        if (_mem.freq == 0xffffffff) or (_mem.freq == 0):
            mem.empty = True
        else:
            mem.empty = False

        mem.extra = RadioSettingGroup("Extra", "extra")

        # BCLO
        is_bclo = bool(_mem.bclo > 0)
        rs = RadioSetting("bclo", "遇忙禁发", RadioSettingValueBoolean(is_bclo))
        mem.extra.append(rs)
        tmpcomment += "BCLO:"+(is_bclo and "ON" or "off")+" "

        # Frequency reverse - whatever that means, don't see it in the manual
        is_frev = bool(_mem.freq_reverse > 0)
        rs = RadioSetting("frev", "倒频", RadioSettingValueBoolean(is_frev))
        mem.extra.append(rs)
        tmpcomment += "FreqReverse:"+(is_frev and "ON" or "off")+" "

        # PTTID
        pttid = _mem.dtmf_pttid
        rs = RadioSetting("pttid", "PTTID", RadioSettingValueList(
            PTTID_LIST, PTTID_LIST[pttid]))
        mem.extra.append(rs)
        tmpcomment += "PTTid:"+PTTID_LIST[pttid]+" "

        # DTMF DECODE
        is_dtmf = bool(_mem.dtmf_decode > 0)
        rs = RadioSetting("dtmfdecode", "DTMF解码",
                          RadioSettingValueBoolean(is_dtmf))
        mem.extra.append(rs)
        tmpcomment += "DTMFdecode:"+(is_dtmf and "ON" or "off")+" "

        # Scrambler
        if _mem.scrambler & 0x0f < len(SCRAMBLER_LIST):
            enc = _mem.scrambler & 0x0f
        else:
            enc = 0

        rs = RadioSetting("scrambler", "扰频", RadioSettingValueList(
            SCRAMBLER_LIST, SCRAMBLER_LIST[enc]))
        mem.extra.append(rs)
        tmpcomment += "Scrambler:"+SCRAMBLER_LIST[enc]+" "

        rs = RadioSetting("scanlists", "扫描列表", RadioSettingValueList(
            SCANLIST_LIST, tmpscn))
        mem.extra.append(rs)

        return mem

    def set_settings(self, settings):
        _mem = self._memobj
        for element in settings:
            if not isinstance(element, RadioSetting):
                self.set_settings(element)
                continue

            # basic settings

            # call channel
            if element.get_name() == "call_channel":
                _mem.call_channel = int(element.value)-1

            # squelch
            if element.get_name() == "squelch":
                _mem.squelch = int(element.value)
            # TOT
            if element.get_name() == "tot":
                _mem.max_talk_time = int(element.value)

            # NOAA autoscan
            if element.get_name() == "noaa_autoscan":
                _mem.noaa_autoscan = element.value and 1 or 0

            # VOX switch
            if element.get_name() == "vox_switch":
                _mem.vox_switch = element.value and 1 or 0

            # vox level
            if element.get_name() == "vox_level":
                _mem.vox_level = int(element.value)-1

            # mic gain
            if element.get_name() == "mic_gain":
                if str(element.value) in MIC_GAIN_LIST:
                    _mem.mic_gain = int(MIC_GAIN_LIST.index(str(element.value)))
                else:
                    _mem.mic_gain = 2

            # Channel display mode
            if element.get_name() == "channel_display_mode":
                _mem.channel_display_mode = CHANNELDISP_LIST.index(
                    str(element.value))

            # Crossband receiving/transmitting
            if element.get_name() == "crossband":
                _mem.crossband = CROSSBAND_LIST.index(str(element.value))

            # Battery Save
            if element.get_name() == "battery_save":
                _mem.battery_save = BATSAVE_LIST.index(str(element.value))
            # Dual Watch
            if element.get_name() == "dualwatch":
                _mem.dual_watch = DUALWATCH_LIST.index(str(element.value))

            # Backlight auto mode
            if element.get_name() == "backlight_auto_mode":
                _mem.backlight_auto_mode = \
                        BACKLIGHT_LIST.index(str(element.value))

            # Tail tone elimination
            if element.get_name() == "tail_note_elimination":
                _mem.tail_note_elimination = element.value and 1 or 0

            # VFO Open
            if element.get_name() == "vfo_open":
                _mem.vfo_open = element.value and 1 or 0

            # Beep control
            if element.get_name() == "beep_control":
                _mem.beep_control = element.value and 1 or 0

            # Scan resume mode
            if element.get_name() == "scan_resume_mode":
                _mem.scan_resume_mode = SCANRESUME_LIST.index(
                    str(element.value))

            # Keypad lock
            if element.get_name() == "key_lock":
                _mem.key_lock = element.value and 1 or 0

            # Auto keypad lock
            if element.get_name() == "auto_keypad_lock":
                _mem.auto_keypad_lock = element.value and 1 or 0

            # Power on display mode
            if element.get_name() == "welcome_mode":
                _mem.power_on_dispmode = WELCOME_LIST.index(str(element.value))

            # Keypad Tone
            if element.get_name() == "keypad_tone":
                _mem.keypad_tone = KEYPADTONE_LIST.index(str(element.value))

            # Language
            if element.get_name() == "language":
                _mem.language = LANGUAGE_LIST.index(str(element.value))

            # Alarm mode
            if element.get_name() == "alarm_mode":
                _mem.alarm_mode = ALARMMODE_LIST.index(str(element.value))

            # Reminding of end of talk
            if element.get_name() == "reminding_of_end_talk":
                _mem.reminding_of_end_talk = REMENDOFTALK_LIST.index(
                    str(element.value))

            # Repeater tail tone elimination
            if element.get_name() == "repeater_tail_elimination":
                _mem.repeater_tail_elimination = RTE_LIST.index(
                    str(element.value))

            # Logo string 1
            if element.get_name() == "logo1":
                if self.FIRMWARE_VERSION.endswith('K'):
                    b = convert_chinese_to_ascii_chars(element.value).encode('latin-1')
                    self._welcome_logo[0] = b[0:18]
                else:
                    b = str(element.value).rstrip("\x20\xff\x00") + "\x00" * 12
                    _mem.logo_line1 = b[0:12] + "\x00\xff\xff\xff"

            # Logo string 2
            if element.get_name() == "logo2":
                if self.FIRMWARE_VERSION.endswith('K'):
                    b = convert_chinese_to_ascii_chars(element.value).encode('latin-1')
                    self._welcome_logo[1] = b[0:18]
                else:
                    b = str(element.value).rstrip("\x20\xff\x00") + "\x00" * 12
                    _mem.logo_line2 = b[0:12] + "\x00\xff\xff\xff"

            # unlock settings

            # FLOCK
            if element.get_name() == "flock":
                _mem.lock_flock = FLOCK_LIST.index(str(element.value))

            # # 350TX
            # if element.get_name() == "tx350":
            #     _mem.lock.tx350 = element.value and 1 or 0
            #
            # # 200TX
            # if element.get_name() == "tx200":
            #     _mem.lock.tx200 = element.value and 1 or 0
            #
            # # 500TX
            # if element.get_name() == "tx500":
            #     _mem.lock.tx500 = element.value and 1 or 0
            #
            # # 350EN
            # if element.get_name() == "en350":
            #     _mem.lock.en350 = element.value and 1 or 0

            # SCREN
            if element.get_name() == "enscramble":
                _mem.lock_enscramble = element.value and 1 or 0

            # KILLED
            if element.get_name() == "killed":
                _mem.lock_killed = element.value and 1 or 0

            # fm radio
            for i in range(1, 21):
                freqname = "FM_" + str(i)
                if element.get_name() == freqname:
                    val = str(element.value).strip()
                    try:
                        val2 = int(float(val)*10)
                    except Exception:
                        val2 = 0xffff

                    if val2 < FMMIN*10 or val2 > FMMAX*10:
                        val2 = 0xffff
#                        raise errors.InvalidValueError(
#                                "FM radio frequency should be a value "
#                                "in the range %.1f - %.1f" % (FMMIN , FMMAX))
                    _mem.fmfreq[i-1] = val2

            # dtmf settings
            if element.get_name() == "dtmf_side_tone":
                _mem.dtmf_settings.side_tone = \
                        element.value and 1 or 0

            if element.get_name() == "dtmf_separate_code":
                _mem.dtmf_settings.separate_code = str(element.value)

            if element.get_name() == "dtmf_group_call_code":
                _mem.dtmf_settings.group_call_code = element.value

            if element.get_name() == "dtmf_decode_response":
                _mem.dtmf_settings.decode_response = \
                        DTMF_DECODE_RESPONSE_LIST.index(str(element.value))

            if element.get_name() == "dtmf_auto_reset_time":
                _mem.dtmf_settings.auto_reset_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_preload_time":
                _mem.dtmf_settings.preload_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_first_code_persist_time":
                _mem.dtmf_settings.first_code_persist_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_hash_persist_time":
                _mem.dtmf_settings.hash_persist_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_code_persist_time":
                _mem.dtmf_settings.code_persist_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_code_interval_time":
                _mem.dtmf_settings.code_interval_time = \
                        int(int(element.value)/10)

            if element.get_name() == "dtmf_permit_remote_kill":
                _mem.dtmf_settings.permit_remote_kill = \
                        element.value and 1 or 0

            if element.get_name() == "dtmf_dtmf_local_code":
                k = str(element.value).rstrip("\x20\xff\x00") + "\x00"*3
                _mem.dtmf_settings_numbers.dtmf_local_code = k[0:3]

            if element.get_name() == "dtmf_dtmf_up_code":
                k = str(element.value).strip("\x20\xff\x00") + "\x00"*16
                _mem.dtmf_settings_numbers.dtmf_up_code = k[0:16]

            if element.get_name() == "dtmf_dtmf_down_code":
                k = str(element.value).rstrip("\x20\xff\x00") + "\x00"*16
                _mem.dtmf_settings_numbers.dtmf_down_code = k[0:16]

            if element.get_name() == "dtmf_kill_code":
                k = str(element.value).strip("\x20\xff\x00") + "\x00"*5
                _mem.dtmf_settings_numbers.kill_code = k[0:5]

            if element.get_name() == "dtmf_revive_code":
                k = str(element.value).strip("\x20\xff\x00") + "\x00"*5
                _mem.dtmf_settings_numbers.revive_code = k[0:5]

            # dtmf contacts
            for i in range(1, 17):
                varname = "DTMF_" + str(i)
                if element.get_name() == varname:
                    k = str(element.value).rstrip("\x20\xff\x00") + "\x00"*8
                    _mem.dtmfcontact[i-1].name = k[0:8]

                varnumname = "DTMFNUM_" + str(i)
                if element.get_name() == varnumname:
                    k = str(element.value).rstrip("\x20\xff\x00") + "\xff"*3
                    _mem.dtmfcontact[i-1].number = k[0:3]

            # MDC 联系人
            element_name = element.get_name()
            valid_mdc = 0
            last_valid = 0
            for i in range(1, 23):
                mdc_id = "MDC_ID_" + str(i)
                mdc_name = "MDC_NAME_" + str(i)
                if element_name == mdc_id:
                    k = str(element.value).replace(' ', '').rjust(4, '0')
                    get_mdc_contact_object(_mem, i).id = bytes.fromhex(k)[0:2]

                if element_name == mdc_name:
                    get_mdc_contact_object(_mem, i).name = str(element.value)[0:14]

                mdc_obj = get_mdc_contact_object(_mem, i)
                is_not_empty = mdc_obj.id.get_raw() != b'\x00' * 2 and mdc_obj.name.get_raw() != b'\x20' * 20
                if is_not_empty and (last_valid == i - 1 or last_valid == 0):
                    valid_mdc = i
                    last_valid = i
            _mem.mdc_num = valid_mdc

            # scanlist stuff
            if element.get_name() == "scanlist_default":
                val = (int(element.value) == 2) and 1 or 0
                _mem.scanlist_default = val

            if element.get_name() == "scanlist1_priority_scan":
                _mem.scanlist1_priority_scan = \
                        element.value and 1 or 0

            if element.get_name() == "scanlist2_priority_scan":
                _mem.scanlist2_priority_scan = \
                        element.value and 1 or 0

            if element.get_name() == "scanlist1_priority_ch1" or \
                    element.get_name() == "scanlist1_priority_ch2" or \
                    element.get_name() == "scanlist2_priority_ch1" or \
                    element.get_name() == "scanlist2_priority_ch2":

                val = int(element.value)

                if val > 200 or val < 1:
                    val = 0xff
                else:
                    val -= 1

                if element.get_name() == "scanlist1_priority_ch1":
                    _mem.scanlist1_priority_ch1 = val
                if element.get_name() == "scanlist1_priority_ch2":
                    _mem.scanlist1_priority_ch2 = val
                if element.get_name() == "scanlist2_priority_ch1":
                    _mem.scanlist2_priority_ch1 = val
                if element.get_name() == "scanlist2_priority_ch2":
                    _mem.scanlist2_priority_ch2 = val

            if element.get_name() == "key1_shortpress_action":
                _mem.key1_shortpress_action = KEYACTIONS_SHORT_LIST.index(
                        str(element.value))

            if element.get_name() == "key1_longpress_action":
                _mem.key1_longpress_action = KEYACTIONS_LONG_LIST.index(
                        str(element.value))

            if element.get_name() == "key2_shortpress_action":
                _mem.key2_shortpress_action = KEYACTIONS_SHORT_LIST.index(
                        str(element.value))

            if element.get_name() == "key2_longpress_action":
                _mem.key2_longpress_action = KEYACTIONS_LONG_LIST.index(
                        str(element.value))

            if element.get_name() == "mkey_longpress_action":
                _mem.key2_longpress_action = KEYACTIONS_LONG_LIST.index(
                        str(element.value))

            if element.get_name() == "nolimits":
                LOG.warning("User expanded band limits")
                self._expanded_limits = bool(element.value)

    def get_settings(self):
        _mem = self._memobj
        basic = RadioSettingGroup("basic", "基本设置")
        keya = RadioSettingGroup("keya", "自定义按键")
        dtmf = RadioSettingGroup("dtmf", "DTMF 设置")
        dtmfc = RadioSettingGroup("dtmfc", "DTMF 联系人")
        mdcc = RadioSettingGroup("mdcc", "MDC 联系人")
        scanl = RadioSettingGroup("scn", "扫描列表")
        unlock = RadioSettingGroup("unlock", "解锁设置")
        fmradio = RadioSettingGroup("fmradio", "FM广播")

        roinfo = RadioSettingGroup("roinfo", "设备信息")

        top = RadioSettings(
                basic, keya, dtmf, dtmfc, mdcc, scanl, unlock, fmradio, roinfo)

        # Programmable keys
        tmpval = int(_mem.key1_shortpress_action)
        if tmpval >= len(KEYACTIONS_SHORT_LIST):
            tmpval = 0
        rs = RadioSetting("key1_shortpress_action", "侧键1短按",
                          RadioSettingValueList(
                              KEYACTIONS_SHORT_LIST, KEYACTIONS_SHORT_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.key1_longpress_action)
        if tmpval >= len(KEYACTIONS_LONG_LIST):
            tmpval = 0
        rs = RadioSetting("key1_longpress_action", "侧键1长按",
                          RadioSettingValueList(
                              KEYACTIONS_LONG_LIST, KEYACTIONS_LONG_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.key2_shortpress_action)
        if tmpval >= len(KEYACTIONS_SHORT_LIST):
            tmpval = 0
        rs = RadioSetting("key2_shortpress_action", "侧键2短按",
                          RadioSettingValueList(
                              KEYACTIONS_SHORT_LIST, KEYACTIONS_SHORT_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.key2_longpress_action)
        if tmpval >= len(KEYACTIONS_LONG_LIST):
            tmpval = 0
        rs = RadioSetting("key2_longpress_action", "侧键2长按",
                          RadioSettingValueList(
                              KEYACTIONS_LONG_LIST, KEYACTIONS_LONG_LIST[tmpval]))
        keya.append(rs)

        tmpval = int(_mem.mkey_longpress_action)
        if tmpval >= len(KEYACTIONS_LONG_LIST):
            tmpval = 0
        rs = RadioSetting("mkey_longpress_action", "M键长按",
                          RadioSettingValueList(
                              KEYACTIONS_LONG_LIST, KEYACTIONS_LONG_LIST[tmpval]))
        keya.append(rs)

        # DTMF settings
        tmppr = bool(_mem.dtmf_settings.side_tone > 0)
        rs = RadioSetting(
                "dtmf_side_tone",
                "DTMF 侧音",
                RadioSettingValueBoolean(tmppr))
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings.separate_code)
        if tmpval not in DTMF_CODE_CHARS:
            tmpval = '*'
        val = RadioSettingValueString(1, 1, tmpval)
        val.set_charset(DTMF_CODE_CHARS)
        rs = RadioSetting("dtmf_separate_code", "分隔码", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings.group_call_code)
        if tmpval not in DTMF_CODE_CHARS:
            tmpval = '#'
        val = RadioSettingValueString(1, 1, tmpval)
        val.set_charset(DTMF_CODE_CHARS)
        rs = RadioSetting("dtmf_group_call_code", "组呼码", val)
        dtmf.append(rs)

        tmpval = _mem.dtmf_settings.decode_response
        if tmpval >= len(DTMF_DECODE_RESPONSE_LIST):
            tmpval = 0
        rs = RadioSetting("dtmf_decode_response", "解码响应",
                          RadioSettingValueList(
                              DTMF_DECODE_RESPONSE_LIST,
                              DTMF_DECODE_RESPONSE_LIST[tmpval]))
        dtmf.append(rs)

        tmpval = _mem.dtmf_settings.auto_reset_time
        if tmpval > 60 or tmpval < 5:
            tmpval = 5
        rs = RadioSetting("dtmf_auto_reset_time",
                          "自动复位时间 (秒)",
                          RadioSettingValueInteger(5, 60, tmpval))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.preload_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_preload_time",
                          "预载波时间 (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.first_code_persist_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_first_code_persist_time",
                          "首码持续时间 (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.hash_persist_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_hash_persist_time",
                          "*/# 码持续时间 (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.code_persist_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_code_persist_time",
                          "单码持续时间 (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = int(_mem.dtmf_settings.code_interval_time)
        if tmpval > 100 or tmpval < 3:
            tmpval = 30
        tmpval *= 10
        rs = RadioSetting("dtmf_code_interval_time",
                          "码间间隔时间 (ms)",
                          RadioSettingValueInteger(30, 1000, tmpval, 10))
        dtmf.append(rs)

        tmpval = bool(_mem.dtmf_settings.permit_remote_kill > 0)
        rs = RadioSetting(
                "dtmf_permit_remote_kill",
                "允许遥毙",
                RadioSettingValueBoolean(tmpval))
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.dtmf_local_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_ID:
                continue
            else:
                tmpval = "103"
                break
        val = RadioSettingValueString(3, 3, tmpval)
        val.set_charset(DTMF_CHARS_ID)
        rs = RadioSetting("dtmf_dtmf_local_code",
                          "身份码 (3字符 0-9 ABCD)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.dtmf_up_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_UPDOWN or i == "":
                continue
            else:
                tmpval = "123"
                break
        val = RadioSettingValueString(1, 16, tmpval)
        val.set_charset(DTMF_CHARS_UPDOWN)
        rs = RadioSetting("dtmf_dtmf_up_code",
                          "上线码 (1-16字符 0-9 ABCD*#)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.dtmf_down_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_UPDOWN:
                continue
            else:
                tmpval = "456"
                break
        val = RadioSettingValueString(1, 16, tmpval)
        val.set_charset(DTMF_CHARS_UPDOWN)
        rs = RadioSetting("dtmf_dtmf_down_code",
                          "下线码 (1-16字符 0-9 ABCD*#)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.kill_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_KILL:
                continue
            else:
                tmpval = "77777"
                break
        if not len(tmpval) == 5:
            tmpval = "77777"
        val = RadioSettingValueString(5, 5, tmpval)
        val.set_charset(DTMF_CHARS_KILL)
        rs = RadioSetting("dtmf_kill_code",
                          "遥毙码 (5字符 0-9 ABCD)", val)
        dtmf.append(rs)

        tmpval = str(_mem.dtmf_settings_numbers.revive_code).upper().strip(
                "\x00\xff\x20")
        for i in tmpval:
            if i in DTMF_CHARS_KILL:
                continue
            else:
                tmpval = "88888"
                break
        if not len(tmpval) == 5:
            tmpval = "88888"
        val = RadioSettingValueString(5, 5, tmpval)
        val.set_charset(DTMF_CHARS_KILL)
        rs = RadioSetting("dtmf_revive_code",
                          "唤醒码 (5字符 0-9 ABCD)", val)
        dtmf.append(rs)

        val = RadioSettingValueString(0, 80,
                                      "DTMF 联系人为3个字符"
                                      "(有效值: 0-9 * # ABCD), "
                                      "或者是空字符串", charset=VALID_CHARACTERS)
        val.set_mutable(False)
        rs = RadioSetting("dtmf_descr1", "DTMF 联系人", val)
        dtmfc.append(rs)

        for i in range(1, 17):
            varname = "DTMF_" + str(i)
            varnumname = "DTMFNUM_" + str(i)
            vardescr = "联系人" + str(i) + " | 名称"
            varinumdescr = "联系人" + str(i) + " | 号码"

            cntn = str(_mem.dtmfcontact[i-1].name).strip("\x20\x00\xff")
            cntnum = str(_mem.dtmfcontact[i-1].number).strip("\x20\x00\xff")

            val = RadioSettingValueString(0, 8, cntn)
            rs = RadioSetting(varname, vardescr, val)
            dtmfc.append(rs)

            val = RadioSettingValueString(0, 3, cntnum)
            val.set_charset(DTMF_CHARS)
            rs = RadioSetting(varnumname, varinumdescr, val)
            dtmfc.append(rs)

        # MDC 联系人
        val = RadioSettingValueString(0, 80,
                                      "MDC ID 应为 4位16进制数字 例如12AB, 联系人名称不能用中文, 请按顺序添加", charset=VALID_CHARACTERS)
        val.set_mutable(False)
        rs = RadioSetting("mdc_descr1", "MDC 联系人", val)
        mdcc.append(rs)

        for i in range(1, 23):
            mdc_id = "MDC_ID_" + str(i)
            mdc_name = "MDC_NAME_" + str(i)
            mdc_id_descr = "联系人" + str(i) + " | MDC ID"
            mdc_name_descr = "联系人" + str(i) + " | 名称"
            if i <= int(_mem.mdc_num):
                mdc_obj = get_mdc_contact_object(_mem, i)
                c_id = ''.join(['{:02X}'.format(int(byte)) for byte in mdc_obj.id])
                c_name = str(mdc_obj.name)

                val = RadioSettingValueString(0, 4, c_id, charset=' 0123456789ABCDEF')
                rs = RadioSetting(mdc_id, mdc_id_descr, val)
                mdcc.append(rs)

                try:
                    val = RadioSettingValueString(0, 14, c_name)
                except Exception:
                    val = RadioSettingValueString(0, 14, '')
                rs = RadioSetting(mdc_name, mdc_name_descr, val)
                mdcc.append(rs)
            else:
                val = RadioSettingValueString(0, 4, '', charset=' 0123456789ABCDEF')
                rs = RadioSetting(mdc_id, mdc_id_descr, val)
                mdcc.append(rs)

                val = RadioSettingValueString(0, 14, '')
                rs = RadioSetting(mdc_name, mdc_name_descr, val)
                mdcc.append(rs)

        # scanlists
        if _mem.scanlist_default == 1:
            tmpsc = 2
        else:
            tmpsc = 1
        rs = RadioSetting("scanlist_default",
                          "默认扫描列表",
                          RadioSettingValueInteger(1, 2, tmpsc))
        scanl.append(rs)

        tmppr = bool((_mem.scanlist1_priority_scan & 1) > 0)
        rs = RadioSetting(
                "scanlist1_priority_scan",
                "扫描列表1 优先信道扫描",
                RadioSettingValueBoolean(tmppr))
        scanl.append(rs)

        tmpch = _mem.scanlist1_priority_ch1 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist1_priority_ch1",
                          "扫描列表1 优先信道1 (0 - 关闭)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        tmpch = _mem.scanlist1_priority_ch2 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist1_priority_ch2",
                          "扫描列表1 优先信道2 (0 - 关闭)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        tmppr = bool((_mem.scanlist2_priority_scan & 1) > 0)
        rs = RadioSetting(
                "scanlist2_priority_scan",
                "扫描列表2 优先信道扫描",
                RadioSettingValueBoolean(tmppr))
        scanl.append(rs)

        tmpch = _mem.scanlist2_priority_ch1 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist2_priority_ch1",
                          "扫描列表2 优先信道1 (0 - 关闭)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        tmpch = _mem.scanlist2_priority_ch2 + 1
        if tmpch > 200:
            tmpch = 0
        rs = RadioSetting("scanlist2_priority_ch2",
                          "扫描列表2 优先信道2 (0 - 关闭)",
                          RadioSettingValueInteger(0, 200, tmpch))
        scanl.append(rs)

        # basic settings

        # call channel
        tmpc = _mem.call_channel+1
        if tmpc > 200:
            tmpc = 1
        rs = RadioSetting("call_channel", "一键即呼信道",
                          RadioSettingValueInteger(1, 200, tmpc))
        basic.append(rs)

        # squelch
        tmpsq = _mem.squelch
        if tmpsq > 9:
            tmpsq = 1
        rs = RadioSetting("squelch", "静噪等级",
                          RadioSettingValueInteger(0, 9, tmpsq))
        basic.append(rs)

        # TOT
        tmptot = _mem.max_talk_time
        if tmptot > 10:
            tmptot = 10
        rs = RadioSetting(
                "tot",
                "发送超时 [分钟]",
                RadioSettingValueInteger(0, 10, tmptot))
        basic.append(rs)

        # NOAA autoscan
        rs = RadioSetting(
                "noaa_autoscan",
                "NOAA自动扫描", RadioSettingValueBoolean(
                    bool(_mem.noaa_autoscan > 0)))
        basic.append(rs)

        # VOX switch
        rs = RadioSetting(
                "vox_switch",
                "声控发射", RadioSettingValueBoolean(
                    bool(_mem.vox_switch > 0)))
        basic.append(rs)

        # VOX Level
        tmpvox = _mem.vox_level+1
        if tmpvox > 10:
            tmpvox = 10
        rs = RadioSetting("vox_level", "声控发射灵敏度",
                          RadioSettingValueInteger(1, 10, tmpvox))
        basic.append(rs)

        # Mic gain
        tmpmicgain = _mem.mic_gain
        if tmpmicgain > 4:
            tmpmicgain = 2
        rs = RadioSetting("mic_gain", "麦克风增益",
                          RadioSettingValueList(MIC_GAIN_LIST, None, tmpmicgain))
        basic.append(rs)

        # Channel display mode
        tmpchdispmode = _mem.channel_display_mode
        if tmpchdispmode >= len(CHANNELDISP_LIST):
            tmpchdispmode = 0
        rs = RadioSetting(
                "channel_display_mode",
                "信道显示模式",
                RadioSettingValueList(
                    CHANNELDISP_LIST,
                    CHANNELDISP_LIST[tmpchdispmode]))
        basic.append(rs)

        # Crossband receiving/transmitting
        tmpcross = _mem.crossband
        if tmpcross >= len(CROSSBAND_LIST):
            tmpcross = 0
        rs = RadioSetting(
                "crossband",
                "跨段收发",
                RadioSettingValueList(
                    CROSSBAND_LIST,
                    CROSSBAND_LIST[tmpcross]))
        basic.append(rs)

        # Battery save
        tmpbatsave = _mem.battery_save
        if tmpbatsave >= len(BATSAVE_LIST):
            tmpbatsave = BATSAVE_LIST.index("1:4")
        rs = RadioSetting(
                "battery_save",
                "省电模式",
                RadioSettingValueList(
                    BATSAVE_LIST,
                    BATSAVE_LIST[tmpbatsave]))
        basic.append(rs)

        # Dual watch
        tmpdual = _mem.dual_watch
        if tmpdual >= len(DUALWATCH_LIST):
            tmpdual = 0
        rs = RadioSetting("dualwatch", "双频守候", RadioSettingValueList(
            DUALWATCH_LIST, DUALWATCH_LIST[tmpdual]))
        basic.append(rs)

        # Backlight auto mode
        tmpback = _mem.backlight_auto_mode
        if tmpback >= len(BACKLIGHT_LIST):
            tmpback = 0
        rs = RadioSetting("backlight_auto_mode",
                          "自动背光",
                          RadioSettingValueList(
                              BACKLIGHT_LIST,
                              BACKLIGHT_LIST[tmpback]))
        basic.append(rs)

        # Tail tone elimination
        rs = RadioSetting(
                "tail_note_elimination",
                "尾音消除",
                RadioSettingValueBoolean(
                    bool(_mem.tail_note_elimination > 0)))
        basic.append(rs)

        # VFO open
        rs = RadioSetting("vfo_open", "频率模式",
                          RadioSettingValueBoolean(bool(_mem.vfo_open > 0)))
        basic.append(rs)

        # Beep control
        rs = RadioSetting(
                "beep_control",
                "按键音",
                RadioSettingValueBoolean(bool(_mem.beep_control > 0)))
        basic.append(rs)

        # Scan resume mode
        tmpscanres = _mem.scan_resume_mode
        if tmpscanres >= len(SCANRESUME_LIST):
            tmpscanres = 0
        rs = RadioSetting(
                "scan_resume_mode",
                "扫描恢复模式",
                RadioSettingValueList(
                    SCANRESUME_LIST,
                    SCANRESUME_LIST[tmpscanres]))
        basic.append(rs)

        # Keypad locked
        rs = RadioSetting(
                "key_lock",
                "按键锁定",
                RadioSettingValueBoolean(bool(_mem.key_lock > 0)))
        basic.append(rs)

        # Auto keypad lock
        rs = RadioSetting(
                "auto_keypad_lock",
                "按键自动锁定",
                RadioSettingValueBoolean(bool(_mem.auto_keypad_lock > 0)))
        basic.append(rs)

        # Power on display mode
        tmpdispmode = _mem.power_on_dispmode
        if tmpdispmode >= len(WELCOME_LIST):
            tmpdispmode = 0
        rs = RadioSetting(
                "welcome_mode",
                "开机显示",
                RadioSettingValueList(
                    WELCOME_LIST,
                    WELCOME_LIST[tmpdispmode]))
        basic.append(rs)

        # Keypad Tone
        tmpkeypadtone = _mem.keypad_tone
        if tmpkeypadtone >= len(KEYPADTONE_LIST):
            tmpkeypadtone = 0
        rs = RadioSetting("keypad_tone", "按键语音", RadioSettingValueList(
            KEYPADTONE_LIST, KEYPADTONE_LIST[tmpkeypadtone]))
        basic.append(rs)

        # Language
        tmplanguage = _mem.language
        if tmplanguage >= len(LANGUAGE_LIST):
            tmplanguage = 0
        rs = RadioSetting("language", "语言", RadioSettingValueList(
            LANGUAGE_LIST, LANGUAGE_LIST[tmplanguage]))
        basic.append(rs)

        # Alarm mode
        tmpalarmmode = _mem.alarm_mode
        if tmpalarmmode >= len(ALARMMODE_LIST):
            tmpalarmmode = 0
        rs = RadioSetting("alarm_mode", "紧急告警模式", RadioSettingValueList(
            ALARMMODE_LIST, ALARMMODE_LIST[tmpalarmmode]))
        basic.append(rs)

        # Reminding of end of talk
        tmpalarmmode = _mem.reminding_of_end_talk
        if tmpalarmmode >= len(REMENDOFTALK_LIST):
            tmpalarmmode = 0
        rs = RadioSetting(
                "reminding_of_end_talk",
                "首尾音",
                RadioSettingValueList(
                    REMENDOFTALK_LIST,
                    REMENDOFTALK_LIST[tmpalarmmode]))
        basic.append(rs)

        # Repeater tail tone elimination
        tmprte = _mem.repeater_tail_elimination
        if tmprte >= len(RTE_LIST):
            tmprte = 0
        rs = RadioSetting(
                "repeater_tail_elimination",
                "过中继尾音消除",
                RadioSettingValueList(RTE_LIST, RTE_LIST[tmprte]))
        basic.append(rs)

        # Logo string 1
        if self.FIRMWARE_VERSION.endswith('K'):
            logo1 = convert_bytes_to_chinese(self._welcome_logo[0])
            rs = RadioSetting("logo1", "欢迎字符1 (18字符)",
                              RadioSettingChineseValueString(0, 18, logo1, False, VALID_CHARACTERS))
        else:
            logo1 = str(_mem.logo_line1).strip("\x20\x00\xff") + "\x00"
            logo1 = _getstring(logo1.encode('ascii', errors='ignore'), 0, 12)
            rs = RadioSetting("logo1", "欢迎字符1 (12字符)",
                              RadioSettingChineseValueString(0, 12, logo1, False))
        basic.append(rs)

        # Logo string 2
        if self.FIRMWARE_VERSION.endswith('K'):
            logo2 = convert_bytes_to_chinese(self._welcome_logo[1])
            rs = RadioSetting("logo2", "欢迎字符2 (18字符)",
                              RadioSettingChineseValueString(0, 18, logo2, False, VALID_CHARACTERS))
        else:
            logo2 = str(_mem.logo_line2).strip("\x20\x00\xff") + "\x00"
            logo2 = _getstring(logo2.encode('ascii', errors='ignore'), 0, 12)
            rs = RadioSetting("logo2", "欢迎字符2 (12字符)",
                              RadioSettingChineseValueString(0, 12, logo2, False))
        basic.append(rs)

        # FM radio
        for i in range(1, 21):
            freqname = "FM_"+str(i)
            fmfreq = _mem.fmfreq[i-1]/10.0
            if fmfreq < FMMIN or fmfreq > FMMAX:
                rs = RadioSetting(freqname, freqname,
                                  RadioSettingValueString(0, 5, ""))
            else:
                rs = RadioSetting(freqname, freqname,
                                  RadioSettingValueString(0, 5, str(fmfreq)))

            fmradio.append(rs)

        # unlock settings

        # F-LOCK
        tmpflock = _mem.lock_flock
        if tmpflock >= len(FLOCK_LIST):
            tmpflock = 0
        rs = RadioSetting(
            "flock", "频段解锁",
            RadioSettingValueList(FLOCK_LIST, FLOCK_LIST[tmpflock]))
        unlock.append(rs)

        # # 350TX
        # rs = RadioSetting("tx350", "350TX - unlock 350-400 MHz TX",
        #                   RadioSettingValueBoolean(
        #                       bool(_mem.lock.tx350 > 0)))
        # unlock.append(rs)

        # Killed
        rs = RadioSetting("Killed", "遥毙禁用",
                          RadioSettingValueBoolean(
                              bool(_mem.lock_killed > 0)))
        unlock.append(rs)

        # # 200TX
        # rs = RadioSetting("tx200", "200TX - unlock 174-350 MHz TX",
        #                   RadioSettingValueBoolean(
        #                       bool(_mem.lock.tx200 > 0)))
        # unlock.append(rs)
        #
        # # 500TX
        # rs = RadioSetting("tx500", "500TX - unlock 500-600 MHz TX",
        #                   RadioSettingValueBoolean(
        #                       bool(_mem.lock.tx500 > 0)))
        # unlock.append(rs)
        #
        # # 350EN
        # rs = RadioSetting("en350", "350EN - unlock 350-400 MHz RX",
        #                   RadioSettingValueBoolean(
        #                       bool(_mem.lock.en350 > 0)))
        # unlock.append(rs)

        # SCREEN
        rs = RadioSetting("scrambler", "扰频",
                          RadioSettingValueBoolean(
                              bool(_mem.lock_enscramble > 0)))
        unlock.append(rs)

        # readonly info
        # Firmware
        if self.FIRMWARE_VERSION == "":
            firmware = "获取固件版本需要先从电台下载数据"
        else:
            firmware = self.FIRMWARE_VERSION

        val = RadioSettingValueString(0, 128, firmware, charset=VALID_CHARACTERS)
        val.set_mutable(False)
        rs = RadioSetting("fw_ver", "固件版本", val)
        roinfo.append(rs)

        # No limits version for hacked firmware
        val = RadioSettingValueBoolean(self._expanded_limits)
        rs = RadioSetting("nolimits", "禁用限制(适用于第三方固件)",
                          val)
        rs.set_warning(
            '只有在使用宽频的第三方固件时，才应启用此功能。启用此选项将 CHIRP 无视 OEM 限制，可能导致未定义或未规范的行为。风险自负！',
            safe_value=False
        )
        roinfo.append(rs)

        return top

    # Store details about a high-level memory to the memory map
    # This is called when a user edits a memory in the UI
    def set_memory(self, mem):
        number = mem.number-1

        # Get a low-level memory object mapped to the image
        _mem = self._memobj.channel[number]
        _mem4 = self._memobj
        # empty memory
        if mem.empty:
            _mem.set_raw("\xFF" * 16)
            if number < 200:
                _mem2 = self._memobj.channelname[number]
                _mem2.set_raw("\xFF" * 16)
                _mem4.channel_attributes[number].is_scanlist1 = 0
                _mem4.channel_attributes[number].is_scanlist2 = 0
                _mem4.channel_attributes[number].unknown1 = 0
                _mem4.channel_attributes[number].unknown2 = 0
                _mem4.channel_attributes[number].is_free = 1
                _mem4.channel_attributes[number].band = 0x7
            return mem

        # clean the channel memory, restore some bits if it was used before
        if _mem.get_raw(asbytes=False)[0] == "\xff":
            # this was an empty memory
            _mem.set_raw("\x00" * 16)
        else:
            # this memory wasn't empty, save some bits that we don't know the
            # meaning of, or that we don't support yet
            prev_0a = _mem.get_raw()[0x0a] & SAVE_MASK_0A
            prev_0b = _mem.get_raw()[0x0b] & SAVE_MASK_0B
            prev_0c = _mem.get_raw()[0x0c] & SAVE_MASK_0C
            prev_0d = _mem.get_raw()[0x0d] & SAVE_MASK_0D
            prev_0e = _mem.get_raw()[0x0e] & SAVE_MASK_0E
            prev_0f = _mem.get_raw()[0x0f] & SAVE_MASK_0F
            _mem.set_raw("\x00" * 10 +
                         chr(prev_0a) + chr(prev_0b) + chr(prev_0c) +
                         chr(prev_0d) + chr(prev_0e) + chr(prev_0f))

        if number < 200:
            _mem4.channel_attributes[number].is_scanlist1 = 0
            _mem4.channel_attributes[number].is_scanlist2 = 0
            _mem4.channel_attributes[number].unknown1 = 0
            _mem4.channel_attributes[number].unknown2 = 0
            _mem4.channel_attributes[number].is_free = 1
            _mem4.channel_attributes[number].band = 0x7

        # find band
        band = _find_band(self, mem.freq)

        # mode
        if mem.mode == "NFM":
            _mem.bandwidth = 1
            _mem.enable_am = 0
        elif mem.mode == "FM":
            _mem.bandwidth = 0
            _mem.enable_am = 0
        elif mem.mode == "NAM":
            _mem.bandwidth = 1
            _mem.enable_am = 1
        elif mem.mode == "AM":
            _mem.bandwidth = 0
            _mem.enable_am = 1

        # frequency/offset
        _mem.freq = mem.freq/10
        _mem.offset = mem.offset/10

        if mem.duplex == "":
            _mem.offset = 0
            _mem.shift = 0
        elif mem.duplex == '-':
            _mem.shift = FLAGS1_OFFSET_MINUS
        elif mem.duplex == '+':
            _mem.shift = FLAGS1_OFFSET_PLUS
        elif mem.duplex == 'off':
            # we fake tx disable by setting the tx freq to 0 MHz
            _mem.shift = FLAGS1_OFFSET_MINUS
            _mem.offset = _mem.freq

        # set band
        if number < 200:
            _mem4.channel_attributes[number].is_free = 0
            _mem4.channel_attributes[number].band = band

        # channels >200 are the 14 VFO chanells and don't have names
        if number < 200:
            _mem2 = self._memobj.channelname[number]
            text = convert_chinese_to_ascii_chars(mem.name)
            if len(text) < 16:
                text += "\x00" * (16-len(text))
            elif len(text) >= 16:
                text = text[:16]
            _mem2.name = text  # Store the alpha tag

        # tone data
        self._set_tone(mem, _mem)

        # step
        _mem.step = STEPS.index(mem.tuning_step)

        # tx power
        if str(mem.power) == str(UVK5_POWER_LEVELS[2]):
            _mem.txpower = POWER_HIGH
        elif str(mem.power) == str(UVK5_POWER_LEVELS[1]):
            _mem.txpower = POWER_MEDIUM
        else:
            _mem.txpower = POWER_LOW

        for setting in mem.extra:
            sname = setting.get_name()
            svalue = setting.value.get_value()

            if sname == "bclo":
                _mem.bclo = svalue and 1 or 0

            if sname == "pttid":
                _mem.dtmf_pttid = PTTID_LIST.index(svalue)

            if sname == "frev":
                _mem.freq_reverse = svalue and 1 or 0

            if sname == "dtmfdecode":
                _mem.dtmf_decode = svalue and 1 or 0

            if sname == "scrambler":
                _mem.scrambler = (
                    _mem.scrambler & 0xf0) | SCRAMBLER_LIST.index(svalue)

            if number < 200 and sname == "scanlists":
                if svalue == "1":
                    _mem4.channel_attributes[number].is_scanlist1 = 1
                    _mem4.channel_attributes[number].is_scanlist2 = 0
                elif svalue == "2":
                    _mem4.channel_attributes[number].is_scanlist1 = 0
                    _mem4.channel_attributes[number].is_scanlist2 = 1
                elif svalue == "1+2":
                    _mem4.channel_attributes[number].is_scanlist1 = 1
                    _mem4.channel_attributes[number].is_scanlist2 = 1
                else:
                    _mem4.channel_attributes[number].is_scanlist1 = 0
                    _mem4.channel_attributes[number].is_scanlist2 = 0

        return mem